Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x297 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xb9e05): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x4bc8d): ../App/Src/app.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x228d1): C:/Users/ipave/Documentos/GitHub/RTOSI/freertos_app_Example4_6/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x70e0f): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x419d7): __uint8_t
    <35>   DW_AT_decl_file   : 3
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)

    <26f>   DW_AT_low_pc      : 0x800060a
    <273>   DW_AT_high_pc     : 0x14
    <277>   DW_AT_call_file   : 1
    <278>   DW_AT_call_line   : 120
    <279>   DW_AT_call_column : 2
 <3><27a>: Abbrev Number: 17 (DW_TAG_variable)
    <27b>   DW_AT_abstract_origin: <0x28d>
    <27f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><282>: Abbrev Number: 0
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 19 (DW_TAG_subprogram)
    <285>   DW_AT_name        : (indirect string, offset: 0xc0c3b): vPortRaiseBASEPRI
    <289>   DW_AT_decl_file   : 2
    <28a>   DW_AT_decl_line   : 191
    <28b>   DW_AT_decl_column : 30
    <28c>   DW_AT_prototyped  : 1
    <28c>   DW_AT_inline      : 3	(declared as inline and inlined)
 <2><28d>: Abbrev Number: 20 (DW_TAG_variable)
    <28e>   DW_AT_name        : (indirect string, offset: 0xcc066): ulNewBASEPRI
    <292>   DW_AT_decl_file   : 2
    <293>   DW_AT_decl_line   : 193
    <294>   DW_AT_decl_column : 10
    <295>   DW_AT_type        : <0xb5>
 <2><299>: Abbrev Number: 0
 <1><29a>: Abbrev Number: 0
  Compilation Unit @ offset 0x29b:
   Length:        0x38e (32-bit)
   Version:       4
   Abbrev Offset: 0x125
   Pointer Size:  4
 <0><2a6>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <2a7>   DW_AT_producer    : (indirect string, offset: 0xb9e05): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <2ab>   DW_AT_language    : 12	(ANSI C99)
    <2ac>   DW_AT_name        : (indirect string, offset: 0xe2664): ../App/Src/task_Button.c
    <2b0>   DW_AT_comp_dir    : (indirect string, offset: 0x228d1): C:/Users/ipave/Documentos/GitHub/RTOSI/freertos_app_Example4_6/Debug
    <2b4>   DW_AT_ranges      : 0x10
    <2b8>   DW_AT_low_pc      : 0x0
    <2bc>   DW_AT_stmt_list   : 0xbf9
    <2c0>   DW_AT_GNU_macros  : 0x2405d
 <1><2c4>: Abbrev Number: 2 (DW_TAG_base_type)
    <2c5>   DW_AT_byte_size   : 1
    <2c6>   DW_AT_encoding    : 6	(signed char)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x70e0f): signed char
 <1><2cb>: Abbrev Number: 2 (DW_TAG_base_type)
    <2cc>   DW_AT_byte_size   : 1
    <2cd>   DW_AT_encoding    : 8	(unsigned char)
    <2ce>   DW_AT_name        : (indirect string, offset: 0xd9b5e): unsigned char
 <1><2d2>: Abbrev Number: 2 (DW_TAG_base_type)
    <2d3>   DW_AT_byte_size   : 2
    <2d4>   DW_AT_encoding    : 5	(signed)
    <2d5>   DW_AT_name        : (indirect string, offset: 0xa805f): short int
 <1><2d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <2da>   DW_AT_name        : (indirect string, offset: 0xb7d11): __uint16_t
    <2de>   DW_AT_decl_file   : 2
    <2df>   DW_AT_decl_line   : 57
    <2e0>   DW_AT_decl_column : 25
    <2e1>   DW_AT_type        : <0x2e5>
 <1><2e5>: Abbrev Number: 2 (DW_TAG_base_type)
    <2e6>   DW_AT_byte_size   : 2
    <2e7>   DW_AT_encoding    : 7	(unsigned)
    <2e8>   DW_AT_name        : (indirect string, offset: 0xd8304): short unsigned int
 <1><2ec>: Abbrev Number: 2 (DW_TAG_base_type)
    <2ed>   DW_AT_byte_size   : 4
    <2ee>   DW_AT_encoding    : 5	(signed)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x1333c): long int
 <1><2f3>: Abbrev Number: 3 (DW_TAG_typedef)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x8fcd5): __uint32_t
    <2f8>   DW_AT_decl_file   : 2
    <2f9>   DW_AT_decl_line   : 79
    <2fa>   DW_AT_decl_column : 25
    <2fb>   DW_AT_type        : <0x2ff>
 <1><2ff>: Abbrev Number: 2 (DW_TAG_base_type)
    <300>   DW_AT_byte_size   : 4
    <301>   DW_AT_encoding    : 7	(unsigned)
    <302>   DW_AT_name        : (indirect string, offset: 0x56492): long unsigned int
 <1><306>: Abbrev Number: 2 (DW_TAG_base_type)
    <307>   DW_AT_byte_size   : 8
    <308>   DW_AT_encoding    : 5	(signed)
    <309>   DW_AT_name        : (indirect string, offset: 0x66bf8): long long int
 <1><30d>: Abbrev Number: 2 (DW_TAG_base_type)
    <30e>   DW_AT_byte_size   : 8
    <30f>   DW_AT_encoding    : 7	(unsigned)
    <310>   DW_AT_name        : (indirect string, offset: 0x2f437): long long unsigned int
 <1><314>: Abbrev Number: 4 (DW_TAG_base_type)
    <315>   DW_AT_byte_size   : 4
    <316>   DW_AT_encoding    : 5	(signed)
    <317>   DW_AT_name        : int
 <1><31b>: Abbrev Number: 2 (DW_TAG_base_type)
    <31c>   DW_AT_byte_size   : 4
    <31d>   DW_AT_encoding    : 7	(unsigned)
    <31e>   DW_AT_name        : (indirect string, offset: 0x127ef): unsigned int
 <1><322>: Abbrev Number: 3 (DW_TAG_typedef)
    <323>   DW_AT_name        : (indirect string, offset: 0xa47b8): uint16_t
    <327>   DW_AT_decl_file   : 3
    <328>   DW_AT_decl_line   : 36
    <329>   DW_AT_decl_column : 20
    <32a>   DW_AT_type        : <0x2d9>
 <1><32e>: Abbrev Number: 3 (DW_TAG_typedef)
    <32f>   DW_AT_name        : (indirect string, offset: 0xd7e50): uint32_t
    <333>   DW_AT_decl_file   : 3
    <334>   DW_AT_decl_line   : 48
    <335>   DW_AT_decl_column : 20
    <336>   DW_AT_type        : <0x2f3>
 <1><33a>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <33b>   DW_AT_type        : <0x32e>
 <1><33f>: Abbrev Number: 6 (DW_TAG_array_type)
    <340>   DW_AT_type        : <0x33a>
    <344>   DW_AT_sibling     : <0x34f>
 <2><348>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <349>   DW_AT_type        : <0x31b>
    <34d>   DW_AT_upper_bound : 1
 <2><34e>: Abbrev Number: 0
 <1><34f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <350>   DW_AT_type        : <0x33f>
 <1><354>: Abbrev Number: 8 (DW_TAG_structure_type)
    <355>   DW_AT_byte_size   : 40
    <356>   DW_AT_decl_file   : 4
    <357>   DW_AT_decl_line   : 574
    <359>   DW_AT_decl_column : 9
    <35a>   DW_AT_sibling     : <0x3dd>
 <2><35e>: Abbrev Number: 9 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0xe260f): MODER
    <363>   DW_AT_decl_file   : 4
    <364>   DW_AT_decl_line   : 576
    <366>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0x33a>
    <36b>   DW_AT_data_member_location: 0
 <2><36c>: Abbrev Number: 9 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0xe2709): OTYPER
    <371>   DW_AT_decl_file   : 4
    <372>   DW_AT_decl_line   : 577
    <374>   DW_AT_decl_column : 17
    <375>   DW_AT_type        : <0x33a>
    <379>   DW_AT_data_member_location: 4
 <2><37a>: Abbrev Number: 9 (DW_TAG_member)
    <37b>   DW_AT_name        : (indirect string, offset: 0xe275c): OSPEEDR
    <37f>   DW_AT_decl_file   : 4
    <380>   DW_AT_decl_line   : 578
    <382>   DW_AT_decl_column : 17
    <383>   DW_AT_type        : <0x33a>
    <387>   DW_AT_data_member_location: 8
 <2><388>: Abbrev Number: 9 (DW_TAG_member)
    <389>   DW_AT_name        : (indirect string, offset: 0xe26e6): PUPDR
    <38d>   DW_AT_decl_file   : 4
    <38e>   DW_AT_decl_line   : 579
    <390>   DW_AT_decl_column : 17
    <391>   DW_AT_type        : <0x33a>
    <395>   DW_AT_data_member_location: 12
 <2><396>: Abbrev Number: 10 (DW_TAG_member)
    <397>   DW_AT_name        : IDR
    <39b>   DW_AT_decl_file   : 4
    <39c>   DW_AT_decl_line   : 580
    <39e>   DW_AT_decl_column : 17
    <39f>   DW_AT_type        : <0x33a>
    <3a3>   DW_AT_data_member_location: 16
 <2><3a4>: Abbrev Number: 10 (DW_TAG_member)
    <3a5>   DW_AT_name        : ODR
    <3a9>   DW_AT_decl_file   : 4
    <3aa>   DW_AT_decl_line   : 581
    <3ac>   DW_AT_decl_column : 17
    <3ad>   DW_AT_type        : <0x33a>
    <3b1>   DW_AT_data_member_location: 20
 <2><3b2>: Abbrev Number: 9 (DW_TAG_member)
    <3b3>   DW_AT_name        : (indirect string, offset: 0xe268c): BSRR
    <3b7>   DW_AT_decl_file   : 4
    <3b8>   DW_AT_decl_line   : 582
    <3ba>   DW_AT_decl_column : 17
    <3bb>   DW_AT_type        : <0x33a>
    <3bf>   DW_AT_data_member_location: 24
 <2><3c0>: Abbrev Number: 9 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0xe2757): LCKR
    <3c5>   DW_AT_decl_file   : 4
    <3c6>   DW_AT_decl_line   : 583
    <3c8>   DW_AT_decl_column : 17
    <3c9>   DW_AT_type        : <0x33a>
    <3cd>   DW_AT_data_member_location: 28
 <2><3ce>: Abbrev Number: 10 (DW_TAG_member)
    <3cf>   DW_AT_name        : AFR
    <3d3>   DW_AT_decl_file   : 4
    <3d4>   DW_AT_decl_line   : 584
    <3d6>   DW_AT_decl_column : 17
    <3d7>   DW_AT_type        : <0x34f>
    <3db>   DW_AT_data_member_location: 32
 <2><3dc>: Abbrev Number: 0
 <1><3dd>: Abbrev Number: 11 (DW_TAG_typedef)
    <3de>   DW_AT_name        : (indirect string, offset: 0xe2798): GPIO_TypeDef
    <3e2>   DW_AT_decl_file   : 4
    <3e3>   DW_AT_decl_line   : 585
    <3e5>   DW_AT_decl_column : 3
    <3e6>   DW_AT_type        : <0x354>
 <1><3ea>: Abbrev Number: 2 (DW_TAG_base_type)
    <3eb>   DW_AT_byte_size   : 8
    <3ec>   DW_AT_encoding    : 4	(float)
    <3ed>   DW_AT_name        : (indirect string, offset: 0xe22cb): long double
 <1><3f1>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <3f2>   DW_AT_encoding    : 7	(unsigned)
    <3f3>   DW_AT_byte_size   : 1
    <3f4>   DW_AT_type        : <0x2cb>
    <3f8>   DW_AT_decl_file   : 5
    <3f9>   DW_AT_decl_line   : 68
    <3fa>   DW_AT_decl_column : 1
    <3fb>   DW_AT_sibling     : <0x40c>
 <2><3ff>: Abbrev Number: 13 (DW_TAG_enumerator)
    <400>   DW_AT_name        : (indirect string, offset: 0xe267d): GPIO_PIN_RESET
    <404>   DW_AT_const_value : 0
 <2><405>: Abbrev Number: 13 (DW_TAG_enumerator)
    <406>   DW_AT_name        : (indirect string, offset: 0xe2691): GPIO_PIN_SET
    <40a>   DW_AT_const_value : 1
 <2><40b>: Abbrev Number: 0
 <1><40c>: Abbrev Number: 3 (DW_TAG_typedef)
    <40d>   DW_AT_name        : (indirect string, offset: 0xe27a5): GPIO_PinState
    <411>   DW_AT_decl_file   : 5
    <412>   DW_AT_decl_line   : 71
    <413>   DW_AT_decl_column : 2
    <414>   DW_AT_type        : <0x3f1>
 <1><418>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <419>   DW_AT_byte_size   : 4
 <1><41a>: Abbrev Number: 3 (DW_TAG_typedef)
    <41b>   DW_AT_name        : (indirect string, offset: 0x1748): BaseType_t
    <41f>   DW_AT_decl_file   : 6
    <420>   DW_AT_decl_line   : 56
    <421>   DW_AT_decl_column : 14
    <422>   DW_AT_type        : <0x2ec>
 <1><426>: Abbrev Number: 15 (DW_TAG_const_type)
    <427>   DW_AT_type        : <0x41a>
 <1><42b>: Abbrev Number: 3 (DW_TAG_typedef)
    <42c>   DW_AT_name        : (indirect string, offset: 0x173ec): TickType_t
    <430>   DW_AT_decl_file   : 6
    <431>   DW_AT_decl_line   : 63
    <432>   DW_AT_decl_column : 19
    <433>   DW_AT_type        : <0x32e>
 <1><437>: Abbrev Number: 15 (DW_TAG_const_type)
    <438>   DW_AT_type        : <0x42b>
 <1><43c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <43d>   DW_AT_byte_size   : 4
    <43e>   DW_AT_type        : <0x442>
 <1><442>: Abbrev Number: 2 (DW_TAG_base_type)
    <443>   DW_AT_byte_size   : 1
    <444>   DW_AT_encoding    : 8	(unsigned char)
    <445>   DW_AT_name        : (indirect string, offset: 0x11d73): char
 <1><449>: Abbrev Number: 15 (DW_TAG_const_type)
    <44a>   DW_AT_type        : <0x442>
 <1><44e>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <44f>   DW_AT_byte_size   : 4
    <450>   DW_AT_type        : <0x449>
 <1><454>: Abbrev Number: 3 (DW_TAG_typedef)
    <455>   DW_AT_name        : (indirect string, offset: 0x5b9c2): TaskHandle_t
    <459>   DW_AT_decl_file   : 7
    <45a>   DW_AT_decl_line   : 70
    <45b>   DW_AT_decl_column : 37
    <45c>   DW_AT_type        : <0x460>
 <1><460>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <461>   DW_AT_byte_size   : 4
    <462>   DW_AT_type        : <0x466>
 <1><466>: Abbrev Number: 17 (DW_TAG_structure_type)
    <467>   DW_AT_name        : (indirect string, offset: 0xbf808): tskTaskControlBlock
    <46b>   DW_AT_declaration : 1
 <1><46b>: Abbrev Number: 3 (DW_TAG_typedef)
    <46c>   DW_AT_name        : (indirect string, offset: 0x50c6e): QueueHandle_t
    <470>   DW_AT_decl_file   : 8
    <471>   DW_AT_decl_line   : 48
    <472>   DW_AT_decl_column : 34
    <473>   DW_AT_type        : <0x477>
 <1><477>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <478>   DW_AT_byte_size   : 4
    <479>   DW_AT_type        : <0x47d>
 <1><47d>: Abbrev Number: 17 (DW_TAG_structure_type)
    <47e>   DW_AT_name        : (indirect string, offset: 0x957c1): QueueDefinition
    <482>   DW_AT_declaration : 1
 <1><482>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <483>   DW_AT_byte_size   : 4
    <484>   DW_AT_type        : <0x48d>
 <1><488>: Abbrev Number: 15 (DW_TAG_const_type)
    <489>   DW_AT_type        : <0x482>
 <1><48d>: Abbrev Number: 18 (DW_TAG_const_type)
 <1><48e>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <48f>   DW_AT_name        : (indirect string, offset: 0xe2615): ledFlag_e
    <493>   DW_AT_encoding    : 7	(unsigned)
    <494>   DW_AT_byte_size   : 1
    <495>   DW_AT_type        : <0x2cb>
    <499>   DW_AT_decl_file   : 9
    <49a>   DW_AT_decl_line   : 59
    <49b>   DW_AT_decl_column : 14
    <49c>   DW_AT_sibling     : <0x4ad>
 <2><4a0>: Abbrev Number: 13 (DW_TAG_enumerator)
    <4a1>   DW_AT_name        : (indirect string, offset: 0xe2700): Blinking
    <4a5>   DW_AT_const_value : 0
 <2><4a6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <4a7>   DW_AT_name        : (indirect string, offset: 0xe26fd): NotBlinking
    <4ab>   DW_AT_const_value : 1
 <2><4ac>: Abbrev Number: 0
 <1><4ad>: Abbrev Number: 3 (DW_TAG_typedef)
    <4ae>   DW_AT_name        : (indirect string, offset: 0xe2646): ledFlag_t
    <4b2>   DW_AT_decl_file   : 9
    <4b3>   DW_AT_decl_line   : 59
    <4b4>   DW_AT_decl_column : 49
    <4b5>   DW_AT_type        : <0x48e>
 <1><4b9>: Abbrev Number: 20 (DW_TAG_structure_type)
    <4ba>   DW_AT_byte_size   : 12
    <4bb>   DW_AT_decl_file   : 9
    <4bc>   DW_AT_decl_line   : 61
    <4bd>   DW_AT_decl_column : 9
    <4be>   DW_AT_sibling     : <0x504>
 <2><4c2>: Abbrev Number: 21 (DW_TAG_member)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xe26b1): LDX_GPIO_Port
    <4c7>   DW_AT_decl_file   : 9
    <4c8>   DW_AT_decl_line   : 63
    <4c9>   DW_AT_decl_column : 16
    <4ca>   DW_AT_type        : <0x504>
    <4ce>   DW_AT_data_member_location: 0
 <2><4cf>: Abbrev Number: 21 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xe269e): LDX_Pin
    <4d4>   DW_AT_decl_file   : 9
    <4d5>   DW_AT_decl_line   : 64
    <4d6>   DW_AT_decl_column : 12
    <4d7>   DW_AT_type        : <0x322>
    <4db>   DW_AT_data_member_location: 4
 <2><4dc>: Abbrev Number: 21 (DW_TAG_member)
    <4dd>   DW_AT_name        : (indirect string, offset: 0xe2650): ledState
    <4e1>   DW_AT_decl_file   : 9
    <4e2>   DW_AT_decl_line   : 65
    <4e3>   DW_AT_decl_column : 16
    <4e4>   DW_AT_type        : <0x40c>
    <4e8>   DW_AT_data_member_location: 6
 <2><4e9>: Abbrev Number: 21 (DW_TAG_member)
    <4ea>   DW_AT_name        : (indirect string, offset: 0xe2764): ledFlag
    <4ee>   DW_AT_decl_file   : 9
    <4ef>   DW_AT_decl_line   : 66
    <4f0>   DW_AT_decl_column : 13
    <4f1>   DW_AT_type        : <0x4ad>
    <4f5>   DW_AT_data_member_location: 7
 <2><4f6>: Abbrev Number: 21 (DW_TAG_member)
    <4f7>   DW_AT_name        : (indirect string, offset: 0xe26bf): ledTickCnt
    <4fb>   DW_AT_decl_file   : 9
    <4fc>   DW_AT_decl_line   : 67
    <4fd>   DW_AT_decl_column : 15
    <4fe>   DW_AT_type        : <0x42b>
    <502>   DW_AT_data_member_location: 8
 <2><503>: Abbrev Number: 0
 <1><504>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <505>   DW_AT_byte_size   : 4
    <506>   DW_AT_type        : <0x3dd>
 <1><50a>: Abbrev Number: 3 (DW_TAG_typedef)
    <50b>   DW_AT_name        : (indirect string, offset: 0xe2722): LDX_Config_t
    <50f>   DW_AT_decl_file   : 9
    <510>   DW_AT_decl_line   : 68
    <511>   DW_AT_decl_column : 3
    <512>   DW_AT_type        : <0x4b9>
 <1><516>: Abbrev Number: 6 (DW_TAG_array_type)
    <517>   DW_AT_type        : <0x50a>
    <51b>   DW_AT_sibling     : <0x521>
 <2><51f>: Abbrev Number: 22 (DW_TAG_subrange_type)
 <2><520>: Abbrev Number: 0
 <1><521>: Abbrev Number: 23 (DW_TAG_variable)
    <522>   DW_AT_name        : (indirect string, offset: 0xe2604): LDX_Config
    <526>   DW_AT_decl_file   : 9
    <527>   DW_AT_decl_line   : 70
    <528>   DW_AT_decl_column : 21
    <529>   DW_AT_type        : <0x516>
    <52d>   DW_AT_external    : 1
    <52d>   DW_AT_declaration : 1
 <1><52d>: Abbrev Number: 24 (DW_TAG_variable)
    <52e>   DW_AT_name        : (indirect string, offset: 0xe276c): pcTextForTask_BlinkingOn
    <532>   DW_AT_decl_file   : 1
    <533>   DW_AT_decl_line   : 78
    <534>   DW_AT_decl_column : 13
    <535>   DW_AT_type        : <0x44e>
    <539>   DW_AT_external    : 1
    <539>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><53f>: Abbrev Number: 24 (DW_TAG_variable)
    <540>   DW_AT_name        : (indirect string, offset: 0xe262c): pcTextForTask_BlinkingOff
    <544>   DW_AT_decl_file   : 1
    <545>   DW_AT_decl_line   : 79
    <546>   DW_AT_decl_column : 13
    <547>   DW_AT_type        : <0x44e>
    <54b>   DW_AT_external    : 1
    <54b>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><551>: Abbrev Number: 25 (DW_TAG_subprogram)
    <552>   DW_AT_external    : 1
    <552>   DW_AT_name        : (indirect string, offset: 0xe26db): vTaskDelay
    <556>   DW_AT_decl_file   : 7
    <557>   DW_AT_decl_line   : 758
    <559>   DW_AT_decl_column : 6
    <55a>   DW_AT_prototyped  : 1
    <55a>   DW_AT_declaration : 1
    <55a>   DW_AT_sibling     : <0x564>
 <2><55e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <55f>   DW_AT_type        : <0x437>
 <2><563>: Abbrev Number: 0
 <1><564>: Abbrev Number: 27 (DW_TAG_subprogram)
    <565>   DW_AT_external    : 1
    <565>   DW_AT_name        : (indirect string, offset: 0xe2710): xQueueGenericSend
    <569>   DW_AT_decl_file   : 8
    <56a>   DW_AT_decl_line   : 650
    <56c>   DW_AT_decl_column : 12
    <56d>   DW_AT_prototyped  : 1
    <56d>   DW_AT_type        : <0x41a>
    <571>   DW_AT_declaration : 1
    <571>   DW_AT_sibling     : <0x58a>
 <2><575>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <576>   DW_AT_type        : <0x46b>
 <2><57a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <57b>   DW_AT_type        : <0x488>
 <2><57f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <580>   DW_AT_type        : <0x42b>
 <2><584>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <585>   DW_AT_type        : <0x426>
 <2><589>: Abbrev Number: 0
 <1><58a>: Abbrev Number: 28 (DW_TAG_subprogram)
    <58b>   DW_AT_external    : 1
    <58b>   DW_AT_name        : (indirect string, offset: 0xe26ec): HAL_GPIO_ReadPin
    <58f>   DW_AT_decl_file   : 5
    <590>   DW_AT_decl_line   : 234
    <591>   DW_AT_decl_column : 15
    <592>   DW_AT_prototyped  : 1
    <592>   DW_AT_type        : <0x40c>
    <596>   DW_AT_declaration : 1
    <596>   DW_AT_sibling     : <0x5a5>
 <2><59a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <59b>   DW_AT_type        : <0x504>
 <2><59f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <5a0>   DW_AT_type        : <0x322>
 <2><5a4>: Abbrev Number: 0
 <1><5a5>: Abbrev Number: 29 (DW_TAG_subprogram)
    <5a6>   DW_AT_external    : 1
    <5a6>   DW_AT_name        : (indirect string, offset: 0xe26ca): vPrintTwoStrings
    <5aa>   DW_AT_decl_file   : 10
    <5ab>   DW_AT_decl_line   : 76
    <5ac>   DW_AT_decl_column : 6
    <5ad>   DW_AT_prototyped  : 1
    <5ad>   DW_AT_declaration : 1
    <5ad>   DW_AT_sibling     : <0x5bc>
 <2><5b1>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <5b2>   DW_AT_type        : <0x44e>
 <2><5b6>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <5b7>   DW_AT_type        : <0x44e>
 <2><5bb>: Abbrev Number: 0
 <1><5bc>: Abbrev Number: 27 (DW_TAG_subprogram)
    <5bd>   DW_AT_external    : 1
    <5bd>   DW_AT_name        : (indirect string, offset: 0x532d7): pcTaskGetName
    <5c1>   DW_AT_decl_file   : 7
    <5c2>   DW_AT_decl_line   : 1399
    <5c4>   DW_AT_decl_column : 7
    <5c5>   DW_AT_prototyped  : 1
    <5c5>   DW_AT_type        : <0x43c>
    <5c9>   DW_AT_declaration : 1
    <5c9>   DW_AT_sibling     : <0x5d3>
 <2><5cd>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <5ce>   DW_AT_type        : <0x454>
 <2><5d2>: Abbrev Number: 0
 <1><5d3>: Abbrev Number: 30 (DW_TAG_subprogram)
    <5d4>   DW_AT_external    : 1
    <5d4>   DW_AT_name        : (indirect string, offset: 0x828fd): vTaskButton
    <5d8>   DW_AT_decl_file   : 1
    <5d9>   DW_AT_decl_line   : 91
    <5da>   DW_AT_decl_column : 6
    <5db>   DW_AT_prototyped  : 1
    <5db>   DW_AT_low_pc      : 0x8000648
    <5df>   DW_AT_high_pc     : 0x88
    <5e3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5e5>   DW_AT_GNU_all_tail_call_sites: 1
    <5e5>   DW_AT_sibling     : <0x626>
 <2><5e9>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <5ea>   DW_AT_name        : (indirect string, offset: 0xe261f): pvParameters
    <5ee>   DW_AT_decl_file   : 1
    <5ef>   DW_AT_decl_line   : 91
    <5f0>   DW_AT_decl_column : 25
    <5f1>   DW_AT_type        : <0x418>
    <5f5>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><5f8>: Abbrev Number: 32 (DW_TAG_variable)
    <5f9>   DW_AT_name        : (indirect string, offset: 0xe2659): LED_config
    <5fd>   DW_AT_decl_file   : 1
    <5fe>   DW_AT_decl_line   : 94
    <5ff>   DW_AT_decl_column : 16
    <600>   DW_AT_type        : <0x626>
    <604>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><607>: Abbrev Number: 32 (DW_TAG_variable)
    <608>   DW_AT_name        : (indirect string, offset: 0x93b4b): QueueLEDHandle
    <60c>   DW_AT_decl_file   : 1
    <60d>   DW_AT_decl_line   : 96
    <60e>   DW_AT_decl_column : 16
    <60f>   DW_AT_type        : <0x46b>
    <613>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><616>: Abbrev Number: 32 (DW_TAG_variable)
    <617>   DW_AT_name        : (indirect string, offset: 0xe26a6): pcTaskName
    <61b>   DW_AT_decl_file   : 1
    <61c>   DW_AT_decl_line   : 98
    <61d>   DW_AT_decl_column : 8
    <61e>   DW_AT_type        : <0x43c>
    <622>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><625>: Abbrev Number: 0
 <1><626>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <627>   DW_AT_byte_size   : 4
    <628>   DW_AT_type        : <0x50a>
 <1><62c>: Abbrev Number: 0
  Compilation Unit @ offset 0x62d:
   Length:        0x3c2 (32-bit)
   Version:       4
   Abbrev Offset: 0x2f8
   Pointer Size:  4
 <0><638>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <639>   DW_AT_producer    : (indirect string, offset: 0xb9e05): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <63d>   DW_AT_language    : 12	(ANSI C99)
    <63e>   DW_AT_name        : (indirect string, offset: 0xe2811): ../App/Src/task_Led.c
    <642>   DW_AT_comp_dir    : (indirect string, offset: 0x228d1): C:/Users/ipave/Documentos/GitHub/RTOSI/freertos_app_Example4_6/Debug
    <646>   DW_AT_ranges      : 0x20
    <64a>   DW_AT_low_pc      : 0x0
    <64e>   DW_AT_stmt_list   : 0x17ef
    <652>   DW_AT_GNU_macros  : 0x24526
 <1><656>: Abbrev Number: 2 (DW_TAG_base_type)
    <657>   DW_AT_byte_size   : 1
    <658>   DW_AT_encoding    : 6	(signed char)
    <659>   DW_AT_name        : (indirect string, offset: 0x70e0f): signed char
 <1><65d>: Abbrev Number: 2 (DW_TAG_base_type)
    <65e>   DW_AT_byte_size   : 1
    <65f>   DW_AT_encoding    : 8	(unsigned char)
    <660>   DW_AT_name        : (indirect string, offset: 0xd9b5e): unsigned char
 <1><664>: Abbrev Number: 2 (DW_TAG_base_type)
    <665>   DW_AT_byte_size   : 2
    <666>   DW_AT_encoding    : 5	(signed)
    <667>   DW_AT_name        : (indirect string, offset: 0xa805f): short int
 <1><66b>: Abbrev Number: 3 (DW_TAG_typedef)
    <66c>   DW_AT_name        : (indirect string, offset: 0xb7d11): __uint16_t
    <670>   DW_AT_decl_file   : 2
    <671>   DW_AT_decl_line   : 57
    <672>   DW_AT_decl_column : 25
    <673>   DW_AT_type        : <0x677>
 <1><677>: Abbrev Number: 2 (DW_TAG_base_type)
    <678>   DW_AT_byte_size   : 2
    <679>   DW_AT_encoding    : 7	(unsigned)
    <67a>   DW_AT_name        : (indirect string, offset: 0xd8304): short unsigned int
 <1><67e>: Abbrev Number: 2 (DW_TAG_base_type)
    <67f>   DW_AT_byte_size   : 4
    <680>   DW_AT_encoding    : 5	(signed)
    <681>   DW_AT_name        : (indirect string, offset: 0x1333c): long int
 <1><685>: Abbrev Number: 3 (DW_TAG_typedef)
    <686>   DW_AT_name        : (indirect string, offset: 0x8fcd5): __uint32_t
    <68a>   DW_AT_decl_file   : 2
    <68b>   DW_AT_decl_line   : 79
    <68c>   DW_AT_decl_column : 25
    <68d>   DW_AT_type        : <0x691>
 <1><691>: Abbrev Number: 2 (DW_TAG_base_type)
    <692>   DW_AT_byte_size   : 4
    <693>   DW_AT_encoding    : 7	(unsigned)
    <694>   DW_AT_name        : (indirect string, offset: 0x56492): long unsigned int
 <1><698>: Abbrev Number: 2 (DW_TAG_base_type)
    <699>   DW_AT_byte_size   : 8
    <69a>   DW_AT_encoding    : 5	(signed)
    <69b>   DW_AT_name        : (indirect string, offset: 0x66bf8): long long int
 <1><69f>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a0>   DW_AT_byte_size   : 8
    <6a1>   DW_AT_encoding    : 7	(unsigned)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x2f437): long long unsigned int
 <1><6a6>: Abbrev Number: 4 (DW_TAG_base_type)
    <6a7>   DW_AT_byte_size   : 4
    <6a8>   DW_AT_encoding    : 5	(signed)
    <6a9>   DW_AT_name        : int
 <1><6ad>: Abbrev Number: 2 (DW_TAG_base_type)
    <6ae>   DW_AT_byte_size   : 4
    <6af>   DW_AT_encoding    : 7	(unsigned)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x127ef): unsigned int
 <1><6b4>: Abbrev Number: 3 (DW_TAG_typedef)
    <6b5>   DW_AT_name        : (indirect string, offset: 0xa47b8): uint16_t
    <6b9>   DW_AT_decl_file   : 3
    <6ba>   DW_AT_decl_line   : 36
    <6bb>   DW_AT_decl_column : 20
    <6bc>   DW_AT_type        : <0x66b>
 <1><6c0>: Abbrev Number: 3 (DW_TAG_typedef)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xd7e50): uint32_t
    <6c5>   DW_AT_decl_file   : 3
    <6c6>   DW_AT_decl_line   : 48
    <6c7>   DW_AT_decl_column : 20
    <6c8>   DW_AT_type        : <0x685>
 <1><6cc>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <6cd>   DW_AT_type        : <0x6c0>
 <1><6d1>: Abbrev Number: 6 (DW_TAG_array_type)
    <6d2>   DW_AT_type        : <0x6cc>
    <6d6>   DW_AT_sibling     : <0x6e1>
 <2><6da>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <6db>   DW_AT_type        : <0x6ad>
    <6df>   DW_AT_upper_bound : 1
 <2><6e0>: Abbrev Number: 0
 <1><6e1>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <6e2>   DW_AT_type        : <0x6d1>
 <1><6e6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <6e7>   DW_AT_byte_size   : 40
    <6e8>   DW_AT_decl_file   : 4
    <6e9>   DW_AT_decl_line   : 574
    <6eb>   DW_AT_decl_column : 9
    <6ec>   DW_AT_sibling     : <0x76f>
 <2><6f0>: Abbrev Number: 9 (DW_TAG_member)
    <6f1>   DW_AT_name        : (indirect string, offset: 0xe260f): MODER
    <6f5>   DW_AT_decl_file   : 4
    <6f6>   DW_AT_decl_line   : 576
    <6f8>   DW_AT_decl_column : 17
    <6f9>   DW_AT_type        : <0x6cc>
    <6fd>   DW_AT_data_member_location: 0
 <2><6fe>: Abbrev Number: 9 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xe2709): OTYPER
    <703>   DW_AT_decl_file   : 4
    <704>   DW_AT_decl_line   : 577
    <706>   DW_AT_decl_column : 17
    <707>   DW_AT_type        : <0x6cc>
    <70b>   DW_AT_data_member_location: 4
 <2><70c>: Abbrev Number: 9 (DW_TAG_member)
    <70d>   DW_AT_name        : (indirect string, offset: 0xe275c): OSPEEDR
    <711>   DW_AT_decl_file   : 4
    <712>   DW_AT_decl_line   : 578
    <714>   DW_AT_decl_column : 17
    <715>   DW_AT_type        : <0x6cc>
    <719>   DW_AT_data_member_location: 8
 <2><71a>: Abbrev Number: 9 (DW_TAG_member)
    <71b>   DW_AT_name        : (indirect string, offset: 0xe26e6): PUPDR
    <71f>   DW_AT_decl_file   : 4
    <720>   DW_AT_decl_line   : 579
    <722>   DW_AT_decl_column : 17
    <723>   DW_AT_type        : <0x6cc>
    <727>   DW_AT_data_member_location: 12
 <2><728>: Abbrev Number: 10 (DW_TAG_member)
    <729>   DW_AT_name        : IDR
    <72d>   DW_AT_decl_file   : 4
    <72e>   DW_AT_decl_line   : 580
    <730>   DW_AT_decl_column : 17
    <731>   DW_AT_type        : <0x6cc>
    <735>   DW_AT_data_member_location: 16
 <2><736>: Abbrev Number: 10 (DW_TAG_member)
    <737>   DW_AT_name        : ODR
    <73b>   DW_AT_decl_file   : 4
    <73c>   DW_AT_decl_line   : 581
    <73e>   DW_AT_decl_column : 17
    <73f>   DW_AT_type        : <0x6cc>
    <743>   DW_AT_data_member_location: 20
 <2><744>: Abbrev Number: 9 (DW_TAG_member)
    <745>   DW_AT_name        : (indirect string, offset: 0xe268c): BSRR
    <749>   DW_AT_decl_file   : 4
    <74a>   DW_AT_decl_line   : 582
    <74c>   DW_AT_decl_column : 17
    <74d>   DW_AT_type        : <0x6cc>
    <751>   DW_AT_data_member_location: 24
 <2><752>: Abbrev Number: 9 (DW_TAG_member)
    <753>   DW_AT_name        : (indirect string, offset: 0xe2757): LCKR
    <757>   DW_AT_decl_file   : 4
    <758>   DW_AT_decl_line   : 583
    <75a>   DW_AT_decl_column : 17
    <75b>   DW_AT_type        : <0x6cc>
    <75f>   DW_AT_data_member_location: 28
 <2><760>: Abbrev Number: 10 (DW_TAG_member)
    <761>   DW_AT_name        : AFR
    <765>   DW_AT_decl_file   : 4
    <766>   DW_AT_decl_line   : 584
    <768>   DW_AT_decl_column : 17
    <769>   DW_AT_type        : <0x6e1>
    <76d>   DW_AT_data_member_location: 32
 <2><76e>: Abbrev Number: 0
 <1><76f>: Abbrev Number: 11 (DW_TAG_typedef)
    <770>   DW_AT_name        : (indirect string, offset: 0xe2798): GPIO_TypeDef
    <774>   DW_AT_decl_file   : 4
    <775>   DW_AT_decl_line   : 585
    <777>   DW_AT_decl_column : 3
    <778>   DW_AT_type        : <0x6e6>
 <1><77c>: Abbrev Number: 2 (DW_TAG_base_type)
    <77d>   DW_AT_byte_size   : 8
    <77e>   DW_AT_encoding    : 4	(float)
    <77f>   DW_AT_name        : (indirect string, offset: 0xe22cb): long double
 <1><783>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <784>   DW_AT_encoding    : 7	(unsigned)
    <785>   DW_AT_byte_size   : 1
    <786>   DW_AT_type        : <0x65d>
    <78a>   DW_AT_decl_file   : 5
    <78b>   DW_AT_decl_line   : 68
    <78c>   DW_AT_decl_column : 1
    <78d>   DW_AT_sibling     : <0x79e>
 <2><791>: Abbrev Number: 13 (DW_TAG_enumerator)
    <792>   DW_AT_name        : (indirect string, offset: 0xe267d): GPIO_PIN_RESET
    <796>   DW_AT_const_value : 0
 <2><797>: Abbrev Number: 13 (DW_TAG_enumerator)
    <798>   DW_AT_name        : (indirect string, offset: 0xe2691): GPIO_PIN_SET
    <79c>   DW_AT_const_value : 1
 <2><79d>: Abbrev Number: 0
 <1><79e>: Abbrev Number: 3 (DW_TAG_typedef)
    <79f>   DW_AT_name        : (indirect string, offset: 0xe27a5): GPIO_PinState
    <7a3>   DW_AT_decl_file   : 5
    <7a4>   DW_AT_decl_line   : 71
    <7a5>   DW_AT_decl_column : 2
    <7a6>   DW_AT_type        : <0x783>
 <1><7aa>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <7ab>   DW_AT_byte_size   : 4
 <1><7ac>: Abbrev Number: 15 (DW_TAG_const_type)
    <7ad>   DW_AT_type        : <0x7aa>
 <1><7b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <7b2>   DW_AT_name        : (indirect string, offset: 0x1748): BaseType_t
    <7b6>   DW_AT_decl_file   : 6
    <7b7>   DW_AT_decl_line   : 56
    <7b8>   DW_AT_decl_column : 14
    <7b9>   DW_AT_type        : <0x67e>
 <1><7bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <7be>   DW_AT_name        : (indirect string, offset: 0x173ec): TickType_t
    <7c2>   DW_AT_decl_file   : 6
    <7c3>   DW_AT_decl_line   : 63
    <7c4>   DW_AT_decl_column : 19
    <7c5>   DW_AT_type        : <0x6c0>
 <1><7c9>: Abbrev Number: 15 (DW_TAG_const_type)
    <7ca>   DW_AT_type        : <0x7bd>
 <1><7ce>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <7cf>   DW_AT_byte_size   : 4
    <7d0>   DW_AT_type        : <0x7d4>
 <1><7d4>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d5>   DW_AT_byte_size   : 1
    <7d6>   DW_AT_encoding    : 8	(unsigned char)
    <7d7>   DW_AT_name        : (indirect string, offset: 0x11d73): char
 <1><7db>: Abbrev Number: 15 (DW_TAG_const_type)
    <7dc>   DW_AT_type        : <0x7d4>
 <1><7e0>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <7e1>   DW_AT_byte_size   : 4
    <7e2>   DW_AT_type        : <0x7db>
 <1><7e6>: Abbrev Number: 3 (DW_TAG_typedef)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x5b9c2): TaskHandle_t
    <7eb>   DW_AT_decl_file   : 7
    <7ec>   DW_AT_decl_line   : 70
    <7ed>   DW_AT_decl_column : 37
    <7ee>   DW_AT_type        : <0x7f2>
 <1><7f2>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <7f3>   DW_AT_byte_size   : 4
    <7f4>   DW_AT_type        : <0x7f8>
 <1><7f8>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7f9>   DW_AT_name        : (indirect string, offset: 0xbf808): tskTaskControlBlock
    <7fd>   DW_AT_declaration : 1
 <1><7fd>: Abbrev Number: 3 (DW_TAG_typedef)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x50c6e): QueueHandle_t
    <802>   DW_AT_decl_file   : 8
    <803>   DW_AT_decl_line   : 48
    <804>   DW_AT_decl_column : 34
    <805>   DW_AT_type        : <0x809>
 <1><809>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <80a>   DW_AT_byte_size   : 4
    <80b>   DW_AT_type        : <0x80f>
 <1><80f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <810>   DW_AT_name        : (indirect string, offset: 0x957c1): QueueDefinition
    <814>   DW_AT_declaration : 1
 <1><814>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <815>   DW_AT_name        : (indirect string, offset: 0xe2615): ledFlag_e
    <819>   DW_AT_encoding    : 7	(unsigned)
    <81a>   DW_AT_byte_size   : 1
    <81b>   DW_AT_type        : <0x65d>
    <81f>   DW_AT_decl_file   : 9
    <820>   DW_AT_decl_line   : 59
    <821>   DW_AT_decl_column : 14
    <822>   DW_AT_sibling     : <0x833>
 <2><826>: Abbrev Number: 13 (DW_TAG_enumerator)
    <827>   DW_AT_name        : (indirect string, offset: 0xe2700): Blinking
    <82b>   DW_AT_const_value : 0
 <2><82c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <82d>   DW_AT_name        : (indirect string, offset: 0xe26fd): NotBlinking
    <831>   DW_AT_const_value : 1
 <2><832>: Abbrev Number: 0
 <1><833>: Abbrev Number: 3 (DW_TAG_typedef)
    <834>   DW_AT_name        : (indirect string, offset: 0xe2646): ledFlag_t
    <838>   DW_AT_decl_file   : 9
    <839>   DW_AT_decl_line   : 59
    <83a>   DW_AT_decl_column : 49
    <83b>   DW_AT_type        : <0x814>
 <1><83f>: Abbrev Number: 19 (DW_TAG_structure_type)
    <840>   DW_AT_byte_size   : 12
    <841>   DW_AT_decl_file   : 9
    <842>   DW_AT_decl_line   : 61
    <843>   DW_AT_decl_column : 9
    <844>   DW_AT_sibling     : <0x88a>
 <2><848>: Abbrev Number: 20 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0xe26b1): LDX_GPIO_Port
    <84d>   DW_AT_decl_file   : 9
    <84e>   DW_AT_decl_line   : 63
    <84f>   DW_AT_decl_column : 16
    <850>   DW_AT_type        : <0x88a>
    <854>   DW_AT_data_member_location: 0
 <2><855>: Abbrev Number: 20 (DW_TAG_member)
    <856>   DW_AT_name        : (indirect string, offset: 0xe269e): LDX_Pin
    <85a>   DW_AT_decl_file   : 9
    <85b>   DW_AT_decl_line   : 64
    <85c>   DW_AT_decl_column : 12
    <85d>   DW_AT_type        : <0x6b4>
    <861>   DW_AT_data_member_location: 4
 <2><862>: Abbrev Number: 20 (DW_TAG_member)
    <863>   DW_AT_name        : (indirect string, offset: 0xe2650): ledState
    <867>   DW_AT_decl_file   : 9
    <868>   DW_AT_decl_line   : 65
    <869>   DW_AT_decl_column : 16
    <86a>   DW_AT_type        : <0x79e>
    <86e>   DW_AT_data_member_location: 6
 <2><86f>: Abbrev Number: 20 (DW_TAG_member)
    <870>   DW_AT_name        : (indirect string, offset: 0xe2764): ledFlag
    <874>   DW_AT_decl_file   : 9
    <875>   DW_AT_decl_line   : 66
    <876>   DW_AT_decl_column : 13
    <877>   DW_AT_type        : <0x833>
    <87b>   DW_AT_data_member_location: 7
 <2><87c>: Abbrev Number: 20 (DW_TAG_member)
    <87d>   DW_AT_name        : (indirect string, offset: 0xe26bf): ledTickCnt
    <881>   DW_AT_decl_file   : 9
    <882>   DW_AT_decl_line   : 67
    <883>   DW_AT_decl_column : 15
    <884>   DW_AT_type        : <0x7bd>
    <888>   DW_AT_data_member_location: 8
 <2><889>: Abbrev Number: 0
 <1><88a>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <88b>   DW_AT_byte_size   : 4
    <88c>   DW_AT_type        : <0x76f>
 <1><890>: Abbrev Number: 3 (DW_TAG_typedef)
    <891>   DW_AT_name        : (indirect string, offset: 0xe2722): LDX_Config_t
    <895>   DW_AT_decl_file   : 9
    <896>   DW_AT_decl_line   : 68
    <897>   DW_AT_decl_column : 3
    <898>   DW_AT_type        : <0x83f>
 <1><89c>: Abbrev Number: 6 (DW_TAG_array_type)
    <89d>   DW_AT_type        : <0x890>
    <8a1>   DW_AT_sibling     : <0x8a7>
 <2><8a5>: Abbrev Number: 21 (DW_TAG_subrange_type)
 <2><8a6>: Abbrev Number: 0
 <1><8a7>: Abbrev Number: 22 (DW_TAG_variable)
    <8a8>   DW_AT_name        : (indirect string, offset: 0xe2604): LDX_Config
    <8ac>   DW_AT_decl_file   : 9
    <8ad>   DW_AT_decl_line   : 70
    <8ae>   DW_AT_decl_column : 21
    <8af>   DW_AT_type        : <0x89c>
    <8b3>   DW_AT_external    : 1
    <8b3>   DW_AT_declaration : 1
 <1><8b3>: Abbrev Number: 23 (DW_TAG_variable)
    <8b4>   DW_AT_name        : (indirect string, offset: 0xe27fc): pcTextForTask_LDXTOn
    <8b8>   DW_AT_decl_file   : 1
    <8b9>   DW_AT_decl_line   : 78
    <8ba>   DW_AT_decl_column : 13
    <8bb>   DW_AT_type        : <0x7e0>
    <8bf>   DW_AT_external    : 1
    <8bf>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <1><8c5>: Abbrev Number: 23 (DW_TAG_variable)
    <8c6>   DW_AT_name        : (indirect string, offset: 0xe2845): pcTextForTask_LDXTOff
    <8ca>   DW_AT_decl_file   : 1
    <8cb>   DW_AT_decl_line   : 79
    <8cc>   DW_AT_decl_column : 13
    <8cd>   DW_AT_type        : <0x7e0>
    <8d1>   DW_AT_external    : 1
    <8d1>   DW_AT_location    : 5 byte block: 3 10 0 0 20 	(DW_OP_addr: 20000010)
 <1><8d7>: Abbrev Number: 6 (DW_TAG_array_type)
    <8d8>   DW_AT_type        : <0x890>
    <8dc>   DW_AT_sibling     : <0x8e7>
 <2><8e0>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <8e1>   DW_AT_type        : <0x6ad>
    <8e5>   DW_AT_upper_bound : 2
 <2><8e6>: Abbrev Number: 0
 <1><8e7>: Abbrev Number: 24 (DW_TAG_variable)
    <8e8>   DW_AT_specification: <0x8a7>
    <8ec>   DW_AT_decl_file   : 1
    <8ed>   DW_AT_decl_line   : 83
    <8ee>   DW_AT_decl_column : 14
    <8ef>   DW_AT_type        : <0x8d7>
    <8f3>   DW_AT_location    : 5 byte block: 3 14 0 0 20 	(DW_OP_addr: 20000014)
 <1><8f9>: Abbrev Number: 25 (DW_TAG_subprogram)
    <8fa>   DW_AT_external    : 1
    <8fa>   DW_AT_name        : (indirect string, offset: 0xe2835): vTaskDelayUntil
    <8fe>   DW_AT_decl_file   : 7
    <8ff>   DW_AT_decl_line   : 817
    <901>   DW_AT_decl_column : 6
    <902>   DW_AT_prototyped  : 1
    <902>   DW_AT_declaration : 1
    <902>   DW_AT_sibling     : <0x911>
 <2><906>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <907>   DW_AT_type        : <0x917>
 <2><90b>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <90c>   DW_AT_type        : <0x7c9>
 <2><910>: Abbrev Number: 0
 <1><911>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <912>   DW_AT_byte_size   : 4
    <913>   DW_AT_type        : <0x7bd>
 <1><917>: Abbrev Number: 15 (DW_TAG_const_type)
    <918>   DW_AT_type        : <0x911>
 <1><91c>: Abbrev Number: 27 (DW_TAG_subprogram)
    <91d>   DW_AT_external    : 1
    <91d>   DW_AT_name        : (indirect string, offset: 0xe27ea): HAL_GPIO_WritePin
    <921>   DW_AT_decl_file   : 5
    <922>   DW_AT_decl_line   : 235
    <923>   DW_AT_decl_column : 6
    <924>   DW_AT_prototyped  : 1
    <924>   DW_AT_declaration : 1
    <924>   DW_AT_sibling     : <0x938>
 <2><928>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <929>   DW_AT_type        : <0x88a>
 <2><92d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <92e>   DW_AT_type        : <0x6b4>
 <2><932>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <933>   DW_AT_type        : <0x79e>
 <2><937>: Abbrev Number: 0
 <1><938>: Abbrev Number: 28 (DW_TAG_subprogram)
    <939>   DW_AT_external    : 1
    <939>   DW_AT_name        : (indirect string, offset: 0xe285b): xQueueReceive
    <93d>   DW_AT_decl_file   : 8
    <93e>   DW_AT_decl_line   : 868
    <940>   DW_AT_decl_column : 12
    <941>   DW_AT_prototyped  : 1
    <941>   DW_AT_type        : <0x7b1>
    <945>   DW_AT_declaration : 1
    <945>   DW_AT_sibling     : <0x959>
 <2><949>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <94a>   DW_AT_type        : <0x7fd>
 <2><94e>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <94f>   DW_AT_type        : <0x7ac>
 <2><953>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <954>   DW_AT_type        : <0x7bd>
 <2><958>: Abbrev Number: 0
 <1><959>: Abbrev Number: 27 (DW_TAG_subprogram)
    <95a>   DW_AT_external    : 1
    <95a>   DW_AT_name        : (indirect string, offset: 0xe26ca): vPrintTwoStrings
    <95e>   DW_AT_decl_file   : 10
    <95f>   DW_AT_decl_line   : 76
    <960>   DW_AT_decl_column : 6
    <961>   DW_AT_prototyped  : 1
    <961>   DW_AT_declaration : 1
    <961>   DW_AT_sibling     : <0x970>
 <2><965>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <966>   DW_AT_type        : <0x7e0>
 <2><96a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <96b>   DW_AT_type        : <0x7e0>
 <2><96f>: Abbrev Number: 0
 <1><970>: Abbrev Number: 28 (DW_TAG_subprogram)
    <971>   DW_AT_external    : 1
    <971>   DW_AT_name        : (indirect string, offset: 0x532d7): pcTaskGetName
    <975>   DW_AT_decl_file   : 7
    <976>   DW_AT_decl_line   : 1399
    <978>   DW_AT_decl_column : 7
    <979>   DW_AT_prototyped  : 1
    <979>   DW_AT_type        : <0x7ce>
    <97d>   DW_AT_declaration : 1
    <97d>   DW_AT_sibling     : <0x987>
 <2><981>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <982>   DW_AT_type        : <0x7e6>
 <2><986>: Abbrev Number: 0
 <1><987>: Abbrev Number: 29 (DW_TAG_subprogram)
    <988>   DW_AT_external    : 1
    <988>   DW_AT_name        : (indirect string, offset: 0xe27b3): xTaskGetTickCount
    <98c>   DW_AT_decl_file   : 7
    <98d>   DW_AT_decl_line   : 1356
    <98f>   DW_AT_decl_column : 12
    <990>   DW_AT_prototyped  : 1
    <990>   DW_AT_type        : <0x7bd>
    <994>   DW_AT_declaration : 1
 <1><994>: Abbrev Number: 30 (DW_TAG_subprogram)
    <995>   DW_AT_external    : 1
    <995>   DW_AT_name        : (indirect string, offset: 0xbf390): vTaskLed
    <999>   DW_AT_decl_file   : 1
    <99a>   DW_AT_decl_line   : 97
    <99b>   DW_AT_decl_column : 6
    <99c>   DW_AT_prototyped  : 1
    <99c>   DW_AT_low_pc      : 0x80006d0
    <9a0>   DW_AT_high_pc     : 0x88
    <9a4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9a6>   DW_AT_GNU_all_tail_call_sites: 1
 <2><9a6>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <9a7>   DW_AT_name        : (indirect string, offset: 0xe261f): pvParameters
    <9ab>   DW_AT_decl_file   : 1
    <9ac>   DW_AT_decl_line   : 97
    <9ad>   DW_AT_decl_column : 22
    <9ae>   DW_AT_type        : <0x7aa>
    <9b2>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><9b5>: Abbrev Number: 32 (DW_TAG_variable)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x93b4b): QueueLEDHandle
    <9ba>   DW_AT_decl_file   : 1
    <9bb>   DW_AT_decl_line   : 100
    <9bc>   DW_AT_decl_column : 17
    <9bd>   DW_AT_type        : <0x7fd>
    <9c1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9c4>: Abbrev Number: 32 (DW_TAG_variable)
    <9c5>   DW_AT_name        : (indirect string, offset: 0xe2659): LED_config
    <9c9>   DW_AT_decl_file   : 1
    <9ca>   DW_AT_decl_line   : 101
    <9cb>   DW_AT_decl_column : 15
    <9cc>   DW_AT_type        : <0x890>
    <9d0>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><9d3>: Abbrev Number: 32 (DW_TAG_variable)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xe2827): xLastWakeTime
    <9d8>   DW_AT_decl_file   : 1
    <9d9>   DW_AT_decl_line   : 103
    <9da>   DW_AT_decl_column : 13
    <9db>   DW_AT_type        : <0x7bd>
    <9df>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><9e2>: Abbrev Number: 32 (DW_TAG_variable)
    <9e3>   DW_AT_name        : (indirect string, offset: 0xe26a6): pcTaskName
    <9e7>   DW_AT_decl_file   : 1
    <9e8>   DW_AT_decl_line   : 110
    <9e9>   DW_AT_decl_column : 8
    <9ea>   DW_AT_type        : <0x7ce>
    <9ee>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><9f1>: Abbrev Number: 0
 <1><9f2>: Abbrev Number: 0
  Compilation Unit @ offset 0x9f3:
   Length:        0x2150 (32-bit)
   Version:       4
   Abbrev Offset: 0x4d3
   Pointer Size:  4
 <0><9fe>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <9ff>   DW_AT_producer    : (indirect string, offset: 0xb9e05): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <a03>   DW_AT_language    : 12	(ANSI C99)
    <a04>   DW_AT_name        : (indirect string, offset: 0xe3af5): ../Core/Src/main.c
    <a08>   DW_AT_comp_dir    : (indirect string, offset: 0x228d1): C:/Users/ipave/Documentos/GitHub/RTOSI/freertos_app_Example4_6/Debug
    <a0c>   DW_AT_ranges      : 0x30
    <a10>   DW_AT_low_pc      : 0x0
    <a14>   DW_AT_stmt_list   : 0x23d7
    <a18>   DW_AT_GNU_macros  : 0x249e5
 <1><a1c>: Abbrev Number: 2 (DW_TAG_base_type)
    <a1d>   DW_AT_byte_size   : 1
    <a1e>   DW_AT_encoding    : 6	(signed char)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x70e0f): signed char
 <1><a23>: Abbrev Number: 3 (DW_TAG_typedef)
    <a24>   DW_AT_name        : (indirect string, offset: 0x419d7): __uint8_t
    <a28>   DW_AT_decl_file   : 3
    <a29>   DW_AT_decl_line   : 43
    <a2a>   DW_AT_decl_column : 24
    <a2b>   DW_AT_type        : <0xa2f>
 <1><a2f>: Abbrev Number: 2 (DW_TAG_base_type)
    <a30>   DW_AT_byte_size   : 1
    <a31>   DW_AT_encoding    : 8	(unsigned char)
    <a32>   DW_AT_name        : (indirect string, offset: 0xd9b5e): unsigned char
 <1><a36>: Abbrev Number: 2 (DW_TAG_base_type)
    <a37>   DW_AT_byte_size   : 2
    <a38>   DW_AT_encoding    : 5	(signed)
    <a39>   DW_AT_name        : (indirect string, offset: 0xa805f): short int
 <1><a3d>: Abbrev Number: 3 (DW_TAG_typedef)
    <a3e>   DW_AT_name        : (indirect string, offset: 0xb7d11): __uint16_t
    <a42>   DW_AT_decl_file   : 3
    <a43>   DW_AT_decl_line   : 57
    <a44>   DW_AT_decl_column : 25
    <a45>   DW_AT_type        : <0xa49>
 <1><a49>: Abbrev Number: 2 (DW_TAG_base_type)
    <a4a>   DW_AT_byte_size   : 2
    <a4b>   DW_AT_encoding    : 7	(unsigned)
    <a4c>   DW_AT_name        : (indirect string, offset: 0xd8304): short unsigned int
 <1><a50>: Abbrev Number: 2 (DW_TAG_base_type)
    <a51>   DW_AT_byte_size   : 4
    <a52>   DW_AT_encoding    : 5	(signed)
    <a53>   DW_AT_name        : (indirect string, offset: 0x1333c): long int
 <1><a57>: Abbrev Number: 3 (DW_TAG_typedef)
    <a58>   DW_AT_name        : (indirect string, offset: 0x8fcd5): __uint32_t
    <a5c>   DW_AT_decl_file   : 3
    <a5d>   DW_AT_decl_line   : 79
    <a5e>   DW_AT_decl_column : 25
    <a5f>   DW_AT_type        : <0xa63>
 <1><a63>: Abbrev Number: 2 (DW_TAG_base_type)
    <a64>   DW_AT_byte_size   : 4
    <a65>   DW_AT_encoding    : 7	(unsigned)
    <a66>   DW_AT_name        : (indirect string, offset: 0x56492): long unsigned int
 <1><a6a>: Abbrev Number: 2 (DW_TAG_base_type)
    <a6b>   DW_AT_byte_size   : 8
    <a6c>   DW_AT_encoding    : 5	(signed)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x66bf8): long long int
 <1><a71>: Abbrev Number: 2 (DW_TAG_base_type)
    <a72>   DW_AT_byte_size   : 8
    <a73>   DW_AT_encoding    : 7	(unsigned)
    <a74>   DW_AT_name        : (indirect string, offset: 0x2f437): long long unsigned int
 <1><a78>: Abbrev Number: 4 (DW_TAG_base_type)
    <a79>   DW_AT_byte_size   : 4
    <a7a>   DW_AT_encoding    : 5	(signed)
    <a7b>   DW_AT_name        : int
 <1><a7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <a80>   DW_AT_byte_size   : 4
    <a81>   DW_AT_encoding    : 7	(unsigned)
    <a82>   DW_AT_name        : (indirect string, offset: 0x127ef): unsigned int
 <1><a86>: Abbrev Number: 3 (DW_TAG_typedef)
    <a87>   DW_AT_name        : (indirect string, offset: 0x419d9): uint8_t
    <a8b>   DW_AT_decl_file   : 4
    <a8c>   DW_AT_decl_line   : 24
    <a8d>   DW_AT_decl_column : 19
    <a8e>   DW_AT_type        : <0xa23>
 <1><a92>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a93>   DW_AT_type        : <0xa86>
 <1><a97>: Abbrev Number: 6 (DW_TAG_const_type)
    <a98>   DW_AT_type        : <0xa86>
 <1><a9c>: Abbrev Number: 3 (DW_TAG_typedef)
    <a9d>   DW_AT_name        : (indirect string, offset: 0xa47b8): uint16_t
    <aa1>   DW_AT_decl_file   : 4
    <aa2>   DW_AT_decl_line   : 36
    <aa3>   DW_AT_decl_column : 20
    <aa4>   DW_AT_type        : <0xa3d>
 <1><aa8>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <aa9>   DW_AT_type        : <0xa9c>
 <1><aad>: Abbrev Number: 3 (DW_TAG_typedef)
    <aae>   DW_AT_name        : (indirect string, offset: 0xd7e50): uint32_t
    <ab2>   DW_AT_decl_file   : 4
    <ab3>   DW_AT_decl_line   : 48
    <ab4>   DW_AT_decl_column : 20
    <ab5>   DW_AT_type        : <0xa57>
 <1><ab9>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <aba>   DW_AT_type        : <0xaad>
 <1><abe>: Abbrev Number: 7 (DW_TAG_array_type)
    <abf>   DW_AT_type        : <0xaad>
    <ac3>   DW_AT_sibling     : <0xace>
 <2><ac7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <ac8>   DW_AT_type        : <0xa7f>
    <acc>   DW_AT_upper_bound : 4
 <2><acd>: Abbrev Number: 0
 <1><ace>: Abbrev Number: 7 (DW_TAG_array_type)
    <acf>   DW_AT_type        : <0xaad>
    <ad3>   DW_AT_sibling     : <0xade>
 <2><ad7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <ad8>   DW_AT_type        : <0xa7f>
    <adc>   DW_AT_upper_bound : 1
 <2><add>: Abbrev Number: 0
 <1><ade>: Abbrev Number: 7 (DW_TAG_array_type)
    <adf>   DW_AT_type        : <0xaad>
    <ae3>   DW_AT_sibling     : <0xaee>
 <2><ae7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <ae8>   DW_AT_type        : <0xa7f>
    <aec>   DW_AT_upper_bound : 7
 <2><aed>: Abbrev Number: 0
 <1><aee>: Abbrev Number: 7 (DW_TAG_array_type)
    <aef>   DW_AT_type        : <0xaad>
    <af3>   DW_AT_sibling     : <0xafe>
 <2><af7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <af8>   DW_AT_type        : <0xa7f>
    <afc>   DW_AT_upper_bound : 11
 <2><afd>: Abbrev Number: 0
 <1><afe>: Abbrev Number: 9 (DW_TAG_structure_type)
    <aff>   DW_AT_byte_size   : 24
    <b00>   DW_AT_decl_file   : 5
    <b01>   DW_AT_decl_line   : 352
    <b03>   DW_AT_decl_column : 9
    <b04>   DW_AT_sibling     : <0xb5c>
 <2><b08>: Abbrev Number: 10 (DW_TAG_member)
    <b09>   DW_AT_name        : CR
    <b0c>   DW_AT_decl_file   : 5
    <b0d>   DW_AT_decl_line   : 354
    <b0f>   DW_AT_decl_column : 17
    <b10>   DW_AT_type        : <0xab9>
    <b14>   DW_AT_data_member_location: 0
 <2><b15>: Abbrev Number: 11 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0xe303a): NDTR
    <b1a>   DW_AT_decl_file   : 5
    <b1b>   DW_AT_decl_line   : 355
    <b1d>   DW_AT_decl_column : 17
    <b1e>   DW_AT_type        : <0xab9>
    <b22>   DW_AT_data_member_location: 4
 <2><b23>: Abbrev Number: 10 (DW_TAG_member)
    <b24>   DW_AT_name        : PAR
    <b28>   DW_AT_decl_file   : 5
    <b29>   DW_AT_decl_line   : 356
    <b2b>   DW_AT_decl_column : 17
    <b2c>   DW_AT_type        : <0xab9>
    <b30>   DW_AT_data_member_location: 8
 <2><b31>: Abbrev Number: 11 (DW_TAG_member)
    <b32>   DW_AT_name        : (indirect string, offset: 0xe30dd): M0AR
    <b36>   DW_AT_decl_file   : 5
    <b37>   DW_AT_decl_line   : 357
    <b39>   DW_AT_decl_column : 17
    <b3a>   DW_AT_type        : <0xab9>
    <b3e>   DW_AT_data_member_location: 12
 <2><b3f>: Abbrev Number: 11 (DW_TAG_member)
    <b40>   DW_AT_name        : (indirect string, offset: 0xe339c): M1AR
    <b44>   DW_AT_decl_file   : 5
    <b45>   DW_AT_decl_line   : 358
    <b47>   DW_AT_decl_column : 17
    <b48>   DW_AT_type        : <0xab9>
    <b4c>   DW_AT_data_member_location: 16
 <2><b4d>: Abbrev Number: 10 (DW_TAG_member)
    <b4e>   DW_AT_name        : FCR
    <b52>   DW_AT_decl_file   : 5
    <b53>   DW_AT_decl_line   : 359
    <b55>   DW_AT_decl_column : 17
    <b56>   DW_AT_type        : <0xab9>
    <b5a>   DW_AT_data_member_location: 20
 <2><b5b>: Abbrev Number: 0
 <1><b5c>: Abbrev Number: 12 (DW_TAG_typedef)
    <b5d>   DW_AT_name        : (indirect string, offset: 0xe2a91): DMA_Stream_TypeDef
    <b61>   DW_AT_decl_file   : 5
    <b62>   DW_AT_decl_line   : 360
    <b64>   DW_AT_decl_column : 3
    <b65>   DW_AT_type        : <0xafe>
 <1><b69>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b6a>   DW_AT_byte_size   : 4184
    <b6c>   DW_AT_decl_file   : 5
    <b6d>   DW_AT_decl_line   : 405
    <b6f>   DW_AT_decl_column : 9
    <b70>   DW_AT_sibling     : <0xf4a>
 <2><b74>: Abbrev Number: 11 (DW_TAG_member)
    <b75>   DW_AT_name        : (indirect string, offset: 0xe2e18): MACCR
    <b79>   DW_AT_decl_file   : 5
    <b7a>   DW_AT_decl_line   : 407
    <b7c>   DW_AT_decl_column : 17
    <b7d>   DW_AT_type        : <0xab9>
    <b81>   DW_AT_data_member_location: 0
 <2><b82>: Abbrev Number: 11 (DW_TAG_member)
    <b83>   DW_AT_name        : (indirect string, offset: 0xe3202): MACFFR
    <b87>   DW_AT_decl_file   : 5
    <b88>   DW_AT_decl_line   : 408
    <b8a>   DW_AT_decl_column : 17
    <b8b>   DW_AT_type        : <0xab9>
    <b8f>   DW_AT_data_member_location: 4
 <2><b90>: Abbrev Number: 11 (DW_TAG_member)
    <b91>   DW_AT_name        : (indirect string, offset: 0xe34cb): MACHTHR
    <b95>   DW_AT_decl_file   : 5
    <b96>   DW_AT_decl_line   : 409
    <b98>   DW_AT_decl_column : 17
    <b99>   DW_AT_type        : <0xab9>
    <b9d>   DW_AT_data_member_location: 8
 <2><b9e>: Abbrev Number: 11 (DW_TAG_member)
    <b9f>   DW_AT_name        : (indirect string, offset: 0xe3524): MACHTLR
    <ba3>   DW_AT_decl_file   : 5
    <ba4>   DW_AT_decl_line   : 410
    <ba6>   DW_AT_decl_column : 17
    <ba7>   DW_AT_type        : <0xab9>
    <bab>   DW_AT_data_member_location: 12
 <2><bac>: Abbrev Number: 11 (DW_TAG_member)
    <bad>   DW_AT_name        : (indirect string, offset: 0xe3d00): MACMIIAR
    <bb1>   DW_AT_decl_file   : 5
    <bb2>   DW_AT_decl_line   : 411
    <bb4>   DW_AT_decl_column : 17
    <bb5>   DW_AT_type        : <0xab9>
    <bb9>   DW_AT_data_member_location: 16
 <2><bba>: Abbrev Number: 11 (DW_TAG_member)
    <bbb>   DW_AT_name        : (indirect string, offset: 0xe3d19): MACMIIDR
    <bbf>   DW_AT_decl_file   : 5
    <bc0>   DW_AT_decl_line   : 412
    <bc2>   DW_AT_decl_column : 17
    <bc3>   DW_AT_type        : <0xab9>
    <bc7>   DW_AT_data_member_location: 20
 <2><bc8>: Abbrev Number: 11 (DW_TAG_member)
    <bc9>   DW_AT_name        : (indirect string, offset: 0xe3081): MACFCR
    <bcd>   DW_AT_decl_file   : 5
    <bce>   DW_AT_decl_line   : 413
    <bd0>   DW_AT_decl_column : 17
    <bd1>   DW_AT_type        : <0xab9>
    <bd5>   DW_AT_data_member_location: 24
 <2><bd6>: Abbrev Number: 11 (DW_TAG_member)
    <bd7>   DW_AT_name        : (indirect string, offset: 0xe3050): MACVLANTR
    <bdb>   DW_AT_decl_file   : 5
    <bdc>   DW_AT_decl_line   : 414
    <bde>   DW_AT_decl_column : 17
    <bdf>   DW_AT_type        : <0xab9>
    <be3>   DW_AT_data_member_location: 28
 <2><be4>: Abbrev Number: 11 (DW_TAG_member)
    <be5>   DW_AT_name        : (indirect string, offset: 0xe3c72): RESERVED0
    <be9>   DW_AT_decl_file   : 5
    <bea>   DW_AT_decl_line   : 415
    <bec>   DW_AT_decl_column : 17
    <bed>   DW_AT_type        : <0xace>
    <bf1>   DW_AT_data_member_location: 32
 <2><bf2>: Abbrev Number: 11 (DW_TAG_member)
    <bf3>   DW_AT_name        : (indirect string, offset: 0xe3726): MACRWUFFR
    <bf7>   DW_AT_decl_file   : 5
    <bf8>   DW_AT_decl_line   : 416
    <bfa>   DW_AT_decl_column : 17
    <bfb>   DW_AT_type        : <0xab9>
    <bff>   DW_AT_data_member_location: 40
 <2><c00>: Abbrev Number: 11 (DW_TAG_member)
    <c01>   DW_AT_name        : (indirect string, offset: 0xe299e): MACPMTCSR
    <c05>   DW_AT_decl_file   : 5
    <c06>   DW_AT_decl_line   : 417
    <c08>   DW_AT_decl_column : 17
    <c09>   DW_AT_type        : <0xab9>
    <c0d>   DW_AT_data_member_location: 44
 <2><c0e>: Abbrev Number: 11 (DW_TAG_member)
    <c0f>   DW_AT_name        : (indirect string, offset: 0xe3c7c): RESERVED1
    <c13>   DW_AT_decl_file   : 5
    <c14>   DW_AT_decl_line   : 418
    <c16>   DW_AT_decl_column : 17
    <c17>   DW_AT_type        : <0xaad>
    <c1b>   DW_AT_data_member_location: 48
 <2><c1c>: Abbrev Number: 11 (DW_TAG_member)
    <c1d>   DW_AT_name        : (indirect string, offset: 0xe303f): MACDBGR
    <c21>   DW_AT_decl_file   : 5
    <c22>   DW_AT_decl_line   : 419
    <c24>   DW_AT_decl_column : 17
    <c25>   DW_AT_type        : <0xab9>
    <c29>   DW_AT_data_member_location: 52
 <2><c2a>: Abbrev Number: 11 (DW_TAG_member)
    <c2b>   DW_AT_name        : (indirect string, offset: 0xe2ec8): MACSR
    <c2f>   DW_AT_decl_file   : 5
    <c30>   DW_AT_decl_line   : 420
    <c32>   DW_AT_decl_column : 17
    <c33>   DW_AT_type        : <0xab9>
    <c37>   DW_AT_data_member_location: 56
 <2><c38>: Abbrev Number: 11 (DW_TAG_member)
    <c39>   DW_AT_name        : (indirect string, offset: 0xe3a11): MACIMR
    <c3d>   DW_AT_decl_file   : 5
    <c3e>   DW_AT_decl_line   : 421
    <c40>   DW_AT_decl_column : 17
    <c41>   DW_AT_type        : <0xab9>
    <c45>   DW_AT_data_member_location: 60
 <2><c46>: Abbrev Number: 11 (DW_TAG_member)
    <c47>   DW_AT_name        : (indirect string, offset: 0xe2fe1): MACA0HR
    <c4b>   DW_AT_decl_file   : 5
    <c4c>   DW_AT_decl_line   : 422
    <c4e>   DW_AT_decl_column : 17
    <c4f>   DW_AT_type        : <0xab9>
    <c53>   DW_AT_data_member_location: 64
 <2><c54>: Abbrev Number: 11 (DW_TAG_member)
    <c55>   DW_AT_name        : (indirect string, offset: 0xe3032): MACA0LR
    <c59>   DW_AT_decl_file   : 5
    <c5a>   DW_AT_decl_line   : 423
    <c5c>   DW_AT_decl_column : 17
    <c5d>   DW_AT_type        : <0xab9>
    <c61>   DW_AT_data_member_location: 68
 <2><c62>: Abbrev Number: 11 (DW_TAG_member)
    <c63>   DW_AT_name        : (indirect string, offset: 0xe32b3): MACA1HR
    <c67>   DW_AT_decl_file   : 5
    <c68>   DW_AT_decl_line   : 424
    <c6a>   DW_AT_decl_column : 17
    <c6b>   DW_AT_type        : <0xab9>
    <c6f>   DW_AT_data_member_location: 72
 <2><c70>: Abbrev Number: 11 (DW_TAG_member)
    <c71>   DW_AT_name        : (indirect string, offset: 0xe32c0): MACA1LR
    <c75>   DW_AT_decl_file   : 5
    <c76>   DW_AT_decl_line   : 425
    <c78>   DW_AT_decl_column : 17
    <c79>   DW_AT_type        : <0xab9>
    <c7d>   DW_AT_data_member_location: 76
 <2><c7e>: Abbrev Number: 11 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0xe35ed): MACA2HR
    <c83>   DW_AT_decl_file   : 5
    <c84>   DW_AT_decl_line   : 426
    <c86>   DW_AT_decl_column : 17
    <c87>   DW_AT_type        : <0xab9>
    <c8b>   DW_AT_data_member_location: 80
 <2><c8c>: Abbrev Number: 11 (DW_TAG_member)
    <c8d>   DW_AT_name        : (indirect string, offset: 0xe3616): MACA2LR
    <c91>   DW_AT_decl_file   : 5
    <c92>   DW_AT_decl_line   : 427
    <c94>   DW_AT_decl_column : 17
    <c95>   DW_AT_type        : <0xab9>
    <c99>   DW_AT_data_member_location: 84
 <2><c9a>: Abbrev Number: 11 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0xe38ea): MACA3HR
    <c9f>   DW_AT_decl_file   : 5
    <ca0>   DW_AT_decl_line   : 428
    <ca2>   DW_AT_decl_column : 17
    <ca3>   DW_AT_type        : <0xab9>
    <ca7>   DW_AT_data_member_location: 88
 <2><ca8>: Abbrev Number: 11 (DW_TAG_member)
    <ca9>   DW_AT_name        : (indirect string, offset: 0xe3904): MACA3LR
    <cad>   DW_AT_decl_file   : 5
    <cae>   DW_AT_decl_line   : 429
    <cb0>   DW_AT_decl_column : 17
    <cb1>   DW_AT_type        : <0xab9>
    <cb5>   DW_AT_data_member_location: 92
 <2><cb6>: Abbrev Number: 11 (DW_TAG_member)
    <cb7>   DW_AT_name        : (indirect string, offset: 0xe3c86): RESERVED2
    <cbb>   DW_AT_decl_file   : 5
    <cbc>   DW_AT_decl_line   : 430
    <cbe>   DW_AT_decl_column : 17
    <cbf>   DW_AT_type        : <0xf4a>
    <cc3>   DW_AT_data_member_location: 96
 <2><cc4>: Abbrev Number: 14 (DW_TAG_member)
    <cc5>   DW_AT_name        : (indirect string, offset: 0xe32ad): MMCCR
    <cc9>   DW_AT_decl_file   : 5
    <cca>   DW_AT_decl_line   : 431
    <ccc>   DW_AT_decl_column : 17
    <ccd>   DW_AT_type        : <0xab9>
    <cd1>   DW_AT_data_member_location: 256
 <2><cd3>: Abbrev Number: 14 (DW_TAG_member)
    <cd4>   DW_AT_name        : (indirect string, offset: 0xe3b9f): MMCRIR
    <cd8>   DW_AT_decl_file   : 5
    <cd9>   DW_AT_decl_line   : 432
    <cdb>   DW_AT_decl_column : 17
    <cdc>   DW_AT_type        : <0xab9>
    <ce0>   DW_AT_data_member_location: 260
 <2><ce2>: Abbrev Number: 14 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0xe2b8e): MMCTIR
    <ce7>   DW_AT_decl_file   : 5
    <ce8>   DW_AT_decl_line   : 433
    <cea>   DW_AT_decl_column : 17
    <ceb>   DW_AT_type        : <0xab9>
    <cef>   DW_AT_data_member_location: 264
 <2><cf1>: Abbrev Number: 14 (DW_TAG_member)
    <cf2>   DW_AT_name        : (indirect string, offset: 0xe2bba): MMCRIMR
    <cf6>   DW_AT_decl_file   : 5
    <cf7>   DW_AT_decl_line   : 434
    <cf9>   DW_AT_decl_column : 17
    <cfa>   DW_AT_type        : <0xab9>
    <cfe>   DW_AT_data_member_location: 268
 <2><d00>: Abbrev Number: 14 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0xe33a1): MMCTIMR
    <d05>   DW_AT_decl_file   : 5
    <d06>   DW_AT_decl_line   : 435
    <d08>   DW_AT_decl_column : 17
    <d09>   DW_AT_type        : <0xab9>
    <d0d>   DW_AT_data_member_location: 272
 <2><d0f>: Abbrev Number: 14 (DW_TAG_member)
    <d10>   DW_AT_name        : (indirect string, offset: 0xe3c90): RESERVED3
    <d14>   DW_AT_decl_file   : 5
    <d15>   DW_AT_decl_line   : 436
    <d17>   DW_AT_decl_column : 17
    <d18>   DW_AT_type        : <0xf5a>
    <d1c>   DW_AT_data_member_location: 276
 <2><d1e>: Abbrev Number: 14 (DW_TAG_member)
    <d1f>   DW_AT_name        : (indirect string, offset: 0xe3345): MMCTGFSCCR
    <d23>   DW_AT_decl_file   : 5
    <d24>   DW_AT_decl_line   : 437
    <d26>   DW_AT_decl_column : 17
    <d27>   DW_AT_type        : <0xab9>
    <d2b>   DW_AT_data_member_location: 332
 <2><d2d>: Abbrev Number: 14 (DW_TAG_member)
    <d2e>   DW_AT_name        : (indirect string, offset: 0xe356d): MMCTGFMSCCR
    <d32>   DW_AT_decl_file   : 5
    <d33>   DW_AT_decl_line   : 438
    <d35>   DW_AT_decl_column : 17
    <d36>   DW_AT_type        : <0xab9>
    <d3a>   DW_AT_data_member_location: 336
 <2><d3c>: Abbrev Number: 14 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0xe3c9a): RESERVED4
    <d41>   DW_AT_decl_file   : 5
    <d42>   DW_AT_decl_line   : 439
    <d44>   DW_AT_decl_column : 17
    <d45>   DW_AT_type        : <0xabe>
    <d49>   DW_AT_data_member_location: 340
 <2><d4b>: Abbrev Number: 14 (DW_TAG_member)
    <d4c>   DW_AT_name        : (indirect string, offset: 0xe3217): MMCTGFCR
    <d50>   DW_AT_decl_file   : 5
    <d51>   DW_AT_decl_line   : 440
    <d53>   DW_AT_decl_column : 17
    <d54>   DW_AT_type        : <0xab9>
    <d58>   DW_AT_data_member_location: 360
 <2><d5a>: Abbrev Number: 14 (DW_TAG_member)
    <d5b>   DW_AT_name        : (indirect string, offset: 0xe3ca4): RESERVED5
    <d5f>   DW_AT_decl_file   : 5
    <d60>   DW_AT_decl_line   : 441
    <d62>   DW_AT_decl_column : 17
    <d63>   DW_AT_type        : <0xf6a>
    <d67>   DW_AT_data_member_location: 364
 <2><d69>: Abbrev Number: 14 (DW_TAG_member)
    <d6a>   DW_AT_name        : (indirect string, offset: 0xe3563): MMCRFCECR
    <d6e>   DW_AT_decl_file   : 5
    <d6f>   DW_AT_decl_line   : 442
    <d71>   DW_AT_decl_column : 17
    <d72>   DW_AT_type        : <0xab9>
    <d76>   DW_AT_data_member_location: 404
 <2><d78>: Abbrev Number: 14 (DW_TAG_member)
    <d79>   DW_AT_name        : (indirect string, offset: 0xe2ce4): MMCRFAECR
    <d7d>   DW_AT_decl_file   : 5
    <d7e>   DW_AT_decl_line   : 443
    <d80>   DW_AT_decl_column : 17
    <d81>   DW_AT_type        : <0xab9>
    <d85>   DW_AT_data_member_location: 408
 <2><d87>: Abbrev Number: 14 (DW_TAG_member)
    <d88>   DW_AT_name        : (indirect string, offset: 0xe34d3): RESERVED6
    <d8c>   DW_AT_decl_file   : 5
    <d8d>   DW_AT_decl_line   : 444
    <d8f>   DW_AT_decl_column : 17
    <d90>   DW_AT_type        : <0xf6a>
    <d94>   DW_AT_data_member_location: 412
 <2><d96>: Abbrev Number: 14 (DW_TAG_member)
    <d97>   DW_AT_name        : (indirect string, offset: 0xe2fe9): MMCRGUFCR
    <d9b>   DW_AT_decl_file   : 5
    <d9c>   DW_AT_decl_line   : 445
    <d9e>   DW_AT_decl_column : 17
    <d9f>   DW_AT_type        : <0xab9>
    <da3>   DW_AT_data_member_location: 452
 <2><da5>: Abbrev Number: 14 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0xe3cae): RESERVED7
    <daa>   DW_AT_decl_file   : 5
    <dab>   DW_AT_decl_line   : 446
    <dad>   DW_AT_decl_column : 17
    <dae>   DW_AT_type        : <0xf7a>
    <db2>   DW_AT_data_member_location: 456
 <2><db4>: Abbrev Number: 14 (DW_TAG_member)
    <db5>   DW_AT_name        : (indirect string, offset: 0xe30e2): PTPTSCR
    <db9>   DW_AT_decl_file   : 5
    <dba>   DW_AT_decl_line   : 447
    <dbc>   DW_AT_decl_column : 17
    <dbd>   DW_AT_type        : <0xab9>
    <dc1>   DW_AT_data_member_location: 1792
 <2><dc3>: Abbrev Number: 14 (DW_TAG_member)
    <dc4>   DW_AT_name        : (indirect string, offset: 0xe2d08): PTPSSIR
    <dc8>   DW_AT_decl_file   : 5
    <dc9>   DW_AT_decl_line   : 448
    <dcb>   DW_AT_decl_column : 17
    <dcc>   DW_AT_type        : <0xab9>
    <dd0>   DW_AT_data_member_location: 1796
 <2><dd2>: Abbrev Number: 14 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0xe3106): PTPTSHR
    <dd7>   DW_AT_decl_file   : 5
    <dd8>   DW_AT_decl_line   : 449
    <dda>   DW_AT_decl_column : 17
    <ddb>   DW_AT_type        : <0xab9>
    <ddf>   DW_AT_data_member_location: 1800
 <2><de1>: Abbrev Number: 14 (DW_TAG_member)
    <de2>   DW_AT_name        : (indirect string, offset: 0xe3133): PTPTSLR
    <de6>   DW_AT_decl_file   : 5
    <de7>   DW_AT_decl_line   : 450
    <de9>   DW_AT_decl_column : 17
    <dea>   DW_AT_type        : <0xab9>
    <dee>   DW_AT_data_member_location: 1804
 <2><df0>: Abbrev Number: 14 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0xe33c1): PTPTSHUR
    <df5>   DW_AT_decl_file   : 5
    <df6>   DW_AT_decl_line   : 451
    <df8>   DW_AT_decl_column : 17
    <df9>   DW_AT_type        : <0xab9>
    <dfd>   DW_AT_data_member_location: 1808
 <2><dff>: Abbrev Number: 14 (DW_TAG_member)
    <e00>   DW_AT_name        : (indirect string, offset: 0xe2a35): PTPTSLUR
    <e04>   DW_AT_decl_file   : 5
    <e05>   DW_AT_decl_line   : 452
    <e07>   DW_AT_decl_column : 17
    <e08>   DW_AT_type        : <0xab9>
    <e0c>   DW_AT_data_member_location: 1812
 <2><e0e>: Abbrev Number: 14 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0xe30cb): PTPTSAR
    <e13>   DW_AT_decl_file   : 5
    <e14>   DW_AT_decl_line   : 453
    <e16>   DW_AT_decl_column : 17
    <e17>   DW_AT_type        : <0xab9>
    <e1b>   DW_AT_data_member_location: 1816
 <2><e1d>: Abbrev Number: 14 (DW_TAG_member)
    <e1e>   DW_AT_name        : (indirect string, offset: 0xe342e): PTPTTHR
    <e22>   DW_AT_decl_file   : 5
    <e23>   DW_AT_decl_line   : 454
    <e25>   DW_AT_decl_column : 17
    <e26>   DW_AT_type        : <0xab9>
    <e2a>   DW_AT_data_member_location: 1820
 <2><e2c>: Abbrev Number: 14 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xe3443): PTPTTLR
    <e31>   DW_AT_decl_file   : 5
    <e32>   DW_AT_decl_line   : 455
    <e34>   DW_AT_decl_column : 17
    <e35>   DW_AT_type        : <0xab9>
    <e39>   DW_AT_data_member_location: 1824
 <2><e3b>: Abbrev Number: 14 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0xe34dd): RESERVED8
    <e40>   DW_AT_decl_file   : 5
    <e41>   DW_AT_decl_line   : 456
    <e43>   DW_AT_decl_column : 17
    <e44>   DW_AT_type        : <0xab9>
    <e48>   DW_AT_data_member_location: 1828
 <2><e4a>: Abbrev Number: 14 (DW_TAG_member)
    <e4b>   DW_AT_name        : (indirect string, offset: 0xe31ad): PTPTSSR
    <e4f>   DW_AT_decl_file   : 5
    <e50>   DW_AT_decl_line   : 457
    <e52>   DW_AT_decl_column : 17
    <e53>   DW_AT_type        : <0xab9>
    <e57>   DW_AT_data_member_location: 1832
 <2><e59>: Abbrev Number: 14 (DW_TAG_member)
    <e5a>   DW_AT_name        : (indirect string, offset: 0xe3cb8): RESERVED9
    <e5e>   DW_AT_decl_file   : 5
    <e5f>   DW_AT_decl_line   : 458
    <e61>   DW_AT_decl_column : 17
    <e62>   DW_AT_type        : <0xf8b>
    <e66>   DW_AT_data_member_location: 1836
 <2><e68>: Abbrev Number: 14 (DW_TAG_member)
    <e69>   DW_AT_name        : (indirect string, offset: 0xe2dce): DMABMR
    <e6d>   DW_AT_decl_file   : 5
    <e6e>   DW_AT_decl_line   : 459
    <e70>   DW_AT_decl_column : 17
    <e71>   DW_AT_type        : <0xab9>
    <e75>   DW_AT_data_member_location: 4096
 <2><e77>: Abbrev Number: 14 (DW_TAG_member)
    <e78>   DW_AT_name        : (indirect string, offset: 0xe3889): DMATPDR
    <e7c>   DW_AT_decl_file   : 5
    <e7d>   DW_AT_decl_line   : 460
    <e7f>   DW_AT_decl_column : 17
    <e80>   DW_AT_type        : <0xab9>
    <e84>   DW_AT_data_member_location: 4100
 <2><e86>: Abbrev Number: 14 (DW_TAG_member)
    <e87>   DW_AT_name        : (indirect string, offset: 0xe384b): DMARPDR
    <e8b>   DW_AT_decl_file   : 5
    <e8c>   DW_AT_decl_line   : 461
    <e8e>   DW_AT_decl_column : 17
    <e8f>   DW_AT_type        : <0xab9>
    <e93>   DW_AT_data_member_location: 4104
 <2><e95>: Abbrev Number: 14 (DW_TAG_member)
    <e96>   DW_AT_name        : (indirect string, offset: 0xe2fac): DMARDLAR
    <e9a>   DW_AT_decl_file   : 5
    <e9b>   DW_AT_decl_line   : 462
    <e9d>   DW_AT_decl_column : 17
    <e9e>   DW_AT_type        : <0xab9>
    <ea2>   DW_AT_data_member_location: 4108
 <2><ea4>: Abbrev Number: 14 (DW_TAG_member)
    <ea5>   DW_AT_name        : (indirect string, offset: 0xe3d7c): DMATDLAR
    <ea9>   DW_AT_decl_file   : 5
    <eaa>   DW_AT_decl_line   : 463
    <eac>   DW_AT_decl_column : 17
    <ead>   DW_AT_type        : <0xab9>
    <eb1>   DW_AT_data_member_location: 4112
 <2><eb3>: Abbrev Number: 14 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0xe2ff3): DMASR
    <eb8>   DW_AT_decl_file   : 5
    <eb9>   DW_AT_decl_line   : 464
    <ebb>   DW_AT_decl_column : 17
    <ebc>   DW_AT_type        : <0xab9>
    <ec0>   DW_AT_data_member_location: 4116
 <2><ec2>: Abbrev Number: 14 (DW_TAG_member)
    <ec3>   DW_AT_name        : (indirect string, offset: 0xe2ba4): DMAOMR
    <ec7>   DW_AT_decl_file   : 5
    <ec8>   DW_AT_decl_line   : 465
    <eca>   DW_AT_decl_column : 17
    <ecb>   DW_AT_type        : <0xab9>
    <ecf>   DW_AT_data_member_location: 4120
 <2><ed1>: Abbrev Number: 14 (DW_TAG_member)
    <ed2>   DW_AT_name        : (indirect string, offset: 0xe2f91): DMAIER
    <ed6>   DW_AT_decl_file   : 5
    <ed7>   DW_AT_decl_line   : 466
    <ed9>   DW_AT_decl_column : 17
    <eda>   DW_AT_type        : <0xab9>
    <ede>   DW_AT_data_member_location: 4124
 <2><ee0>: Abbrev Number: 14 (DW_TAG_member)
    <ee1>   DW_AT_name        : (indirect string, offset: 0xe3827): DMAMFBOCR
    <ee5>   DW_AT_decl_file   : 5
    <ee6>   DW_AT_decl_line   : 467
    <ee8>   DW_AT_decl_column : 17
    <ee9>   DW_AT_type        : <0xab9>
    <eed>   DW_AT_data_member_location: 4128
 <2><eef>: Abbrev Number: 14 (DW_TAG_member)
    <ef0>   DW_AT_name        : (indirect string, offset: 0xe37fc): DMARSWTR
    <ef4>   DW_AT_decl_file   : 5
    <ef5>   DW_AT_decl_line   : 468
    <ef7>   DW_AT_decl_column : 17
    <ef8>   DW_AT_type        : <0xab9>
    <efc>   DW_AT_data_member_location: 4132
 <2><efe>: Abbrev Number: 14 (DW_TAG_member)
    <eff>   DW_AT_name        : (indirect string, offset: 0xe2ad5): RESERVED10
    <f03>   DW_AT_decl_file   : 5
    <f04>   DW_AT_decl_line   : 469
    <f06>   DW_AT_decl_column : 17
    <f07>   DW_AT_type        : <0xade>
    <f0b>   DW_AT_data_member_location: 4136
 <2><f0d>: Abbrev Number: 14 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0xe3047): DMACHTDR
    <f12>   DW_AT_decl_file   : 5
    <f13>   DW_AT_decl_line   : 470
    <f15>   DW_AT_decl_column : 17
    <f16>   DW_AT_type        : <0xab9>
    <f1a>   DW_AT_data_member_location: 4168
 <2><f1c>: Abbrev Number: 14 (DW_TAG_member)
    <f1d>   DW_AT_name        : (indirect string, offset: 0xe2a65): DMACHRDR
    <f21>   DW_AT_decl_file   : 5
    <f22>   DW_AT_decl_line   : 471
    <f24>   DW_AT_decl_column : 17
    <f25>   DW_AT_type        : <0xab9>
    <f29>   DW_AT_data_member_location: 4172
 <2><f2b>: Abbrev Number: 14 (DW_TAG_member)
    <f2c>   DW_AT_name        : (indirect string, offset: 0xe32c8): DMACHTBAR
    <f30>   DW_AT_decl_file   : 5
    <f31>   DW_AT_decl_line   : 472
    <f33>   DW_AT_decl_column : 17
    <f34>   DW_AT_type        : <0xab9>
    <f38>   DW_AT_data_member_location: 4176
 <2><f3a>: Abbrev Number: 14 (DW_TAG_member)
    <f3b>   DW_AT_name        : (indirect string, offset: 0xe2b01): DMACHRBAR
    <f3f>   DW_AT_decl_file   : 5
    <f40>   DW_AT_decl_line   : 473
    <f42>   DW_AT_decl_column : 17
    <f43>   DW_AT_type        : <0xab9>
    <f47>   DW_AT_data_member_location: 4180
 <2><f49>: Abbrev Number: 0
 <1><f4a>: Abbrev Number: 7 (DW_TAG_array_type)
    <f4b>   DW_AT_type        : <0xaad>
    <f4f>   DW_AT_sibling     : <0xf5a>
 <2><f53>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <f54>   DW_AT_type        : <0xa7f>
    <f58>   DW_AT_upper_bound : 39
 <2><f59>: Abbrev Number: 0
 <1><f5a>: Abbrev Number: 7 (DW_TAG_array_type)
    <f5b>   DW_AT_type        : <0xaad>
    <f5f>   DW_AT_sibling     : <0xf6a>
 <2><f63>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <f64>   DW_AT_type        : <0xa7f>
    <f68>   DW_AT_upper_bound : 13
 <2><f69>: Abbrev Number: 0
 <1><f6a>: Abbrev Number: 7 (DW_TAG_array_type)
    <f6b>   DW_AT_type        : <0xaad>
    <f6f>   DW_AT_sibling     : <0xf7a>
 <2><f73>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <f74>   DW_AT_type        : <0xa7f>
    <f78>   DW_AT_upper_bound : 9
 <2><f79>: Abbrev Number: 0
 <1><f7a>: Abbrev Number: 7 (DW_TAG_array_type)
    <f7b>   DW_AT_type        : <0xaad>
    <f7f>   DW_AT_sibling     : <0xf8b>
 <2><f83>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <f84>   DW_AT_type        : <0xa7f>
    <f88>   DW_AT_upper_bound : 333
 <2><f8a>: Abbrev Number: 0
 <1><f8b>: Abbrev Number: 7 (DW_TAG_array_type)
    <f8c>   DW_AT_type        : <0xaad>
    <f90>   DW_AT_sibling     : <0xf9c>
 <2><f94>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <f95>   DW_AT_type        : <0xa7f>
    <f99>   DW_AT_upper_bound : 564
 <2><f9b>: Abbrev Number: 0
 <1><f9c>: Abbrev Number: 12 (DW_TAG_typedef)
    <f9d>   DW_AT_name        : (indirect string, offset: 0xe29a8): ETH_TypeDef
    <fa1>   DW_AT_decl_file   : 5
    <fa2>   DW_AT_decl_line   : 474
    <fa4>   DW_AT_decl_column : 3
    <fa5>   DW_AT_type        : <0xb69>
 <1><fa9>: Abbrev Number: 7 (DW_TAG_array_type)
    <faa>   DW_AT_type        : <0xab9>
    <fae>   DW_AT_sibling     : <0xfb9>
 <2><fb2>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <fb3>   DW_AT_type        : <0xa7f>
    <fb7>   DW_AT_upper_bound : 1
 <2><fb8>: Abbrev Number: 0
 <1><fb9>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fba>   DW_AT_type        : <0xfa9>
 <1><fbe>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fbf>   DW_AT_byte_size   : 40
    <fc0>   DW_AT_decl_file   : 5
    <fc1>   DW_AT_decl_line   : 574
    <fc3>   DW_AT_decl_column : 9
    <fc4>   DW_AT_sibling     : <0x1047>
 <2><fc8>: Abbrev Number: 11 (DW_TAG_member)
    <fc9>   DW_AT_name        : (indirect string, offset: 0xe260f): MODER
    <fcd>   DW_AT_decl_file   : 5
    <fce>   DW_AT_decl_line   : 576
    <fd0>   DW_AT_decl_column : 17
    <fd1>   DW_AT_type        : <0xab9>
    <fd5>   DW_AT_data_member_location: 0
 <2><fd6>: Abbrev Number: 11 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0xe2709): OTYPER
    <fdb>   DW_AT_decl_file   : 5
    <fdc>   DW_AT_decl_line   : 577
    <fde>   DW_AT_decl_column : 17
    <fdf>   DW_AT_type        : <0xab9>
    <fe3>   DW_AT_data_member_location: 4
 <2><fe4>: Abbrev Number: 11 (DW_TAG_member)
    <fe5>   DW_AT_name        : (indirect string, offset: 0xe275c): OSPEEDR
    <fe9>   DW_AT_decl_file   : 5
    <fea>   DW_AT_decl_line   : 578
    <fec>   DW_AT_decl_column : 17
    <fed>   DW_AT_type        : <0xab9>
    <ff1>   DW_AT_data_member_location: 8
 <2><ff2>: Abbrev Number: 11 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0xe26e6): PUPDR
    <ff7>   DW_AT_decl_file   : 5
    <ff8>   DW_AT_decl_line   : 579
    <ffa>   DW_AT_decl_column : 17
    <ffb>   DW_AT_type        : <0xab9>
    <fff>   DW_AT_data_member_location: 12
 <2><1000>: Abbrev Number: 10 (DW_TAG_member)
    <1001>   DW_AT_name        : IDR
    <1005>   DW_AT_decl_file   : 5
    <1006>   DW_AT_decl_line   : 580
    <1008>   DW_AT_decl_column : 17
    <1009>   DW_AT_type        : <0xab9>
    <100d>   DW_AT_data_member_location: 16
 <2><100e>: Abbrev Number: 10 (DW_TAG_member)
    <100f>   DW_AT_name        : ODR
    <1013>   DW_AT_decl_file   : 5
    <1014>   DW_AT_decl_line   : 581
    <1016>   DW_AT_decl_column : 17
    <1017>   DW_AT_type        : <0xab9>
    <101b>   DW_AT_data_member_location: 20
 <2><101c>: Abbrev Number: 11 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0xe268c): BSRR
    <1021>   DW_AT_decl_file   : 5
    <1022>   DW_AT_decl_line   : 582
    <1024>   DW_AT_decl_column : 17
    <1025>   DW_AT_type        : <0xab9>
    <1029>   DW_AT_data_member_location: 24
 <2><102a>: Abbrev Number: 11 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0xe2757): LCKR
    <102f>   DW_AT_decl_file   : 5
    <1030>   DW_AT_decl_line   : 583
    <1032>   DW_AT_decl_column : 17
    <1033>   DW_AT_type        : <0xab9>
    <1037>   DW_AT_data_member_location: 28
 <2><1038>: Abbrev Number: 10 (DW_TAG_member)
    <1039>   DW_AT_name        : AFR
    <103d>   DW_AT_decl_file   : 5
    <103e>   DW_AT_decl_line   : 584
    <1040>   DW_AT_decl_column : 17
    <1041>   DW_AT_type        : <0xfb9>
    <1045>   DW_AT_data_member_location: 32
 <2><1046>: Abbrev Number: 0
 <1><1047>: Abbrev Number: 12 (DW_TAG_typedef)
    <1048>   DW_AT_name        : (indirect string, offset: 0xe2798): GPIO_TypeDef
    <104c>   DW_AT_decl_file   : 5
    <104d>   DW_AT_decl_line   : 585
    <104f>   DW_AT_decl_column : 3
    <1050>   DW_AT_type        : <0xfbe>
 <1><1054>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1055>   DW_AT_byte_size   : 8
    <1056>   DW_AT_decl_file   : 5
    <1057>   DW_AT_decl_line   : 681
    <1059>   DW_AT_decl_column : 9
    <105a>   DW_AT_sibling     : <0x107a>
 <2><105e>: Abbrev Number: 10 (DW_TAG_member)
    <105f>   DW_AT_name        : CR
    <1062>   DW_AT_decl_file   : 5
    <1063>   DW_AT_decl_line   : 683
    <1065>   DW_AT_decl_column : 17
    <1066>   DW_AT_type        : <0xab9>
    <106a>   DW_AT_data_member_location: 0
 <2><106b>: Abbrev Number: 10 (DW_TAG_member)
    <106c>   DW_AT_name        : CSR
    <1070>   DW_AT_decl_file   : 5
    <1071>   DW_AT_decl_line   : 684
    <1073>   DW_AT_decl_column : 17
    <1074>   DW_AT_type        : <0xab9>
    <1078>   DW_AT_data_member_location: 4
 <2><1079>: Abbrev Number: 0
 <1><107a>: Abbrev Number: 12 (DW_TAG_typedef)
    <107b>   DW_AT_name        : (indirect string, offset: 0xe3773): PWR_TypeDef
    <107f>   DW_AT_decl_file   : 5
    <1080>   DW_AT_decl_line   : 685
    <1082>   DW_AT_decl_column : 3
    <1083>   DW_AT_type        : <0x1054>
 <1><1087>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1088>   DW_AT_byte_size   : 144
    <1089>   DW_AT_decl_file   : 5
    <108a>   DW_AT_decl_line   : 691
    <108c>   DW_AT_decl_column : 9
    <108d>   DW_AT_sibling     : <0x1251>
 <2><1091>: Abbrev Number: 10 (DW_TAG_member)
    <1092>   DW_AT_name        : CR
    <1095>   DW_AT_decl_file   : 5
    <1096>   DW_AT_decl_line   : 693
    <1098>   DW_AT_decl_column : 17
    <1099>   DW_AT_type        : <0xab9>
    <109d>   DW_AT_data_member_location: 0
 <2><109e>: Abbrev Number: 11 (DW_TAG_member)
    <109f>   DW_AT_name        : (indirect string, offset: 0xe371e): PLLCFGR
    <10a3>   DW_AT_decl_file   : 5
    <10a4>   DW_AT_decl_line   : 694
    <10a6>   DW_AT_decl_column : 17
    <10a7>   DW_AT_type        : <0xab9>
    <10ab>   DW_AT_data_member_location: 4
 <2><10ac>: Abbrev Number: 11 (DW_TAG_member)
    <10ad>   DW_AT_name        : (indirect string, offset: 0xe3b9a): CFGR
    <10b1>   DW_AT_decl_file   : 5
    <10b2>   DW_AT_decl_line   : 695
    <10b4>   DW_AT_decl_column : 17
    <10b5>   DW_AT_type        : <0xab9>
    <10b9>   DW_AT_data_member_location: 8
 <2><10ba>: Abbrev Number: 10 (DW_TAG_member)
    <10bb>   DW_AT_name        : CIR
    <10bf>   DW_AT_decl_file   : 5
    <10c0>   DW_AT_decl_line   : 696
    <10c2>   DW_AT_decl_column : 17
    <10c3>   DW_AT_type        : <0xab9>
    <10c7>   DW_AT_data_member_location: 12
 <2><10c8>: Abbrev Number: 11 (DW_TAG_member)
    <10c9>   DW_AT_name        : (indirect string, offset: 0xe390c): AHB1RSTR
    <10cd>   DW_AT_decl_file   : 5
    <10ce>   DW_AT_decl_line   : 697
    <10d0>   DW_AT_decl_column : 17
    <10d1>   DW_AT_type        : <0xab9>
    <10d5>   DW_AT_data_member_location: 16
 <2><10d6>: Abbrev Number: 11 (DW_TAG_member)
    <10d7>   DW_AT_name        : (indirect string, offset: 0xe2a47): AHB2RSTR
    <10db>   DW_AT_decl_file   : 5
    <10dc>   DW_AT_decl_line   : 698
    <10de>   DW_AT_decl_column : 17
    <10df>   DW_AT_type        : <0xab9>
    <10e3>   DW_AT_data_member_location: 20
 <2><10e4>: Abbrev Number: 11 (DW_TAG_member)
    <10e5>   DW_AT_name        : (indirect string, offset: 0xe313b): AHB3RSTR
    <10e9>   DW_AT_decl_file   : 5
    <10ea>   DW_AT_decl_line   : 699
    <10ec>   DW_AT_decl_column : 17
    <10ed>   DW_AT_type        : <0xab9>
    <10f1>   DW_AT_data_member_location: 24
 <2><10f2>: Abbrev Number: 11 (DW_TAG_member)
    <10f3>   DW_AT_name        : (indirect string, offset: 0xe3c72): RESERVED0
    <10f7>   DW_AT_decl_file   : 5
    <10f8>   DW_AT_decl_line   : 700
    <10fa>   DW_AT_decl_column : 17
    <10fb>   DW_AT_type        : <0xaad>
    <10ff>   DW_AT_data_member_location: 28
 <2><1100>: Abbrev Number: 11 (DW_TAG_member)
    <1101>   DW_AT_name        : (indirect string, offset: 0xe2a3e): APB1RSTR
    <1105>   DW_AT_decl_file   : 5
    <1106>   DW_AT_decl_line   : 701
    <1108>   DW_AT_decl_column : 17
    <1109>   DW_AT_type        : <0xab9>
    <110d>   DW_AT_data_member_location: 32
 <2><110e>: Abbrev Number: 11 (DW_TAG_member)
    <110f>   DW_AT_name        : (indirect string, offset: 0xe312a): APB2RSTR
    <1113>   DW_AT_decl_file   : 5
    <1114>   DW_AT_decl_line   : 702
    <1116>   DW_AT_decl_column : 17
    <1117>   DW_AT_type        : <0xab9>
    <111b>   DW_AT_data_member_location: 36
 <2><111c>: Abbrev Number: 11 (DW_TAG_member)
    <111d>   DW_AT_name        : (indirect string, offset: 0xe3c7c): RESERVED1
    <1121>   DW_AT_decl_file   : 5
    <1122>   DW_AT_decl_line   : 703
    <1124>   DW_AT_decl_column : 17
    <1125>   DW_AT_type        : <0xace>
    <1129>   DW_AT_data_member_location: 40
 <2><112a>: Abbrev Number: 11 (DW_TAG_member)
    <112b>   DW_AT_name        : (indirect string, offset: 0xe29e0): AHB1ENR
    <112f>   DW_AT_decl_file   : 5
    <1130>   DW_AT_decl_line   : 704
    <1132>   DW_AT_decl_column : 17
    <1133>   DW_AT_type        : <0xab9>
    <1137>   DW_AT_data_member_location: 48
 <2><1138>: Abbrev Number: 11 (DW_TAG_member)
    <1139>   DW_AT_name        : (indirect string, offset: 0xe2d49): AHB2ENR
    <113d>   DW_AT_decl_file   : 5
    <113e>   DW_AT_decl_line   : 705
    <1140>   DW_AT_decl_column : 17
    <1141>   DW_AT_type        : <0xab9>
    <1145>   DW_AT_data_member_location: 52
 <2><1146>: Abbrev Number: 11 (DW_TAG_member)
    <1147>   DW_AT_name        : (indirect string, offset: 0xe31a5): AHB3ENR
    <114b>   DW_AT_decl_file   : 5
    <114c>   DW_AT_decl_line   : 706
    <114e>   DW_AT_decl_column : 17
    <114f>   DW_AT_type        : <0xab9>
    <1153>   DW_AT_data_member_location: 56
 <2><1154>: Abbrev Number: 11 (DW_TAG_member)
    <1155>   DW_AT_name        : (indirect string, offset: 0xe3c86): RESERVED2
    <1159>   DW_AT_decl_file   : 5
    <115a>   DW_AT_decl_line   : 707
    <115c>   DW_AT_decl_column : 17
    <115d>   DW_AT_type        : <0xaad>
    <1161>   DW_AT_data_member_location: 60
 <2><1162>: Abbrev Number: 11 (DW_TAG_member)
    <1163>   DW_AT_name        : (indirect string, offset: 0xe344b): APB1ENR
    <1167>   DW_AT_decl_file   : 5
    <1168>   DW_AT_decl_line   : 708
    <116a>   DW_AT_decl_column : 17
    <116b>   DW_AT_type        : <0xab9>
    <116f>   DW_AT_data_member_location: 64
 <2><1170>: Abbrev Number: 11 (DW_TAG_member)
    <1171>   DW_AT_name        : (indirect string, offset: 0xe2a78): APB2ENR
    <1175>   DW_AT_decl_file   : 5
    <1176>   DW_AT_decl_line   : 709
    <1178>   DW_AT_decl_column : 17
    <1179>   DW_AT_type        : <0xab9>
    <117d>   DW_AT_data_member_location: 68
 <2><117e>: Abbrev Number: 11 (DW_TAG_member)
    <117f>   DW_AT_name        : (indirect string, offset: 0xe3c90): RESERVED3
    <1183>   DW_AT_decl_file   : 5
    <1184>   DW_AT_decl_line   : 710
    <1186>   DW_AT_decl_column : 17
    <1187>   DW_AT_type        : <0xace>
    <118b>   DW_AT_data_member_location: 72
 <2><118c>: Abbrev Number: 11 (DW_TAG_member)
    <118d>   DW_AT_name        : (indirect string, offset: 0xe3969): AHB1LPENR
    <1191>   DW_AT_decl_file   : 5
    <1192>   DW_AT_decl_line   : 711
    <1194>   DW_AT_decl_column : 17
    <1195>   DW_AT_type        : <0xab9>
    <1199>   DW_AT_data_member_location: 80
 <2><119a>: Abbrev Number: 11 (DW_TAG_member)
    <119b>   DW_AT_name        : (indirect string, offset: 0xe2c5b): AHB2LPENR
    <119f>   DW_AT_decl_file   : 5
    <11a0>   DW_AT_decl_line   : 712
    <11a2>   DW_AT_decl_column : 17
    <11a3>   DW_AT_type        : <0xab9>
    <11a7>   DW_AT_data_member_location: 84
 <2><11a8>: Abbrev Number: 11 (DW_TAG_member)
    <11a9>   DW_AT_name        : (indirect string, offset: 0xe366b): AHB3LPENR
    <11ad>   DW_AT_decl_file   : 5
    <11ae>   DW_AT_decl_line   : 713
    <11b0>   DW_AT_decl_column : 17
    <11b1>   DW_AT_type        : <0xab9>
    <11b5>   DW_AT_data_member_location: 88
 <2><11b6>: Abbrev Number: 11 (DW_TAG_member)
    <11b7>   DW_AT_name        : (indirect string, offset: 0xe3c9a): RESERVED4
    <11bb>   DW_AT_decl_file   : 5
    <11bc>   DW_AT_decl_line   : 714
    <11be>   DW_AT_decl_column : 17
    <11bf>   DW_AT_type        : <0xaad>
    <11c3>   DW_AT_data_member_location: 92
 <2><11c4>: Abbrev Number: 11 (DW_TAG_member)
    <11c5>   DW_AT_name        : (indirect string, offset: 0xe3a18): APB1LPENR
    <11c9>   DW_AT_decl_file   : 5
    <11ca>   DW_AT_decl_line   : 715
    <11cc>   DW_AT_decl_column : 17
    <11cd>   DW_AT_type        : <0xab9>
    <11d1>   DW_AT_data_member_location: 96
 <2><11d2>: Abbrev Number: 11 (DW_TAG_member)
    <11d3>   DW_AT_name        : (indirect string, offset: 0xe2b1b): APB2LPENR
    <11d7>   DW_AT_decl_file   : 5
    <11d8>   DW_AT_decl_line   : 716
    <11da>   DW_AT_decl_column : 17
    <11db>   DW_AT_type        : <0xab9>
    <11df>   DW_AT_data_member_location: 100
 <2><11e0>: Abbrev Number: 11 (DW_TAG_member)
    <11e1>   DW_AT_name        : (indirect string, offset: 0xe3ca4): RESERVED5
    <11e5>   DW_AT_decl_file   : 5
    <11e6>   DW_AT_decl_line   : 717
    <11e8>   DW_AT_decl_column : 17
    <11e9>   DW_AT_type        : <0xace>
    <11ed>   DW_AT_data_member_location: 104
 <2><11ee>: Abbrev Number: 11 (DW_TAG_member)
    <11ef>   DW_AT_name        : (indirect string, offset: 0xe2ae0): BDCR
    <11f3>   DW_AT_decl_file   : 5
    <11f4>   DW_AT_decl_line   : 718
    <11f6>   DW_AT_decl_column : 17
    <11f7>   DW_AT_type        : <0xab9>
    <11fb>   DW_AT_data_member_location: 112
 <2><11fc>: Abbrev Number: 10 (DW_TAG_member)
    <11fd>   DW_AT_name        : CSR
    <1201>   DW_AT_decl_file   : 5
    <1202>   DW_AT_decl_line   : 719
    <1204>   DW_AT_decl_column : 17
    <1205>   DW_AT_type        : <0xab9>
    <1209>   DW_AT_data_member_location: 116
 <2><120a>: Abbrev Number: 11 (DW_TAG_member)
    <120b>   DW_AT_name        : (indirect string, offset: 0xe34d3): RESERVED6
    <120f>   DW_AT_decl_file   : 5
    <1210>   DW_AT_decl_line   : 720
    <1212>   DW_AT_decl_column : 17
    <1213>   DW_AT_type        : <0xace>
    <1217>   DW_AT_data_member_location: 120
 <2><1218>: Abbrev Number: 11 (DW_TAG_member)
    <1219>   DW_AT_name        : (indirect string, offset: 0xe330a): SSCGR
    <121d>   DW_AT_decl_file   : 5
    <121e>   DW_AT_decl_line   : 721
    <1220>   DW_AT_decl_column : 17
    <1221>   DW_AT_type        : <0xab9>
    <1225>   DW_AT_data_member_location: 128
 <2><1226>: Abbrev Number: 11 (DW_TAG_member)
    <1227>   DW_AT_name        : (indirect string, offset: 0xe2ed7): PLLI2SCFGR
    <122b>   DW_AT_decl_file   : 5
    <122c>   DW_AT_decl_line   : 722
    <122e>   DW_AT_decl_column : 17
    <122f>   DW_AT_type        : <0xab9>
    <1233>   DW_AT_data_member_location: 132
 <2><1234>: Abbrev Number: 11 (DW_TAG_member)
    <1235>   DW_AT_name        : (indirect string, offset: 0xe3b94): PLLSAICFGR
    <1239>   DW_AT_decl_file   : 5
    <123a>   DW_AT_decl_line   : 723
    <123c>   DW_AT_decl_column : 17
    <123d>   DW_AT_type        : <0xab9>
    <1241>   DW_AT_data_member_location: 136
 <2><1242>: Abbrev Number: 11 (DW_TAG_member)
    <1243>   DW_AT_name        : (indirect string, offset: 0xe3144): DCKCFGR
    <1247>   DW_AT_decl_file   : 5
    <1248>   DW_AT_decl_line   : 724
    <124a>   DW_AT_decl_column : 17
    <124b>   DW_AT_type        : <0xab9>
    <124f>   DW_AT_data_member_location: 140
 <2><1250>: Abbrev Number: 0
 <1><1251>: Abbrev Number: 12 (DW_TAG_typedef)
    <1252>   DW_AT_name        : (indirect string, offset: 0xe31eb): RCC_TypeDef
    <1256>   DW_AT_decl_file   : 5
    <1257>   DW_AT_decl_line   : 725
    <1259>   DW_AT_decl_column : 3
    <125a>   DW_AT_type        : <0x1087>
 <1><125e>: Abbrev Number: 9 (DW_TAG_structure_type)
    <125f>   DW_AT_byte_size   : 84
    <1260>   DW_AT_decl_file   : 5
    <1261>   DW_AT_decl_line   : 846
    <1263>   DW_AT_decl_column : 9
    <1264>   DW_AT_sibling     : <0x138d>
 <2><1268>: Abbrev Number: 10 (DW_TAG_member)
    <1269>   DW_AT_name        : CR1
    <126d>   DW_AT_decl_file   : 5
    <126e>   DW_AT_decl_line   : 848
    <1270>   DW_AT_decl_column : 17
    <1271>   DW_AT_type        : <0xab9>
    <1275>   DW_AT_data_member_location: 0
 <2><1276>: Abbrev Number: 10 (DW_TAG_member)
    <1277>   DW_AT_name        : CR2
    <127b>   DW_AT_decl_file   : 5
    <127c>   DW_AT_decl_line   : 849
    <127e>   DW_AT_decl_column : 17
    <127f>   DW_AT_type        : <0xab9>
    <1283>   DW_AT_data_member_location: 4
 <2><1284>: Abbrev Number: 11 (DW_TAG_member)
    <1285>   DW_AT_name        : (indirect string, offset: 0x421fa): SMCR
    <1289>   DW_AT_decl_file   : 5
    <128a>   DW_AT_decl_line   : 850
    <128c>   DW_AT_decl_column : 17
    <128d>   DW_AT_type        : <0xab9>
    <1291>   DW_AT_data_member_location: 8
 <2><1292>: Abbrev Number: 11 (DW_TAG_member)
    <1293>   DW_AT_name        : (indirect string, offset: 0x48d25): DIER
    <1297>   DW_AT_decl_file   : 5
    <1298>   DW_AT_decl_line   : 851
    <129a>   DW_AT_decl_column : 17
    <129b>   DW_AT_type        : <0xab9>
    <129f>   DW_AT_data_member_location: 12
 <2><12a0>: Abbrev Number: 10 (DW_TAG_member)
    <12a1>   DW_AT_name        : SR
    <12a4>   DW_AT_decl_file   : 5
    <12a5>   DW_AT_decl_line   : 852
    <12a7>   DW_AT_decl_column : 17
    <12a8>   DW_AT_type        : <0xab9>
    <12ac>   DW_AT_data_member_location: 16
 <2><12ad>: Abbrev Number: 10 (DW_TAG_member)
    <12ae>   DW_AT_name        : EGR
    <12b2>   DW_AT_decl_file   : 5
    <12b3>   DW_AT_decl_line   : 853
    <12b5>   DW_AT_decl_column : 17
    <12b6>   DW_AT_type        : <0xab9>
    <12ba>   DW_AT_data_member_location: 20
 <2><12bb>: Abbrev Number: 11 (DW_TAG_member)
    <12bc>   DW_AT_name        : (indirect string, offset: 0xcda98): CCMR1
    <12c0>   DW_AT_decl_file   : 5
    <12c1>   DW_AT_decl_line   : 854
    <12c3>   DW_AT_decl_column : 17
    <12c4>   DW_AT_type        : <0xab9>
    <12c8>   DW_AT_data_member_location: 24
 <2><12c9>: Abbrev Number: 11 (DW_TAG_member)
    <12ca>   DW_AT_name        : (indirect string, offset: 0x59e34): CCMR2
    <12ce>   DW_AT_decl_file   : 5
    <12cf>   DW_AT_decl_line   : 855
    <12d1>   DW_AT_decl_column : 17
    <12d2>   DW_AT_type        : <0xab9>
    <12d6>   DW_AT_data_member_location: 28
 <2><12d7>: Abbrev Number: 11 (DW_TAG_member)
    <12d8>   DW_AT_name        : (indirect string, offset: 0x3713d): CCER
    <12dc>   DW_AT_decl_file   : 5
    <12dd>   DW_AT_decl_line   : 856
    <12df>   DW_AT_decl_column : 17
    <12e0>   DW_AT_type        : <0xab9>
    <12e4>   DW_AT_data_member_location: 32
 <2><12e5>: Abbrev Number: 10 (DW_TAG_member)
    <12e6>   DW_AT_name        : CNT
    <12ea>   DW_AT_decl_file   : 5
    <12eb>   DW_AT_decl_line   : 857
    <12ed>   DW_AT_decl_column : 17
    <12ee>   DW_AT_type        : <0xab9>
    <12f2>   DW_AT_data_member_location: 36
 <2><12f3>: Abbrev Number: 10 (DW_TAG_member)
    <12f4>   DW_AT_name        : PSC
    <12f8>   DW_AT_decl_file   : 5
    <12f9>   DW_AT_decl_line   : 858
    <12fb>   DW_AT_decl_column : 17
    <12fc>   DW_AT_type        : <0xab9>
    <1300>   DW_AT_data_member_location: 40
 <2><1301>: Abbrev Number: 10 (DW_TAG_member)
    <1302>   DW_AT_name        : ARR
    <1306>   DW_AT_decl_file   : 5
    <1307>   DW_AT_decl_line   : 859
    <1309>   DW_AT_decl_column : 17
    <130a>   DW_AT_type        : <0xab9>
    <130e>   DW_AT_data_member_location: 44
 <2><130f>: Abbrev Number: 10 (DW_TAG_member)
    <1310>   DW_AT_name        : RCR
    <1314>   DW_AT_decl_file   : 5
    <1315>   DW_AT_decl_line   : 860
    <1317>   DW_AT_decl_column : 17
    <1318>   DW_AT_type        : <0xab9>
    <131c>   DW_AT_data_member_location: 48
 <2><131d>: Abbrev Number: 11 (DW_TAG_member)
    <131e>   DW_AT_name        : (indirect string, offset: 0x1b853): CCR1
    <1322>   DW_AT_decl_file   : 5
    <1323>   DW_AT_decl_line   : 861
    <1325>   DW_AT_decl_column : 17
    <1326>   DW_AT_type        : <0xab9>
    <132a>   DW_AT_data_member_location: 52
 <2><132b>: Abbrev Number: 11 (DW_TAG_member)
    <132c>   DW_AT_name        : (indirect string, offset: 0x5e453): CCR2
    <1330>   DW_AT_decl_file   : 5
    <1331>   DW_AT_decl_line   : 862
    <1333>   DW_AT_decl_column : 17
    <1334>   DW_AT_type        : <0xab9>
    <1338>   DW_AT_data_member_location: 56
 <2><1339>: Abbrev Number: 11 (DW_TAG_member)
    <133a>   DW_AT_name        : (indirect string, offset: 0xac3c9): CCR3
    <133e>   DW_AT_decl_file   : 5
    <133f>   DW_AT_decl_line   : 863
    <1341>   DW_AT_decl_column : 17
    <1342>   DW_AT_type        : <0xab9>
    <1346>   DW_AT_data_member_location: 60
 <2><1347>: Abbrev Number: 11 (DW_TAG_member)
    <1348>   DW_AT_name        : (indirect string, offset: 0xe1c3): CCR4
    <134c>   DW_AT_decl_file   : 5
    <134d>   DW_AT_decl_line   : 864
    <134f>   DW_AT_decl_column : 17
    <1350>   DW_AT_type        : <0xab9>
    <1354>   DW_AT_data_member_location: 64
 <2><1355>: Abbrev Number: 11 (DW_TAG_member)
    <1356>   DW_AT_name        : (indirect string, offset: 0x99e10): BDTR
    <135a>   DW_AT_decl_file   : 5
    <135b>   DW_AT_decl_line   : 865
    <135d>   DW_AT_decl_column : 17
    <135e>   DW_AT_type        : <0xab9>
    <1362>   DW_AT_data_member_location: 68
 <2><1363>: Abbrev Number: 10 (DW_TAG_member)
    <1364>   DW_AT_name        : DCR
    <1368>   DW_AT_decl_file   : 5
    <1369>   DW_AT_decl_line   : 866
    <136b>   DW_AT_decl_column : 17
    <136c>   DW_AT_type        : <0xab9>
    <1370>   DW_AT_data_member_location: 72
 <2><1371>: Abbrev Number: 11 (DW_TAG_member)
    <1372>   DW_AT_name        : (indirect string, offset: 0xc1947): DMAR
    <1376>   DW_AT_decl_file   : 5
    <1377>   DW_AT_decl_line   : 867
    <1379>   DW_AT_decl_column : 17
    <137a>   DW_AT_type        : <0xab9>
    <137e>   DW_AT_data_member_location: 76
 <2><137f>: Abbrev Number: 10 (DW_TAG_member)
    <1380>   DW_AT_name        : OR
    <1383>   DW_AT_decl_file   : 5
    <1384>   DW_AT_decl_line   : 868
    <1386>   DW_AT_decl_column : 17
    <1387>   DW_AT_type        : <0xab9>
    <138b>   DW_AT_data_member_location: 80
 <2><138c>: Abbrev Number: 0
 <1><138d>: Abbrev Number: 12 (DW_TAG_typedef)
    <138e>   DW_AT_name        : (indirect string, offset: 0xe3cc2): TIM_TypeDef
    <1392>   DW_AT_decl_file   : 5
    <1393>   DW_AT_decl_line   : 869
    <1395>   DW_AT_decl_column : 3
    <1396>   DW_AT_type        : <0x125e>
 <1><139a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <139b>   DW_AT_byte_size   : 28
    <139c>   DW_AT_decl_file   : 5
    <139d>   DW_AT_decl_line   : 875
    <139f>   DW_AT_decl_column : 9
    <13a0>   DW_AT_sibling     : <0x1405>
 <2><13a4>: Abbrev Number: 10 (DW_TAG_member)
    <13a5>   DW_AT_name        : SR
    <13a8>   DW_AT_decl_file   : 5
    <13a9>   DW_AT_decl_line   : 877
    <13ab>   DW_AT_decl_column : 17
    <13ac>   DW_AT_type        : <0xab9>
    <13b0>   DW_AT_data_member_location: 0
 <2><13b1>: Abbrev Number: 10 (DW_TAG_member)
    <13b2>   DW_AT_name        : DR
    <13b5>   DW_AT_decl_file   : 5
    <13b6>   DW_AT_decl_line   : 878
    <13b8>   DW_AT_decl_column : 17
