Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x457 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xb9ee4): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x4bdb9): ../App/Src/app.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x31da1): C:/Users/ipave/Documentos/GitHub/RTOSI/freertos_app_Example5_6/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x70f2b): signed char
 <1><30>: Abbrev Number: 3 (DW_TAG_typedef)
    <31>   DW_AT_name        : (indirect string, offset: 0x41ad4): __uint8_t
    <35>   DW_AT_decl_file   : 3
    <36>   DW_AT_decl_line   : 43
    <37>   DW_AT_decl_column : 24
    <38>   DW_AT_type        : <0x3c>
 <1><3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <3d>   DW_AT_byte_size   : 1
    <3e>   DW_AT_encoding    : 8	(unsigned char)
    <3f>   DW_AT_name        : (indirect string, offset: 0xd9c35): unsigned char
 <1><43>: Abbrev Number: 2 (DW_TAG_base_type)
    <44>   DW_AT_byte_size   : 2
    <45>   DW_AT_encoding    : 5	(signed)
    <46>   DW_AT_name        : (indirect string, offset: 0xa80e9): short int
 <1><4a>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b>   DW_AT_name        : (indirect string, offset: 0xb7e2b): __uint16_t
    <4f>   DW_AT_decl_file   : 3
    <50>   DW_AT_decl_line   : 57
    <51>   DW_AT_decl_column : 25
    <52>   DW_AT_type        : <0x56>
 <1><56>: Abbrev Number: 2 (DW_TAG_base_type)
    <57>   DW_AT_byte_size   : 2
    <58>   DW_AT_encoding    : 7	(unsigned)
    <59>   DW_AT_name        : (indirect string, offset: 0xd83db): short unsigned int
 <1><5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <5e>   DW_AT_byte_size   : 4
    <5f>   DW_AT_encoding    : 5	(signed)
    <60>   DW_AT_name        : (indirect string, offset: 0x13308): long int
 <1><64>: Abbrev Number: 3 (DW_TAG_typedef)
    <65>   DW_AT_name        : (indirect string, offset: 0x8fd65): __uint32_t
    <69>   DW_AT_decl_file   : 3
    <6a>   DW_AT_decl_line   : 79
    <6b>   DW_AT_decl_column : 25
    <6c>   DW_AT_type        : <0x70>
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 4
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0x56588): long unsigned int
 <1><77>: Abbrev Number: 2 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 8
    <79>   DW_AT_encoding    : 5	(signed)
    <7a>   DW_AT_name        : (indirect string, offset: 0x66ce1): long long int
 <1><7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f>   DW_AT_byte_size   : 8
    <80>   DW_AT_encoding    : 7	(unsigned)
    <81>   DW_AT_name        : (indirect string, offset: 0x2f4d0): long long unsigned int
 <1><85>: Abbrev Number: 4 (DW_TAG_base_type)
    <86>   DW_AT_byte_size   : 4
    <87>   DW_AT_encoding    : 5	(signed)
    <88>   DW_AT_name        : int
 <1><8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x127bb): unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x41ad6): uint8_t
    <98>   DW_AT_decl_file   : 4
    <99>   DW_AT_decl_line   : 24
    <9a>   DW_AT_decl_column : 19
    <9b>   DW_AT_type        : <0x30>
 <1><9f>: Abbrev Number: 5 (DW_TAG_const_type)
    <a0>   DW_AT_type        : <0x93>
 <1><a4>: Abbrev Number: 3 (DW_TAG_typedef)
    <a5>   DW_AT_name        : (indirect string, offset: 0xa481b): uint16_t
    <a9>   DW_AT_decl_file   : 4
    <aa>   DW_AT_decl_line   : 36
    <ab>   DW_AT_decl_column : 20
    <ac>   DW_AT_type        : <0x4a>
 <1><b0>: Abbrev Number: 5 (DW_TAG_const_type)
    <b1>   DW_AT_type        : <0xa4>
 <1><b5>: Abbrev Number: 3 (DW_TAG_typedef)
    <b6>   DW_AT_name        : (indirect string, offset: 0xd7f27): uint32_t
    <ba>   DW_AT_decl_file   : 4
    <bb>   DW_AT_decl_line   : 48
    <bc>   DW_AT_decl_column : 20
    <bd>   DW_AT_type        : <0x64>
 <1><c1>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c2>   DW_AT_type        : <0xb5>
 <1><c6>: Abbrev Number: 7 (DW_TAG_array_type)
    <c7>   DW_AT_type        : <0xc1>
    <cb>   DW_AT_sibling     : <0xd6>
 <2><cf>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <d0>   DW_AT_type        : <0x8c>
    <d4>   DW_AT_upper_bound : 1
 <2><d5>: Abbrev Number: 0
 <1><d6>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <d7>   DW_AT_type        : <0xc6>
 <1><db>: Abbrev Number: 9 (DW_TAG_structure_type)
    <dc>   DW_AT_byte_size   : 40
    <dd>   DW_AT_decl_file   : 5
    <de>   DW_AT_decl_line   : 574
    <e0>   DW_AT_decl_column : 9
    <e1>   DW_AT_sibling     : <0x164>
 <2><e5>: Abbrev Number: 10 (DW_TAG_member)
    <e6>   DW_AT_name        : (indirect string, offset: 0x1595): MODER
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 576
    <ed>   DW_AT_decl_column : 17
    <ee>   DW_AT_type        : <0xc1>
    <f2>   DW_AT_data_member_location: 0
 <2><f3>: Abbrev Number: 10 (DW_TAG_member)
    <f4>   DW_AT_name        : (indirect string, offset: 0xae65d): OTYPER
    <f8>   DW_AT_decl_file   : 5
    <f9>   DW_AT_decl_line   : 577
    <fb>   DW_AT_decl_column : 17
    <fc>   DW_AT_type        : <0xc1>
    <100>   DW_AT_data_member_location: 4
 <2><101>: Abbrev Number: 10 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0xc3f32): OSPEEDR
    <106>   DW_AT_decl_file   : 5
    <107>   DW_AT_decl_line   : 578
    <109>   DW_AT_decl_column : 17
    <10a>   DW_AT_type        : <0xc1>
    <10e>   DW_AT_data_member_location: 8
 <2><10f>: Abbrev Number: 10 (DW_TAG_member)
    <110>   DW_AT_name        : (indirect string, offset: 0x91ec2): PUPDR
    <114>   DW_AT_decl_file   : 5
    <115>   DW_AT_decl_line   : 579
    <117>   DW_AT_decl_column : 17
    <118>   DW_AT_type        : <0xc1>
    <11c>   DW_AT_data_member_location: 12
 <2><11d>: Abbrev Number: 11 (DW_TAG_member)
    <11e>   DW_AT_name        : IDR
    <122>   DW_AT_decl_file   : 5
    <123>   DW_AT_decl_line   : 580
    <125>   DW_AT_decl_column : 17
    <126>   DW_AT_type        : <0xc1>
    <12a>   DW_AT_data_member_location: 16
 <2><12b>: Abbrev Number: 11 (DW_TAG_member)
    <12c>   DW_AT_name        : ODR
    <130>   DW_AT_decl_file   : 5
    <131>   DW_AT_decl_line   : 581
    <133>   DW_AT_decl_column : 17
    <134>   DW_AT_type        : <0xc1>
    <138>   DW_AT_data_member_location: 20
 <2><139>: Abbrev Number: 10 (DW_TAG_member)
    <13a>   DW_AT_name        : (indirect string, offset: 0x330d0): BSRR
    <13e>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 582
    <141>   DW_AT_decl_column : 17
    <142>   DW_AT_type        : <0xc1>
    <146>   DW_AT_data_member_location: 24
 <2><147>: Abbrev Number: 10 (DW_TAG_member)
    <148>   DW_AT_name        : (indirect string, offset: 0xc132b): LCKR
    <14c>   DW_AT_decl_file   : 5
    <14d>   DW_AT_decl_line   : 583
    <14f>   DW_AT_decl_column : 17
    <150>   DW_AT_type        : <0xc1>
    <154>   DW_AT_data_member_location: 28
 <2><155>: Abbrev Number: 11 (DW_TAG_member)
    <156>   DW_AT_name        : AFR
    <15a>   DW_AT_decl_file   : 5
    <15b>   DW_AT_decl_line   : 584
    <15d>   DW_AT_decl_column : 17
    <15e>   DW_AT_type        : <0xd6>
    <162>   DW_AT_data_member_location: 32
 <2><163>: Abbrev Number: 0
 <1><164>: Abbrev Number: 12 (DW_TAG_typedef)
    <165>   DW_AT_name        : (indirect string, offset: 0xdb228): GPIO_TypeDef
    <169>   DW_AT_decl_file   : 5
    <16a>   DW_AT_decl_line   : 585
    <16c>   DW_AT_decl_column : 3
    <16d>   DW_AT_type        : <0xdb>
 <1><171>: Abbrev Number: 2 (DW_TAG_base_type)
    <172>   DW_AT_byte_size   : 8
    <173>   DW_AT_encoding    : 4	(float)
    <174>   DW_AT_name        : (indirect string, offset: 0xe238e): long double
 <1><178>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <179>   DW_AT_encoding    : 7	(unsigned)
    <17a>   DW_AT_byte_size   : 1
    <17b>   DW_AT_type        : <0x3c>
    <17f>   DW_AT_decl_file   : 6
    <180>   DW_AT_decl_line   : 68
    <181>   DW_AT_decl_column : 1
    <182>   DW_AT_sibling     : <0x193>
 <2><186>: Abbrev Number: 14 (DW_TAG_enumerator)
    <187>   DW_AT_name        : (indirect string, offset: 0x2ee2b): GPIO_PIN_RESET
    <18b>   DW_AT_const_value : 0
 <2><18c>: Abbrev Number: 14 (DW_TAG_enumerator)
    <18d>   DW_AT_name        : (indirect string, offset: 0x390a8): GPIO_PIN_SET
    <191>   DW_AT_const_value : 1
 <2><192>: Abbrev Number: 0
 <1><193>: Abbrev Number: 3 (DW_TAG_typedef)
    <194>   DW_AT_name        : (indirect string, offset: 0xddbde): GPIO_PinState
    <198>   DW_AT_decl_file   : 6
    <199>   DW_AT_decl_line   : 71
    <19a>   DW_AT_decl_column : 2
    <19b>   DW_AT_type        : <0x178>
 <1><19f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1a0>   DW_AT_byte_size   : 4
 <1><1a1>: Abbrev Number: 5 (DW_TAG_const_type)
    <1a2>   DW_AT_type        : <0x19f>
 <1><1a6>: Abbrev Number: 3 (DW_TAG_typedef)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x6abf8): TaskFunction_t
    <1ab>   DW_AT_decl_file   : 7
    <1ac>   DW_AT_decl_line   : 35
    <1ad>   DW_AT_decl_column : 16
    <1ae>   DW_AT_type        : <0x1b2>
 <1><1b2>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1b3>   DW_AT_byte_size   : 4
    <1b4>   DW_AT_type        : <0x1b8>
 <1><1b8>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <1b9>   DW_AT_prototyped  : 1
    <1b9>   DW_AT_sibling     : <0x1c3>
 <2><1bd>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <1be>   DW_AT_type        : <0x19f>
 <2><1c2>: Abbrev Number: 0
 <1><1c3>: Abbrev Number: 3 (DW_TAG_typedef)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x171c): BaseType_t
    <1c8>   DW_AT_decl_file   : 2
    <1c9>   DW_AT_decl_line   : 56
    <1ca>   DW_AT_decl_column : 14
    <1cb>   DW_AT_type        : <0x5d>
 <1><1cf>: Abbrev Number: 3 (DW_TAG_typedef)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x171b): UBaseType_t
    <1d4>   DW_AT_decl_file   : 2
    <1d5>   DW_AT_decl_line   : 57
    <1d6>   DW_AT_decl_column : 23
    <1d7>   DW_AT_type        : <0x70>
 <1><1db>: Abbrev Number: 5 (DW_TAG_const_type)
    <1dc>   DW_AT_type        : <0x1cf>
 <1><1e0>: Abbrev Number: 3 (DW_TAG_typedef)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x173c1): TickType_t
    <1e5>   DW_AT_decl_file   : 2
    <1e6>   DW_AT_decl_line   : 63
    <1e7>   DW_AT_decl_column : 19
    <1e8>   DW_AT_type        : <0xb5>
 <1><1ec>: Abbrev Number: 2 (DW_TAG_base_type)
    <1ed>   DW_AT_byte_size   : 1
    <1ee>   DW_AT_encoding    : 8	(unsigned char)
    <1ef>   DW_AT_name        : (indirect string, offset: 0x11d3f): char
 <1><1f3>: Abbrev Number: 5 (DW_TAG_const_type)
    <1f4>   DW_AT_type        : <0x1ec>
 <1><1f8>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <1f9>   DW_AT_byte_size   : 4
    <1fa>   DW_AT_type        : <0x1f3>
 <1><1fe>: Abbrev Number: 5 (DW_TAG_const_type)
    <1ff>   DW_AT_type        : <0x1f8>
 <1><203>: Abbrev Number: 3 (DW_TAG_typedef)
    <204>   DW_AT_name        : (indirect string, offset: 0x5bb75): TaskHandle_t
    <208>   DW_AT_decl_file   : 8
    <209>   DW_AT_decl_line   : 70
    <20a>   DW_AT_decl_column : 37
    <20b>   DW_AT_type        : <0x20f>
 <1><20f>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <210>   DW_AT_byte_size   : 4
    <211>   DW_AT_type        : <0x215>
 <1><215>: Abbrev Number: 19 (DW_TAG_structure_type)
    <216>   DW_AT_name        : (indirect string, offset: 0xbf904): tskTaskControlBlock
    <21a>   DW_AT_declaration : 1
 <1><21a>: Abbrev Number: 3 (DW_TAG_typedef)
    <21b>   DW_AT_name        : (indirect string, offset: 0x50d64): QueueHandle_t
    <21f>   DW_AT_decl_file   : 9
    <220>   DW_AT_decl_line   : 48
    <221>   DW_AT_decl_column : 34
    <222>   DW_AT_type        : <0x226>
 <1><226>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <227>   DW_AT_byte_size   : 4
    <228>   DW_AT_type        : <0x22c>
 <1><22c>: Abbrev Number: 19 (DW_TAG_structure_type)
    <22d>   DW_AT_name        : (indirect string, offset: 0x957e2): QueueDefinition
    <231>   DW_AT_declaration : 1
 <1><231>: Abbrev Number: 3 (DW_TAG_typedef)
    <232>   DW_AT_name        : (indirect string, offset: 0x13ec7): SemaphoreHandle_t
    <236>   DW_AT_decl_file   : 10
    <237>   DW_AT_decl_line   : 37
    <238>   DW_AT_decl_column : 23
    <239>   DW_AT_type        : <0x21a>
 <1><23d>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <23e>   DW_AT_name        : (indirect string, offset: 0xa7d3): ledFlag_e
    <242>   DW_AT_encoding    : 7	(unsigned)
    <243>   DW_AT_byte_size   : 1
    <244>   DW_AT_type        : <0x3c>
    <248>   DW_AT_decl_file   : 11
    <249>   DW_AT_decl_line   : 59
    <24a>   DW_AT_decl_column : 14
    <24b>   DW_AT_sibling     : <0x25c>
 <2><24f>: Abbrev Number: 14 (DW_TAG_enumerator)
    <250>   DW_AT_name        : (indirect string, offset: 0xa61c6): Blinking
    <254>   DW_AT_const_value : 0
 <2><255>: Abbrev Number: 14 (DW_TAG_enumerator)
    <256>   DW_AT_name        : (indirect string, offset: 0xa61c3): NotBlinking
    <25a>   DW_AT_const_value : 1
 <2><25b>: Abbrev Number: 0
 <1><25c>: Abbrev Number: 3 (DW_TAG_typedef)
    <25d>   DW_AT_name        : (indirect string, offset: 0x14f3d): ledFlag_t
    <261>   DW_AT_decl_file   : 11
    <262>   DW_AT_decl_line   : 59
    <263>   DW_AT_decl_column : 49
    <264>   DW_AT_type        : <0x23d>
 <1><268>: Abbrev Number: 21 (DW_TAG_structure_type)
    <269>   DW_AT_byte_size   : 12
    <26a>   DW_AT_decl_file   : 11
    <26b>   DW_AT_decl_line   : 61
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_sibling     : <0x2b3>
 <2><271>: Abbrev Number: 22 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x5e006): LDX_GPIO_Port
    <276>   DW_AT_decl_file   : 11
    <277>   DW_AT_decl_line   : 63
    <278>   DW_AT_decl_column : 16
    <279>   DW_AT_type        : <0x2b3>
    <27d>   DW_AT_data_member_location: 0
 <2><27e>: Abbrev Number: 22 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0x3b523): LDX_Pin
    <283>   DW_AT_decl_file   : 11
    <284>   DW_AT_decl_line   : 64
    <285>   DW_AT_decl_column : 12
    <286>   DW_AT_type        : <0xa4>
    <28a>   DW_AT_data_member_location: 4
 <2><28b>: Abbrev Number: 22 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x238b6): ledState
    <290>   DW_AT_decl_file   : 11
    <291>   DW_AT_decl_line   : 65
    <292>   DW_AT_decl_column : 16
    <293>   DW_AT_type        : <0x193>
    <297>   DW_AT_data_member_location: 6
 <2><298>: Abbrev Number: 22 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0xca93a): ledFlag
    <29d>   DW_AT_decl_file   : 11
    <29e>   DW_AT_decl_line   : 66
    <29f>   DW_AT_decl_column : 13
    <2a0>   DW_AT_type        : <0x25c>
    <2a4>   DW_AT_data_member_location: 7
 <2><2a5>: Abbrev Number: 22 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x7c131): ledTickCnt
    <2aa>   DW_AT_decl_file   : 11
    <2ab>   DW_AT_decl_line   : 67
    <2ac>   DW_AT_decl_column : 15
    <2ad>   DW_AT_type        : <0x1e0>
    <2b1>   DW_AT_data_member_location: 8
 <2><2b2>: Abbrev Number: 0
 <1><2b3>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <2b4>   DW_AT_byte_size   : 4
    <2b5>   DW_AT_type        : <0x164>
 <1><2b9>: Abbrev Number: 3 (DW_TAG_typedef)
    <2ba>   DW_AT_name        : (indirect string, offset: 0xb87df): LDX_Config_t
    <2be>   DW_AT_decl_file   : 11
    <2bf>   DW_AT_decl_line   : 68
    <2c0>   DW_AT_decl_column : 3
    <2c1>   DW_AT_type        : <0x268>
 <1><2c5>: Abbrev Number: 7 (DW_TAG_array_type)
    <2c6>   DW_AT_type        : <0x2b9>
    <2ca>   DW_AT_sibling     : <0x2d0>
 <2><2ce>: Abbrev Number: 23 (DW_TAG_subrange_type)
 <2><2cf>: Abbrev Number: 0
 <1><2d0>: Abbrev Number: 24 (DW_TAG_variable)
    <2d1>   DW_AT_name        : (indirect string, offset: 0x35): LDX_Config
    <2d5>   DW_AT_decl_file   : 11
    <2d6>   DW_AT_decl_line   : 70
    <2d7>   DW_AT_decl_column : 21
    <2d8>   DW_AT_type        : <0x2c5>
    <2dc>   DW_AT_external    : 1
    <2dc>   DW_AT_declaration : 1
 <1><2dc>: Abbrev Number: 25 (DW_TAG_variable)
    <2dd>   DW_AT_name        : (indirect string, offset: 0x48274): xTaskButtonHandle
    <2e1>   DW_AT_decl_file   : 1
    <2e2>   DW_AT_decl_line   : 72
    <2e3>   DW_AT_decl_column : 14
    <2e4>   DW_AT_type        : <0x203>
    <2e8>   DW_AT_external    : 1
    <2e8>   DW_AT_location    : 5 byte block: 3 cc 0 0 20 	(DW_OP_addr: 200000cc)
 <1><2ee>: Abbrev Number: 25 (DW_TAG_variable)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x6eeb8): xTaskLedHandle
    <2f3>   DW_AT_decl_file   : 1
    <2f4>   DW_AT_decl_line   : 73
    <2f5>   DW_AT_decl_column : 14
    <2f6>   DW_AT_type        : <0x203>
    <2fa>   DW_AT_external    : 1
    <2fa>   DW_AT_location    : 5 byte block: 3 d0 0 0 20 	(DW_OP_addr: 200000d0)
 <1><300>: Abbrev Number: 25 (DW_TAG_variable)
    <301>   DW_AT_name        : (indirect string, offset: 0x33c51): mi_semaforo
    <305>   DW_AT_decl_file   : 1
    <306>   DW_AT_decl_line   : 78
    <307>   DW_AT_decl_column : 19
    <308>   DW_AT_type        : <0x231>
    <30c>   DW_AT_external    : 1
    <30c>   DW_AT_location    : 5 byte block: 3 d4 0 0 20 	(DW_OP_addr: 200000d4)
 <1><312>: Abbrev Number: 25 (DW_TAG_variable)
    <313>   DW_AT_name        : (indirect string, offset: 0x4db36): pcTextForMain
    <317>   DW_AT_decl_file   : 1
    <318>   DW_AT_decl_line   : 82
    <319>   DW_AT_decl_column : 13
    <31a>   DW_AT_type        : <0x1f8>
    <31e>   DW_AT_external    : 1
    <31e>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><324>: Abbrev Number: 26 (DW_TAG_subprogram)
    <325>   DW_AT_external    : 1
    <325>   DW_AT_name        : (indirect string, offset: 0x829c8): vTaskButton
    <329>   DW_AT_decl_file   : 12
    <32a>   DW_AT_decl_line   : 62
    <32b>   DW_AT_decl_column : 6
    <32c>   DW_AT_prototyped  : 1
    <32c>   DW_AT_declaration : 1
    <32c>   DW_AT_sibling     : <0x336>
 <2><330>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <331>   DW_AT_type        : <0x19f>
 <2><335>: Abbrev Number: 0
 <1><336>: Abbrev Number: 26 (DW_TAG_subprogram)
    <337>   DW_AT_external    : 1
    <337>   DW_AT_name        : (indirect string, offset: 0xbf480): vTaskLed
    <33b>   DW_AT_decl_file   : 11
    <33c>   DW_AT_decl_line   : 74
    <33d>   DW_AT_decl_column : 6
    <33e>   DW_AT_prototyped  : 1
    <33e>   DW_AT_declaration : 1
    <33e>   DW_AT_sibling     : <0x348>
 <2><342>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <343>   DW_AT_type        : <0x19f>
 <2><347>: Abbrev Number: 0
 <1><348>: Abbrev Number: 27 (DW_TAG_subprogram)
    <349>   DW_AT_external    : 1
    <349>   DW_AT_name        : (indirect string, offset: 0x88739): xTaskCreate
    <34d>   DW_AT_decl_file   : 8
    <34e>   DW_AT_decl_line   : 330
    <350>   DW_AT_decl_column : 13
    <351>   DW_AT_prototyped  : 1
    <351>   DW_AT_type        : <0x1c3>
    <355>   DW_AT_declaration : 1
    <355>   DW_AT_sibling     : <0x378>
 <2><359>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <35a>   DW_AT_type        : <0x1a6>
 <2><35e>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <35f>   DW_AT_type        : <0x1fe>
 <2><363>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <364>   DW_AT_type        : <0xb0>
 <2><368>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <369>   DW_AT_type        : <0x1a1>
 <2><36d>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <36e>   DW_AT_type        : <0x1cf>
 <2><372>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <373>   DW_AT_type        : <0x37e>
 <2><377>: Abbrev Number: 0
 <1><378>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <379>   DW_AT_byte_size   : 4
    <37a>   DW_AT_type        : <0x203>
 <1><37e>: Abbrev Number: 5 (DW_TAG_const_type)
    <37f>   DW_AT_type        : <0x378>
 <1><383>: Abbrev Number: 27 (DW_TAG_subprogram)
    <384>   DW_AT_external    : 1
    <384>   DW_AT_name        : (indirect string, offset: 0xc6f66): xQueueGenericCreate
    <388>   DW_AT_decl_file   : 9
    <389>   DW_AT_decl_line   : 1496
    <38b>   DW_AT_decl_column : 16
    <38c>   DW_AT_prototyped  : 1
    <38c>   DW_AT_type        : <0x21a>
    <390>   DW_AT_declaration : 1
    <390>   DW_AT_sibling     : <0x3a4>
 <2><394>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <395>   DW_AT_type        : <0x1db>
 <2><399>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <39a>   DW_AT_type        : <0x1db>
 <2><39e>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <39f>   DW_AT_type        : <0x9f>
 <2><3a3>: Abbrev Number: 0
 <1><3a4>: Abbrev Number: 26 (DW_TAG_subprogram)
    <3a5>   DW_AT_external    : 1
    <3a5>   DW_AT_name        : (indirect string, offset: 0x887c0): vPrintString
    <3a9>   DW_AT_decl_file   : 13
    <3aa>   DW_AT_decl_line   : 74
    <3ab>   DW_AT_decl_column : 6
    <3ac>   DW_AT_prototyped  : 1
    <3ac>   DW_AT_declaration : 1
    <3ac>   DW_AT_sibling     : <0x3b6>
 <2><3b0>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <3b1>   DW_AT_type        : <0x1f8>
 <2><3b5>: Abbrev Number: 0
 <1><3b6>: Abbrev Number: 28 (DW_TAG_subprogram)
    <3b7>   DW_AT_external    : 1
    <3b7>   DW_AT_name        : (indirect string, offset: 0xb5e26): appInit
    <3bb>   DW_AT_decl_file   : 1
    <3bc>   DW_AT_decl_line   : 93
    <3bd>   DW_AT_decl_column : 6
    <3be>   DW_AT_prototyped  : 1
    <3be>   DW_AT_low_pc      : 0x8000594
    <3c2>   DW_AT_high_pc     : 0xdc
    <3c6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3c8>   DW_AT_GNU_all_tail_call_sites: 1
    <3c8>   DW_AT_sibling     : <0x43e>
 <2><3cc>: Abbrev Number: 29 (DW_TAG_variable)
    <3cd>   DW_AT_name        : ptr
    <3d1>   DW_AT_decl_file   : 1
    <3d2>   DW_AT_decl_line   : 95
    <3d3>   DW_AT_decl_column : 16
    <3d4>   DW_AT_type        : <0x43e>
    <3d8>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><3db>: Abbrev Number: 29 (DW_TAG_variable)
    <3dc>   DW_AT_name        : ret
    <3e0>   DW_AT_decl_file   : 1
    <3e1>   DW_AT_decl_line   : 96
    <3e2>   DW_AT_decl_column : 13
    <3e3>   DW_AT_type        : <0x1c3>
    <3e7>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><3ea>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <3eb>   DW_AT_abstract_origin: <0x444>
    <3ef>   DW_AT_low_pc      : 0x80005bc
    <3f3>   DW_AT_high_pc     : 0x14
    <3f7>   DW_AT_call_file   : 1
    <3f8>   DW_AT_call_line   : 107
    <3f9>   DW_AT_call_column : 2
    <3fa>   DW_AT_sibling     : <0x407>
 <3><3fe>: Abbrev Number: 31 (DW_TAG_variable)
    <3ff>   DW_AT_abstract_origin: <0x44d>
    <403>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><406>: Abbrev Number: 0
 <2><407>: Abbrev Number: 30 (DW_TAG_inlined_subroutine)
    <408>   DW_AT_abstract_origin: <0x444>
    <40c>   DW_AT_low_pc      : 0x80005f4
    <410>   DW_AT_high_pc     : 0x14
    <414>   DW_AT_call_file   : 1
    <415>   DW_AT_call_line   : 119
    <416>   DW_AT_call_column : 2
    <417>   DW_AT_sibling     : <0x424>
 <3><41b>: Abbrev Number: 31 (DW_TAG_variable)
    <41c>   DW_AT_abstract_origin: <0x44d>
    <420>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><423>: Abbrev Number: 0
 <2><424>: Abbrev Number: 32 (DW_TAG_inlined_subroutine)
    <425>   DW_AT_abstract_origin: <0x444>
    <429>   DW_AT_low_pc      : 0x800062c
    <42d>   DW_AT_high_pc     : 0x14
    <431>   DW_AT_call_file   : 1
    <432>   DW_AT_call_line   : 131
    <433>   DW_AT_call_column : 2
 <3><434>: Abbrev Number: 31 (DW_TAG_variable)
    <435>   DW_AT_abstract_origin: <0x44d>
    <439>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><43c>: Abbrev Number: 0
 <2><43d>: Abbrev Number: 0
 <1><43e>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <43f>   DW_AT_byte_size   : 4
    <440>   DW_AT_type        : <0x2b9>
 <1><444>: Abbrev Number: 33 (DW_TAG_subprogram)
    <445>   DW_AT_name        : (indirect string, offset: 0xc0d37): vPortRaiseBASEPRI
    <449>   DW_AT_decl_file   : 2
    <44a>   DW_AT_decl_line   : 191
    <44b>   DW_AT_decl_column : 30
    <44c>   DW_AT_prototyped  : 1
    <44c>   DW_AT_inline      : 3	(declared as inline and inlined)
 <2><44d>: Abbrev Number: 34 (DW_TAG_variable)
    <44e>   DW_AT_name        : (indirect string, offset: 0xcc14e): ulNewBASEPRI
    <452>   DW_AT_decl_file   : 2
    <453>   DW_AT_decl_line   : 193
    <454>   DW_AT_decl_column : 10
    <455>   DW_AT_type        : <0xb5>
 <2><459>: Abbrev Number: 0
 <1><45a>: Abbrev Number: 0
  Compilation Unit @ offset 0x45b:
   Length:        0x322 (32-bit)
   Version:       4
   Abbrev Offset: 0x1e7
   Pointer Size:  4
 <0><466>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <467>   DW_AT_producer    : (indirect string, offset: 0xb9ee4): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <46b>   DW_AT_language    : 12	(ANSI C99)
    <46c>   DW_AT_name        : (indirect string, offset: 0xe26ee): ../App/Src/task_Button.c
    <470>   DW_AT_comp_dir    : (indirect string, offset: 0x31da1): C:/Users/ipave/Documentos/GitHub/RTOSI/freertos_app_Example5_6/Debug
    <474>   DW_AT_ranges      : 0x10
    <478>   DW_AT_low_pc      : 0x0
    <47c>   DW_AT_stmt_list   : 0xc17
    <480>   DW_AT_GNU_macros  : 0x2405d
 <1><484>: Abbrev Number: 2 (DW_TAG_base_type)
    <485>   DW_AT_byte_size   : 1
    <486>   DW_AT_encoding    : 6	(signed char)
    <487>   DW_AT_name        : (indirect string, offset: 0x70f2b): signed char
 <1><48b>: Abbrev Number: 2 (DW_TAG_base_type)
    <48c>   DW_AT_byte_size   : 1
    <48d>   DW_AT_encoding    : 8	(unsigned char)
    <48e>   DW_AT_name        : (indirect string, offset: 0xd9c35): unsigned char
 <1><492>: Abbrev Number: 2 (DW_TAG_base_type)
    <493>   DW_AT_byte_size   : 2
    <494>   DW_AT_encoding    : 5	(signed)
    <495>   DW_AT_name        : (indirect string, offset: 0xa80e9): short int
 <1><499>: Abbrev Number: 3 (DW_TAG_typedef)
    <49a>   DW_AT_name        : (indirect string, offset: 0xb7e2b): __uint16_t
    <49e>   DW_AT_decl_file   : 2
    <49f>   DW_AT_decl_line   : 57
    <4a0>   DW_AT_decl_column : 25
    <4a1>   DW_AT_type        : <0x4a5>
 <1><4a5>: Abbrev Number: 2 (DW_TAG_base_type)
    <4a6>   DW_AT_byte_size   : 2
    <4a7>   DW_AT_encoding    : 7	(unsigned)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xd83db): short unsigned int
 <1><4ac>: Abbrev Number: 2 (DW_TAG_base_type)
    <4ad>   DW_AT_byte_size   : 4
    <4ae>   DW_AT_encoding    : 5	(signed)
    <4af>   DW_AT_name        : (indirect string, offset: 0x13308): long int
 <1><4b3>: Abbrev Number: 3 (DW_TAG_typedef)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x8fd65): __uint32_t
    <4b8>   DW_AT_decl_file   : 2
    <4b9>   DW_AT_decl_line   : 79
    <4ba>   DW_AT_decl_column : 25
    <4bb>   DW_AT_type        : <0x4bf>
 <1><4bf>: Abbrev Number: 2 (DW_TAG_base_type)
    <4c0>   DW_AT_byte_size   : 4
    <4c1>   DW_AT_encoding    : 7	(unsigned)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x56588): long unsigned int
 <1><4c6>: Abbrev Number: 2 (DW_TAG_base_type)
    <4c7>   DW_AT_byte_size   : 8
    <4c8>   DW_AT_encoding    : 5	(signed)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x66ce1): long long int
 <1><4cd>: Abbrev Number: 2 (DW_TAG_base_type)
    <4ce>   DW_AT_byte_size   : 8
    <4cf>   DW_AT_encoding    : 7	(unsigned)
    <4d0>   DW_AT_name        : (indirect string, offset: 0x2f4d0): long long unsigned int
 <1><4d4>: Abbrev Number: 4 (DW_TAG_base_type)
    <4d5>   DW_AT_byte_size   : 4
    <4d6>   DW_AT_encoding    : 5	(signed)
    <4d7>   DW_AT_name        : int
 <1><4db>: Abbrev Number: 2 (DW_TAG_base_type)
    <4dc>   DW_AT_byte_size   : 4
    <4dd>   DW_AT_encoding    : 7	(unsigned)
    <4de>   DW_AT_name        : (indirect string, offset: 0x127bb): unsigned int
 <1><4e2>: Abbrev Number: 3 (DW_TAG_typedef)
    <4e3>   DW_AT_name        : (indirect string, offset: 0xa481b): uint16_t
    <4e7>   DW_AT_decl_file   : 3
    <4e8>   DW_AT_decl_line   : 36
    <4e9>   DW_AT_decl_column : 20
    <4ea>   DW_AT_type        : <0x499>
 <1><4ee>: Abbrev Number: 3 (DW_TAG_typedef)
    <4ef>   DW_AT_name        : (indirect string, offset: 0xd7f27): uint32_t
    <4f3>   DW_AT_decl_file   : 3
    <4f4>   DW_AT_decl_line   : 48
    <4f5>   DW_AT_decl_column : 20
    <4f6>   DW_AT_type        : <0x4b3>
 <1><4fa>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <4fb>   DW_AT_type        : <0x4ee>
 <1><4ff>: Abbrev Number: 6 (DW_TAG_array_type)
    <500>   DW_AT_type        : <0x4fa>
    <504>   DW_AT_sibling     : <0x50f>
 <2><508>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <509>   DW_AT_type        : <0x4db>
    <50d>   DW_AT_upper_bound : 1
 <2><50e>: Abbrev Number: 0
 <1><50f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <510>   DW_AT_type        : <0x4ff>
 <1><514>: Abbrev Number: 8 (DW_TAG_structure_type)
    <515>   DW_AT_byte_size   : 40
    <516>   DW_AT_decl_file   : 4
    <517>   DW_AT_decl_line   : 574
    <519>   DW_AT_decl_column : 9
    <51a>   DW_AT_sibling     : <0x59d>
 <2><51e>: Abbrev Number: 9 (DW_TAG_member)
    <51f>   DW_AT_name        : (indirect string, offset: 0x1595): MODER
    <523>   DW_AT_decl_file   : 4
    <524>   DW_AT_decl_line   : 576
    <526>   DW_AT_decl_column : 17
    <527>   DW_AT_type        : <0x4fa>
    <52b>   DW_AT_data_member_location: 0
 <2><52c>: Abbrev Number: 9 (DW_TAG_member)
    <52d>   DW_AT_name        : (indirect string, offset: 0xae65d): OTYPER
    <531>   DW_AT_decl_file   : 4
    <532>   DW_AT_decl_line   : 577
    <534>   DW_AT_decl_column : 17
    <535>   DW_AT_type        : <0x4fa>
    <539>   DW_AT_data_member_location: 4
 <2><53a>: Abbrev Number: 9 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0xc3f32): OSPEEDR
    <53f>   DW_AT_decl_file   : 4
    <540>   DW_AT_decl_line   : 578
    <542>   DW_AT_decl_column : 17
    <543>   DW_AT_type        : <0x4fa>
    <547>   DW_AT_data_member_location: 8
 <2><548>: Abbrev Number: 9 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0x91ec2): PUPDR
    <54d>   DW_AT_decl_file   : 4
    <54e>   DW_AT_decl_line   : 579
    <550>   DW_AT_decl_column : 17
    <551>   DW_AT_type        : <0x4fa>
    <555>   DW_AT_data_member_location: 12
 <2><556>: Abbrev Number: 10 (DW_TAG_member)
    <557>   DW_AT_name        : IDR
    <55b>   DW_AT_decl_file   : 4
    <55c>   DW_AT_decl_line   : 580
    <55e>   DW_AT_decl_column : 17
    <55f>   DW_AT_type        : <0x4fa>
    <563>   DW_AT_data_member_location: 16
 <2><564>: Abbrev Number: 10 (DW_TAG_member)
    <565>   DW_AT_name        : ODR
    <569>   DW_AT_decl_file   : 4
    <56a>   DW_AT_decl_line   : 581
    <56c>   DW_AT_decl_column : 17
    <56d>   DW_AT_type        : <0x4fa>
    <571>   DW_AT_data_member_location: 20
 <2><572>: Abbrev Number: 9 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0x330d0): BSRR
    <577>   DW_AT_decl_file   : 4
    <578>   DW_AT_decl_line   : 582
    <57a>   DW_AT_decl_column : 17
    <57b>   DW_AT_type        : <0x4fa>
    <57f>   DW_AT_data_member_location: 24
 <2><580>: Abbrev Number: 9 (DW_TAG_member)
    <581>   DW_AT_name        : (indirect string, offset: 0xc132b): LCKR
    <585>   DW_AT_decl_file   : 4
    <586>   DW_AT_decl_line   : 583
    <588>   DW_AT_decl_column : 17
    <589>   DW_AT_type        : <0x4fa>
    <58d>   DW_AT_data_member_location: 28
 <2><58e>: Abbrev Number: 10 (DW_TAG_member)
    <58f>   DW_AT_name        : AFR
    <593>   DW_AT_decl_file   : 4
    <594>   DW_AT_decl_line   : 584
    <596>   DW_AT_decl_column : 17
    <597>   DW_AT_type        : <0x50f>
    <59b>   DW_AT_data_member_location: 32
 <2><59c>: Abbrev Number: 0
 <1><59d>: Abbrev Number: 11 (DW_TAG_typedef)
    <59e>   DW_AT_name        : (indirect string, offset: 0xdb228): GPIO_TypeDef
    <5a2>   DW_AT_decl_file   : 4
    <5a3>   DW_AT_decl_line   : 585
    <5a5>   DW_AT_decl_column : 3
    <5a6>   DW_AT_type        : <0x514>
 <1><5aa>: Abbrev Number: 2 (DW_TAG_base_type)
    <5ab>   DW_AT_byte_size   : 8
    <5ac>   DW_AT_encoding    : 4	(float)
    <5ad>   DW_AT_name        : (indirect string, offset: 0xe238e): long double
 <1><5b1>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <5b2>   DW_AT_encoding    : 7	(unsigned)
    <5b3>   DW_AT_byte_size   : 1
    <5b4>   DW_AT_type        : <0x48b>
    <5b8>   DW_AT_decl_file   : 5
    <5b9>   DW_AT_decl_line   : 68
    <5ba>   DW_AT_decl_column : 1
    <5bb>   DW_AT_sibling     : <0x5cc>
 <2><5bf>: Abbrev Number: 13 (DW_TAG_enumerator)
    <5c0>   DW_AT_name        : (indirect string, offset: 0x2ee2b): GPIO_PIN_RESET
    <5c4>   DW_AT_const_value : 0
 <2><5c5>: Abbrev Number: 13 (DW_TAG_enumerator)
    <5c6>   DW_AT_name        : (indirect string, offset: 0x390a8): GPIO_PIN_SET
    <5ca>   DW_AT_const_value : 1
 <2><5cb>: Abbrev Number: 0
 <1><5cc>: Abbrev Number: 3 (DW_TAG_typedef)
    <5cd>   DW_AT_name        : (indirect string, offset: 0xddbde): GPIO_PinState
    <5d1>   DW_AT_decl_file   : 5
    <5d2>   DW_AT_decl_line   : 71
    <5d3>   DW_AT_decl_column : 2
    <5d4>   DW_AT_type        : <0x5b1>
 <1><5d8>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <5d9>   DW_AT_byte_size   : 4
 <1><5da>: Abbrev Number: 3 (DW_TAG_typedef)
    <5db>   DW_AT_name        : (indirect string, offset: 0x171c): BaseType_t
    <5df>   DW_AT_decl_file   : 6
    <5e0>   DW_AT_decl_line   : 56
    <5e1>   DW_AT_decl_column : 14
    <5e2>   DW_AT_type        : <0x4ac>
 <1><5e6>: Abbrev Number: 15 (DW_TAG_const_type)
    <5e7>   DW_AT_type        : <0x5da>
 <1><5eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x173c1): TickType_t
    <5f0>   DW_AT_decl_file   : 6
    <5f1>   DW_AT_decl_line   : 63
    <5f2>   DW_AT_decl_column : 19
    <5f3>   DW_AT_type        : <0x4ee>
 <1><5f7>: Abbrev Number: 15 (DW_TAG_const_type)
    <5f8>   DW_AT_type        : <0x5eb>
 <1><5fc>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <5fd>   DW_AT_byte_size   : 4
    <5fe>   DW_AT_type        : <0x602>
 <1><602>: Abbrev Number: 2 (DW_TAG_base_type)
    <603>   DW_AT_byte_size   : 1
    <604>   DW_AT_encoding    : 8	(unsigned char)
    <605>   DW_AT_name        : (indirect string, offset: 0x11d3f): char
 <1><609>: Abbrev Number: 15 (DW_TAG_const_type)
    <60a>   DW_AT_type        : <0x602>
 <1><60e>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <60f>   DW_AT_byte_size   : 4
    <610>   DW_AT_type        : <0x609>
 <1><614>: Abbrev Number: 3 (DW_TAG_typedef)
    <615>   DW_AT_name        : (indirect string, offset: 0x5bb75): TaskHandle_t
    <619>   DW_AT_decl_file   : 7
    <61a>   DW_AT_decl_line   : 70
    <61b>   DW_AT_decl_column : 37
    <61c>   DW_AT_type        : <0x620>
 <1><620>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <621>   DW_AT_byte_size   : 4
    <622>   DW_AT_type        : <0x626>
 <1><626>: Abbrev Number: 17 (DW_TAG_structure_type)
    <627>   DW_AT_name        : (indirect string, offset: 0xbf904): tskTaskControlBlock
    <62b>   DW_AT_declaration : 1
 <1><62b>: Abbrev Number: 3 (DW_TAG_typedef)
    <62c>   DW_AT_name        : (indirect string, offset: 0x50d64): QueueHandle_t
    <630>   DW_AT_decl_file   : 8
    <631>   DW_AT_decl_line   : 48
    <632>   DW_AT_decl_column : 34
    <633>   DW_AT_type        : <0x637>
 <1><637>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <638>   DW_AT_byte_size   : 4
    <639>   DW_AT_type        : <0x63d>
 <1><63d>: Abbrev Number: 17 (DW_TAG_structure_type)
    <63e>   DW_AT_name        : (indirect string, offset: 0x957e2): QueueDefinition
    <642>   DW_AT_declaration : 1
 <1><642>: Abbrev Number: 3 (DW_TAG_typedef)
    <643>   DW_AT_name        : (indirect string, offset: 0x13ec7): SemaphoreHandle_t
    <647>   DW_AT_decl_file   : 9
    <648>   DW_AT_decl_line   : 37
    <649>   DW_AT_decl_column : 23
    <64a>   DW_AT_type        : <0x62b>
 <1><64e>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <64f>   DW_AT_byte_size   : 4
    <650>   DW_AT_type        : <0x659>
 <1><654>: Abbrev Number: 15 (DW_TAG_const_type)
    <655>   DW_AT_type        : <0x64e>
 <1><659>: Abbrev Number: 18 (DW_TAG_const_type)
 <1><65a>: Abbrev Number: 19 (DW_TAG_variable)
    <65b>   DW_AT_name        : (indirect string, offset: 0x33c51): mi_semaforo
    <65f>   DW_AT_decl_file   : 11
    <660>   DW_AT_decl_line   : 65
    <661>   DW_AT_decl_column : 26
    <662>   DW_AT_type        : <0x642>
    <666>   DW_AT_external    : 1
    <666>   DW_AT_declaration : 1
 <1><666>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <667>   DW_AT_name        : (indirect string, offset: 0xa7d3): ledFlag_e
    <66b>   DW_AT_encoding    : 7	(unsigned)
    <66c>   DW_AT_byte_size   : 1
    <66d>   DW_AT_type        : <0x48b>
    <671>   DW_AT_decl_file   : 10
    <672>   DW_AT_decl_line   : 59
    <673>   DW_AT_decl_column : 14
    <674>   DW_AT_sibling     : <0x685>
 <2><678>: Abbrev Number: 13 (DW_TAG_enumerator)
    <679>   DW_AT_name        : (indirect string, offset: 0xa61c6): Blinking
    <67d>   DW_AT_const_value : 0
 <2><67e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <67f>   DW_AT_name        : (indirect string, offset: 0xa61c3): NotBlinking
    <683>   DW_AT_const_value : 1
 <2><684>: Abbrev Number: 0
 <1><685>: Abbrev Number: 3 (DW_TAG_typedef)
    <686>   DW_AT_name        : (indirect string, offset: 0x14f3d): ledFlag_t
    <68a>   DW_AT_decl_file   : 10
    <68b>   DW_AT_decl_line   : 59
    <68c>   DW_AT_decl_column : 49
    <68d>   DW_AT_type        : <0x666>
 <1><691>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <692>   DW_AT_byte_size   : 4
    <693>   DW_AT_type        : <0x59d>
 <1><697>: Abbrev Number: 21 (DW_TAG_variable)
    <698>   DW_AT_name        : (indirect string, offset: 0xe2783): pcTextForTask_BlinkingOn
    <69c>   DW_AT_decl_file   : 1
    <69d>   DW_AT_decl_line   : 76
    <69e>   DW_AT_decl_column : 13
    <69f>   DW_AT_type        : <0x60e>
    <6a3>   DW_AT_external    : 1
    <6a3>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><6a9>: Abbrev Number: 21 (DW_TAG_variable)
    <6aa>   DW_AT_name        : (indirect string, offset: 0xe26d4): pcTextForTask_BlinkingOff
    <6ae>   DW_AT_decl_file   : 1
    <6af>   DW_AT_decl_line   : 77
    <6b0>   DW_AT_decl_column : 13
    <6b1>   DW_AT_type        : <0x60e>
    <6b5>   DW_AT_external    : 1
    <6b5>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><6bb>: Abbrev Number: 22 (DW_TAG_subprogram)
    <6bc>   DW_AT_external    : 1
    <6bc>   DW_AT_name        : (indirect string, offset: 0xe272d): vTaskDelay
    <6c0>   DW_AT_decl_file   : 7
    <6c1>   DW_AT_decl_line   : 758
    <6c3>   DW_AT_decl_column : 6
    <6c4>   DW_AT_prototyped  : 1
    <6c4>   DW_AT_declaration : 1
    <6c4>   DW_AT_sibling     : <0x6ce>
 <2><6c8>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <6c9>   DW_AT_type        : <0x5f7>
 <2><6cd>: Abbrev Number: 0
 <1><6ce>: Abbrev Number: 24 (DW_TAG_subprogram)
    <6cf>   DW_AT_external    : 1
    <6cf>   DW_AT_name        : (indirect string, offset: 0xe2749): xQueueGenericSend
    <6d3>   DW_AT_decl_file   : 8
    <6d4>   DW_AT_decl_line   : 650
    <6d6>   DW_AT_decl_column : 12
    <6d7>   DW_AT_prototyped  : 1
    <6d7>   DW_AT_type        : <0x5da>
    <6db>   DW_AT_declaration : 1
    <6db>   DW_AT_sibling     : <0x6f4>
 <2><6df>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <6e0>   DW_AT_type        : <0x62b>
 <2><6e4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <6e5>   DW_AT_type        : <0x654>
 <2><6e9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <6ea>   DW_AT_type        : <0x5eb>
 <2><6ee>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <6ef>   DW_AT_type        : <0x5e6>
 <2><6f3>: Abbrev Number: 0
 <1><6f4>: Abbrev Number: 25 (DW_TAG_subprogram)
    <6f5>   DW_AT_external    : 1
    <6f5>   DW_AT_name        : (indirect string, offset: 0xe2738): HAL_GPIO_ReadPin
    <6f9>   DW_AT_decl_file   : 5
    <6fa>   DW_AT_decl_line   : 234
    <6fb>   DW_AT_decl_column : 15
    <6fc>   DW_AT_prototyped  : 1
    <6fc>   DW_AT_type        : <0x5cc>
    <700>   DW_AT_declaration : 1
    <700>   DW_AT_sibling     : <0x70f>
 <2><704>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <705>   DW_AT_type        : <0x691>
 <2><709>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <70a>   DW_AT_type        : <0x4e2>
 <2><70e>: Abbrev Number: 0
 <1><70f>: Abbrev Number: 26 (DW_TAG_subprogram)
    <710>   DW_AT_external    : 1
    <710>   DW_AT_name        : (indirect string, offset: 0xe271c): vPrintTwoStrings
    <714>   DW_AT_decl_file   : 12
    <715>   DW_AT_decl_line   : 76
    <716>   DW_AT_decl_column : 6
    <717>   DW_AT_prototyped  : 1
    <717>   DW_AT_declaration : 1
    <717>   DW_AT_sibling     : <0x726>
 <2><71b>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <71c>   DW_AT_type        : <0x60e>
 <2><720>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <721>   DW_AT_type        : <0x60e>
 <2><725>: Abbrev Number: 0
 <1><726>: Abbrev Number: 24 (DW_TAG_subprogram)
    <727>   DW_AT_external    : 1
    <727>   DW_AT_name        : (indirect string, offset: 0x533cd): pcTaskGetName
    <72b>   DW_AT_decl_file   : 7
    <72c>   DW_AT_decl_line   : 1399
    <72e>   DW_AT_decl_column : 7
    <72f>   DW_AT_prototyped  : 1
    <72f>   DW_AT_type        : <0x5fc>
    <733>   DW_AT_declaration : 1
    <733>   DW_AT_sibling     : <0x73d>
 <2><737>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <738>   DW_AT_type        : <0x614>
 <2><73c>: Abbrev Number: 0
 <1><73d>: Abbrev Number: 27 (DW_TAG_subprogram)
    <73e>   DW_AT_external    : 1
    <73e>   DW_AT_name        : (indirect string, offset: 0x829c8): vTaskButton
    <742>   DW_AT_decl_file   : 1
    <743>   DW_AT_decl_line   : 89
    <744>   DW_AT_decl_column : 6
    <745>   DW_AT_prototyped  : 1
    <745>   DW_AT_low_pc      : 0x8000670
    <749>   DW_AT_high_pc     : 0x8c
    <74d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <74f>   DW_AT_GNU_all_tail_call_sites: 1
 <2><74f>: Abbrev Number: 28 (DW_TAG_formal_parameter)
    <750>   DW_AT_name        : (indirect string, offset: 0xe26c7): pvParameters
    <754>   DW_AT_decl_file   : 1
    <755>   DW_AT_decl_line   : 89
    <756>   DW_AT_decl_column : 24
    <757>   DW_AT_type        : <0x5d8>
    <75b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><75e>: Abbrev Number: 29 (DW_TAG_variable)
    <75f>   DW_AT_name        : (indirect string, offset: 0xe2707): ledStatus
    <763>   DW_AT_decl_file   : 1
    <764>   DW_AT_decl_line   : 91
    <765>   DW_AT_decl_column : 19
    <766>   DW_AT_type        : <0x685>
    <76a>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <2><770>: Abbrev Number: 29 (DW_TAG_variable)
    <771>   DW_AT_name        : (indirect string, offset: 0xe2711): pcTaskName
    <775>   DW_AT_decl_file   : 1
    <776>   DW_AT_decl_line   : 93
    <777>   DW_AT_decl_column : 8
    <778>   DW_AT_type        : <0x5fc>
    <77c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><77f>: Abbrev Number: 0
 <1><780>: Abbrev Number: 0
  Compilation Unit @ offset 0x781:
   Length:        0x3cb (32-bit)
   Version:       4
   Abbrev Offset: 0x393
   Pointer Size:  4
 <0><78c>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <78d>   DW_AT_producer    : (indirect string, offset: 0xb9ee4): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <791>   DW_AT_language    : 12	(ANSI C99)
    <792>   DW_AT_name        : (indirect string, offset: 0xe280d): ../App/Src/task_Led.c
    <796>   DW_AT_comp_dir    : (indirect string, offset: 0x31da1): C:/Users/ipave/Documentos/GitHub/RTOSI/freertos_app_Example5_6/Debug
    <79a>   DW_AT_ranges      : 0x20
    <79e>   DW_AT_low_pc      : 0x0
    <7a2>   DW_AT_stmt_list   : 0x1813
    <7a6>   DW_AT_GNU_macros  : 0x24526
 <1><7aa>: Abbrev Number: 2 (DW_TAG_base_type)
    <7ab>   DW_AT_byte_size   : 1
    <7ac>   DW_AT_encoding    : 6	(signed char)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x70f2b): signed char
 <1><7b1>: Abbrev Number: 2 (DW_TAG_base_type)
    <7b2>   DW_AT_byte_size   : 1
    <7b3>   DW_AT_encoding    : 8	(unsigned char)
    <7b4>   DW_AT_name        : (indirect string, offset: 0xd9c35): unsigned char
 <1><7b8>: Abbrev Number: 2 (DW_TAG_base_type)
    <7b9>   DW_AT_byte_size   : 2
    <7ba>   DW_AT_encoding    : 5	(signed)
    <7bb>   DW_AT_name        : (indirect string, offset: 0xa80e9): short int
 <1><7bf>: Abbrev Number: 3 (DW_TAG_typedef)
    <7c0>   DW_AT_name        : (indirect string, offset: 0xb7e2b): __uint16_t
    <7c4>   DW_AT_decl_file   : 2
    <7c5>   DW_AT_decl_line   : 57
    <7c6>   DW_AT_decl_column : 25
    <7c7>   DW_AT_type        : <0x7cb>
 <1><7cb>: Abbrev Number: 2 (DW_TAG_base_type)
    <7cc>   DW_AT_byte_size   : 2
    <7cd>   DW_AT_encoding    : 7	(unsigned)
    <7ce>   DW_AT_name        : (indirect string, offset: 0xd83db): short unsigned int
 <1><7d2>: Abbrev Number: 2 (DW_TAG_base_type)
    <7d3>   DW_AT_byte_size   : 4
    <7d4>   DW_AT_encoding    : 5	(signed)
    <7d5>   DW_AT_name        : (indirect string, offset: 0x13308): long int
 <1><7d9>: Abbrev Number: 3 (DW_TAG_typedef)
    <7da>   DW_AT_name        : (indirect string, offset: 0x8fd65): __uint32_t
    <7de>   DW_AT_decl_file   : 2
    <7df>   DW_AT_decl_line   : 79
    <7e0>   DW_AT_decl_column : 25
    <7e1>   DW_AT_type        : <0x7e5>
 <1><7e5>: Abbrev Number: 2 (DW_TAG_base_type)
    <7e6>   DW_AT_byte_size   : 4
    <7e7>   DW_AT_encoding    : 7	(unsigned)
    <7e8>   DW_AT_name        : (indirect string, offset: 0x56588): long unsigned int
 <1><7ec>: Abbrev Number: 2 (DW_TAG_base_type)
    <7ed>   DW_AT_byte_size   : 8
    <7ee>   DW_AT_encoding    : 5	(signed)
    <7ef>   DW_AT_name        : (indirect string, offset: 0x66ce1): long long int
 <1><7f3>: Abbrev Number: 2 (DW_TAG_base_type)
    <7f4>   DW_AT_byte_size   : 8
    <7f5>   DW_AT_encoding    : 7	(unsigned)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x2f4d0): long long unsigned int
 <1><7fa>: Abbrev Number: 4 (DW_TAG_base_type)
    <7fb>   DW_AT_byte_size   : 4
    <7fc>   DW_AT_encoding    : 5	(signed)
    <7fd>   DW_AT_name        : int
 <1><801>: Abbrev Number: 2 (DW_TAG_base_type)
    <802>   DW_AT_byte_size   : 4
    <803>   DW_AT_encoding    : 7	(unsigned)
    <804>   DW_AT_name        : (indirect string, offset: 0x127bb): unsigned int
 <1><808>: Abbrev Number: 3 (DW_TAG_typedef)
    <809>   DW_AT_name        : (indirect string, offset: 0xa481b): uint16_t
    <80d>   DW_AT_decl_file   : 3
    <80e>   DW_AT_decl_line   : 36
    <80f>   DW_AT_decl_column : 20
    <810>   DW_AT_type        : <0x7bf>
 <1><814>: Abbrev Number: 3 (DW_TAG_typedef)
    <815>   DW_AT_name        : (indirect string, offset: 0xd7f27): uint32_t
    <819>   DW_AT_decl_file   : 3
    <81a>   DW_AT_decl_line   : 48
    <81b>   DW_AT_decl_column : 20
    <81c>   DW_AT_type        : <0x7d9>
 <1><820>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <821>   DW_AT_type        : <0x814>
 <1><825>: Abbrev Number: 6 (DW_TAG_array_type)
    <826>   DW_AT_type        : <0x820>
    <82a>   DW_AT_sibling     : <0x835>
 <2><82e>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <82f>   DW_AT_type        : <0x801>
    <833>   DW_AT_upper_bound : 1
 <2><834>: Abbrev Number: 0
 <1><835>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <836>   DW_AT_type        : <0x825>
 <1><83a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <83b>   DW_AT_byte_size   : 40
    <83c>   DW_AT_decl_file   : 4
    <83d>   DW_AT_decl_line   : 574
    <83f>   DW_AT_decl_column : 9
    <840>   DW_AT_sibling     : <0x8c3>
 <2><844>: Abbrev Number: 9 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0x1595): MODER
    <849>   DW_AT_decl_file   : 4
    <84a>   DW_AT_decl_line   : 576
    <84c>   DW_AT_decl_column : 17
    <84d>   DW_AT_type        : <0x820>
    <851>   DW_AT_data_member_location: 0
 <2><852>: Abbrev Number: 9 (DW_TAG_member)
    <853>   DW_AT_name        : (indirect string, offset: 0xae65d): OTYPER
    <857>   DW_AT_decl_file   : 4
    <858>   DW_AT_decl_line   : 577
    <85a>   DW_AT_decl_column : 17
    <85b>   DW_AT_type        : <0x820>
    <85f>   DW_AT_data_member_location: 4
 <2><860>: Abbrev Number: 9 (DW_TAG_member)
    <861>   DW_AT_name        : (indirect string, offset: 0xc3f32): OSPEEDR
    <865>   DW_AT_decl_file   : 4
    <866>   DW_AT_decl_line   : 578
    <868>   DW_AT_decl_column : 17
    <869>   DW_AT_type        : <0x820>
    <86d>   DW_AT_data_member_location: 8
 <2><86e>: Abbrev Number: 9 (DW_TAG_member)
    <86f>   DW_AT_name        : (indirect string, offset: 0x91ec2): PUPDR
    <873>   DW_AT_decl_file   : 4
    <874>   DW_AT_decl_line   : 579
    <876>   DW_AT_decl_column : 17
    <877>   DW_AT_type        : <0x820>
    <87b>   DW_AT_data_member_location: 12
 <2><87c>: Abbrev Number: 10 (DW_TAG_member)
    <87d>   DW_AT_name        : IDR
    <881>   DW_AT_decl_file   : 4
    <882>   DW_AT_decl_line   : 580
    <884>   DW_AT_decl_column : 17
    <885>   DW_AT_type        : <0x820>
    <889>   DW_AT_data_member_location: 16
 <2><88a>: Abbrev Number: 10 (DW_TAG_member)
    <88b>   DW_AT_name        : ODR
    <88f>   DW_AT_decl_file   : 4
    <890>   DW_AT_decl_line   : 581
    <892>   DW_AT_decl_column : 17
    <893>   DW_AT_type        : <0x820>
    <897>   DW_AT_data_member_location: 20
 <2><898>: Abbrev Number: 9 (DW_TAG_member)
    <899>   DW_AT_name        : (indirect string, offset: 0x330d0): BSRR
    <89d>   DW_AT_decl_file   : 4
    <89e>   DW_AT_decl_line   : 582
    <8a0>   DW_AT_decl_column : 17
    <8a1>   DW_AT_type        : <0x820>
    <8a5>   DW_AT_data_member_location: 24
 <2><8a6>: Abbrev Number: 9 (DW_TAG_member)
    <8a7>   DW_AT_name        : (indirect string, offset: 0xc132b): LCKR
    <8ab>   DW_AT_decl_file   : 4
    <8ac>   DW_AT_decl_line   : 583
    <8ae>   DW_AT_decl_column : 17
    <8af>   DW_AT_type        : <0x820>
    <8b3>   DW_AT_data_member_location: 28
 <2><8b4>: Abbrev Number: 10 (DW_TAG_member)
    <8b5>   DW_AT_name        : AFR
    <8b9>   DW_AT_decl_file   : 4
    <8ba>   DW_AT_decl_line   : 584
    <8bc>   DW_AT_decl_column : 17
    <8bd>   DW_AT_type        : <0x835>
    <8c1>   DW_AT_data_member_location: 32
 <2><8c2>: Abbrev Number: 0
 <1><8c3>: Abbrev Number: 11 (DW_TAG_typedef)
    <8c4>   DW_AT_name        : (indirect string, offset: 0xdb228): GPIO_TypeDef
    <8c8>   DW_AT_decl_file   : 4
    <8c9>   DW_AT_decl_line   : 585
    <8cb>   DW_AT_decl_column : 3
    <8cc>   DW_AT_type        : <0x83a>
 <1><8d0>: Abbrev Number: 2 (DW_TAG_base_type)
    <8d1>   DW_AT_byte_size   : 8
    <8d2>   DW_AT_encoding    : 4	(float)
    <8d3>   DW_AT_name        : (indirect string, offset: 0xe238e): long double
 <1><8d7>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <8d8>   DW_AT_encoding    : 7	(unsigned)
    <8d9>   DW_AT_byte_size   : 1
    <8da>   DW_AT_type        : <0x7b1>
    <8de>   DW_AT_decl_file   : 5
    <8df>   DW_AT_decl_line   : 68
    <8e0>   DW_AT_decl_column : 1
    <8e1>   DW_AT_sibling     : <0x8f2>
 <2><8e5>: Abbrev Number: 13 (DW_TAG_enumerator)
    <8e6>   DW_AT_name        : (indirect string, offset: 0x2ee2b): GPIO_PIN_RESET
    <8ea>   DW_AT_const_value : 0
 <2><8eb>: Abbrev Number: 13 (DW_TAG_enumerator)
    <8ec>   DW_AT_name        : (indirect string, offset: 0x390a8): GPIO_PIN_SET
    <8f0>   DW_AT_const_value : 1
 <2><8f1>: Abbrev Number: 0
 <1><8f2>: Abbrev Number: 3 (DW_TAG_typedef)
    <8f3>   DW_AT_name        : (indirect string, offset: 0xddbde): GPIO_PinState
    <8f7>   DW_AT_decl_file   : 5
    <8f8>   DW_AT_decl_line   : 71
    <8f9>   DW_AT_decl_column : 2
    <8fa>   DW_AT_type        : <0x8d7>
 <1><8fe>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <8ff>   DW_AT_byte_size   : 4
 <1><900>: Abbrev Number: 3 (DW_TAG_typedef)
    <901>   DW_AT_name        : (indirect string, offset: 0x171c): BaseType_t
    <905>   DW_AT_decl_file   : 6
    <906>   DW_AT_decl_line   : 56
    <907>   DW_AT_decl_column : 14
    <908>   DW_AT_type        : <0x7d2>
 <1><90c>: Abbrev Number: 3 (DW_TAG_typedef)
    <90d>   DW_AT_name        : (indirect string, offset: 0x173c1): TickType_t
    <911>   DW_AT_decl_file   : 6
    <912>   DW_AT_decl_line   : 63
    <913>   DW_AT_decl_column : 19
    <914>   DW_AT_type        : <0x814>
 <1><918>: Abbrev Number: 15 (DW_TAG_const_type)
    <919>   DW_AT_type        : <0x90c>
 <1><91d>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <91e>   DW_AT_byte_size   : 4
    <91f>   DW_AT_type        : <0x923>
 <1><923>: Abbrev Number: 2 (DW_TAG_base_type)
    <924>   DW_AT_byte_size   : 1
    <925>   DW_AT_encoding    : 8	(unsigned char)
    <926>   DW_AT_name        : (indirect string, offset: 0x11d3f): char
 <1><92a>: Abbrev Number: 15 (DW_TAG_const_type)
    <92b>   DW_AT_type        : <0x923>
 <1><92f>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <930>   DW_AT_byte_size   : 4
    <931>   DW_AT_type        : <0x92a>
 <1><935>: Abbrev Number: 3 (DW_TAG_typedef)
    <936>   DW_AT_name        : (indirect string, offset: 0x5bb75): TaskHandle_t
    <93a>   DW_AT_decl_file   : 7
    <93b>   DW_AT_decl_line   : 70
    <93c>   DW_AT_decl_column : 37
    <93d>   DW_AT_type        : <0x941>
 <1><941>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <942>   DW_AT_byte_size   : 4
    <943>   DW_AT_type        : <0x947>
 <1><947>: Abbrev Number: 17 (DW_TAG_structure_type)
    <948>   DW_AT_name        : (indirect string, offset: 0xbf904): tskTaskControlBlock
    <94c>   DW_AT_declaration : 1
 <1><94c>: Abbrev Number: 3 (DW_TAG_typedef)
    <94d>   DW_AT_name        : (indirect string, offset: 0x50d64): QueueHandle_t
    <951>   DW_AT_decl_file   : 8
    <952>   DW_AT_decl_line   : 48
    <953>   DW_AT_decl_column : 34
    <954>   DW_AT_type        : <0x958>
 <1><958>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <959>   DW_AT_byte_size   : 4
    <95a>   DW_AT_type        : <0x95e>
 <1><95e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <95f>   DW_AT_name        : (indirect string, offset: 0x957e2): QueueDefinition
    <963>   DW_AT_declaration : 1
 <1><963>: Abbrev Number: 3 (DW_TAG_typedef)
    <964>   DW_AT_name        : (indirect string, offset: 0x13ec7): SemaphoreHandle_t
    <968>   DW_AT_decl_file   : 9
    <969>   DW_AT_decl_line   : 37
    <96a>   DW_AT_decl_column : 23
    <96b>   DW_AT_type        : <0x94c>
 <1><96f>: Abbrev Number: 18 (DW_TAG_variable)
    <970>   DW_AT_name        : (indirect string, offset: 0x33c51): mi_semaforo
    <974>   DW_AT_decl_file   : 11
    <975>   DW_AT_decl_line   : 65
    <976>   DW_AT_decl_column : 26
    <977>   DW_AT_type        : <0x963>
    <97b>   DW_AT_external    : 1
    <97b>   DW_AT_declaration : 1
 <1><97b>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <97c>   DW_AT_name        : (indirect string, offset: 0xa7d3): ledFlag_e
    <980>   DW_AT_encoding    : 7	(unsigned)
    <981>   DW_AT_byte_size   : 1
    <982>   DW_AT_type        : <0x7b1>
    <986>   DW_AT_decl_file   : 10
    <987>   DW_AT_decl_line   : 59
    <988>   DW_AT_decl_column : 14
    <989>   DW_AT_sibling     : <0x99a>
 <2><98d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <98e>   DW_AT_name        : (indirect string, offset: 0xa61c6): Blinking
    <992>   DW_AT_const_value : 0
 <2><993>: Abbrev Number: 13 (DW_TAG_enumerator)
    <994>   DW_AT_name        : (indirect string, offset: 0xa61c3): NotBlinking
    <998>   DW_AT_const_value : 1
 <2><999>: Abbrev Number: 0
 <1><99a>: Abbrev Number: 3 (DW_TAG_typedef)
    <99b>   DW_AT_name        : (indirect string, offset: 0x14f3d): ledFlag_t
    <99f>   DW_AT_decl_file   : 10
    <9a0>   DW_AT_decl_line   : 59
    <9a1>   DW_AT_decl_column : 49
    <9a2>   DW_AT_type        : <0x97b>
 <1><9a6>: Abbrev Number: 20 (DW_TAG_structure_type)
    <9a7>   DW_AT_byte_size   : 12
    <9a8>   DW_AT_decl_file   : 10
    <9a9>   DW_AT_decl_line   : 61
    <9aa>   DW_AT_decl_column : 9
    <9ab>   DW_AT_sibling     : <0x9f1>
 <2><9af>: Abbrev Number: 21 (DW_TAG_member)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x5e006): LDX_GPIO_Port
    <9b4>   DW_AT_decl_file   : 10
    <9b5>   DW_AT_decl_line   : 63
    <9b6>   DW_AT_decl_column : 16
    <9b7>   DW_AT_type        : <0x9f1>
    <9bb>   DW_AT_data_member_location: 0
 <2><9bc>: Abbrev Number: 21 (DW_TAG_member)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x3b523): LDX_Pin
    <9c1>   DW_AT_decl_file   : 10
    <9c2>   DW_AT_decl_line   : 64
    <9c3>   DW_AT_decl_column : 12
    <9c4>   DW_AT_type        : <0x808>
    <9c8>   DW_AT_data_member_location: 4
 <2><9c9>: Abbrev Number: 21 (DW_TAG_member)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x238b6): ledState
    <9ce>   DW_AT_decl_file   : 10
    <9cf>   DW_AT_decl_line   : 65
    <9d0>   DW_AT_decl_column : 16
    <9d1>   DW_AT_type        : <0x8f2>
    <9d5>   DW_AT_data_member_location: 6
 <2><9d6>: Abbrev Number: 21 (DW_TAG_member)
    <9d7>   DW_AT_name        : (indirect string, offset: 0xca93a): ledFlag
    <9db>   DW_AT_decl_file   : 10
    <9dc>   DW_AT_decl_line   : 66
    <9dd>   DW_AT_decl_column : 13
    <9de>   DW_AT_type        : <0x99a>
    <9e2>   DW_AT_data_member_location: 7
 <2><9e3>: Abbrev Number: 21 (DW_TAG_member)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x7c131): ledTickCnt
    <9e8>   DW_AT_decl_file   : 10
    <9e9>   DW_AT_decl_line   : 67
    <9ea>   DW_AT_decl_column : 15
    <9eb>   DW_AT_type        : <0x90c>
    <9ef>   DW_AT_data_member_location: 8
 <2><9f0>: Abbrev Number: 0
 <1><9f1>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x8c3>
 <1><9f7>: Abbrev Number: 3 (DW_TAG_typedef)
    <9f8>   DW_AT_name        : (indirect string, offset: 0xb87df): LDX_Config_t
    <9fc>   DW_AT_decl_file   : 10
    <9fd>   DW_AT_decl_line   : 68
    <9fe>   DW_AT_decl_column : 3
    <9ff>   DW_AT_type        : <0x9a6>
 <1><a03>: Abbrev Number: 6 (DW_TAG_array_type)
    <a04>   DW_AT_type        : <0x9f7>
    <a08>   DW_AT_sibling     : <0xa0e>
 <2><a0c>: Abbrev Number: 22 (DW_TAG_subrange_type)
 <2><a0d>: Abbrev Number: 0
 <1><a0e>: Abbrev Number: 18 (DW_TAG_variable)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x35): LDX_Config
    <a13>   DW_AT_decl_file   : 10
    <a14>   DW_AT_decl_line   : 70
    <a15>   DW_AT_decl_column : 21
    <a16>   DW_AT_type        : <0xa03>
    <a1a>   DW_AT_external    : 1
    <a1a>   DW_AT_declaration : 1
 <1><a1a>: Abbrev Number: 23 (DW_TAG_variable)
    <a1b>   DW_AT_name        : (indirect string, offset: 0xe27f8): pcTextForTask_LDXTOn
    <a1f>   DW_AT_decl_file   : 1
    <a20>   DW_AT_decl_line   : 75
    <a21>   DW_AT_decl_column : 13
    <a22>   DW_AT_type        : <0x92f>
    <a26>   DW_AT_external    : 1
    <a26>   DW_AT_location    : 5 byte block: 3 10 0 0 20 	(DW_OP_addr: 20000010)
 <1><a2c>: Abbrev Number: 23 (DW_TAG_variable)
    <a2d>   DW_AT_name        : (indirect string, offset: 0xe2855): pcTextForTask_LDXTOff
    <a31>   DW_AT_decl_file   : 1
    <a32>   DW_AT_decl_line   : 76
    <a33>   DW_AT_decl_column : 13
    <a34>   DW_AT_type        : <0x92f>
    <a38>   DW_AT_external    : 1
    <a38>   DW_AT_location    : 5 byte block: 3 14 0 0 20 	(DW_OP_addr: 20000014)
 <1><a3e>: Abbrev Number: 6 (DW_TAG_array_type)
    <a3f>   DW_AT_type        : <0x9f7>
    <a43>   DW_AT_sibling     : <0xa4e>
 <2><a47>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <a48>   DW_AT_type        : <0x801>
    <a4c>   DW_AT_upper_bound : 2
 <2><a4d>: Abbrev Number: 0
 <1><a4e>: Abbrev Number: 24 (DW_TAG_variable)
    <a4f>   DW_AT_specification: <0xa0e>
    <a53>   DW_AT_decl_file   : 1
    <a54>   DW_AT_decl_line   : 80
    <a55>   DW_AT_decl_column : 14
    <a56>   DW_AT_type        : <0xa3e>
    <a5a>   DW_AT_location    : 5 byte block: 3 18 0 0 20 	(DW_OP_addr: 20000018)
 <1><a60>: Abbrev Number: 25 (DW_TAG_subprogram)
    <a61>   DW_AT_external    : 1
    <a61>   DW_AT_name        : (indirect string, offset: 0xe2831): vTaskDelayUntil
    <a65>   DW_AT_decl_file   : 7
    <a66>   DW_AT_decl_line   : 817
    <a68>   DW_AT_decl_column : 6
    <a69>   DW_AT_prototyped  : 1
    <a69>   DW_AT_declaration : 1
    <a69>   DW_AT_sibling     : <0xa78>
 <2><a6d>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a6e>   DW_AT_type        : <0xa7e>
 <2><a72>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a73>   DW_AT_type        : <0x918>
 <2><a77>: Abbrev Number: 0
 <1><a78>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <a79>   DW_AT_byte_size   : 4
    <a7a>   DW_AT_type        : <0x90c>
 <1><a7e>: Abbrev Number: 15 (DW_TAG_const_type)
    <a7f>   DW_AT_type        : <0xa78>
 <1><a83>: Abbrev Number: 27 (DW_TAG_subprogram)
    <a84>   DW_AT_external    : 1
    <a84>   DW_AT_name        : (indirect string, offset: 0xe27e6): HAL_GPIO_WritePin
    <a88>   DW_AT_decl_file   : 5
    <a89>   DW_AT_decl_line   : 235
    <a8a>   DW_AT_decl_column : 6
    <a8b>   DW_AT_prototyped  : 1
    <a8b>   DW_AT_declaration : 1
    <a8b>   DW_AT_sibling     : <0xa9f>
 <2><a8f>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a90>   DW_AT_type        : <0x9f1>
 <2><a94>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a95>   DW_AT_type        : <0x808>
 <2><a99>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <a9a>   DW_AT_type        : <0x8f2>
 <2><a9e>: Abbrev Number: 0
 <1><a9f>: Abbrev Number: 28 (DW_TAG_subprogram)
    <aa0>   DW_AT_external    : 1
    <aa0>   DW_AT_name        : (indirect string, offset: 0xe2841): xQueueSemaphoreTake
    <aa4>   DW_AT_decl_file   : 8
    <aa5>   DW_AT_decl_line   : 1418
    <aa7>   DW_AT_decl_column : 12
    <aa8>   DW_AT_prototyped  : 1
    <aa8>   DW_AT_type        : <0x900>
    <aac>   DW_AT_declaration : 1
    <aac>   DW_AT_sibling     : <0xabb>
 <2><ab0>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ab1>   DW_AT_type        : <0x94c>
 <2><ab5>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ab6>   DW_AT_type        : <0x90c>
 <2><aba>: Abbrev Number: 0
 <1><abb>: Abbrev Number: 27 (DW_TAG_subprogram)
    <abc>   DW_AT_external    : 1
    <abc>   DW_AT_name        : (indirect string, offset: 0xe271c): vPrintTwoStrings
    <ac0>   DW_AT_decl_file   : 12
    <ac1>   DW_AT_decl_line   : 76
    <ac2>   DW_AT_decl_column : 6
    <ac3>   DW_AT_prototyped  : 1
    <ac3>   DW_AT_declaration : 1
    <ac3>   DW_AT_sibling     : <0xad2>
 <2><ac7>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ac8>   DW_AT_type        : <0x92f>
 <2><acc>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <acd>   DW_AT_type        : <0x92f>
 <2><ad1>: Abbrev Number: 0
 <1><ad2>: Abbrev Number: 28 (DW_TAG_subprogram)
    <ad3>   DW_AT_external    : 1
    <ad3>   DW_AT_name        : (indirect string, offset: 0x533cd): pcTaskGetName
    <ad7>   DW_AT_decl_file   : 7
    <ad8>   DW_AT_decl_line   : 1399
    <ada>   DW_AT_decl_column : 7
    <adb>   DW_AT_prototyped  : 1
    <adb>   DW_AT_type        : <0x91d>
    <adf>   DW_AT_declaration : 1
    <adf>   DW_AT_sibling     : <0xae9>
 <2><ae3>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <ae4>   DW_AT_type        : <0x935>
 <2><ae8>: Abbrev Number: 0
 <1><ae9>: Abbrev Number: 29 (DW_TAG_subprogram)
    <aea>   DW_AT_external    : 1
    <aea>   DW_AT_name        : (indirect string, offset: 0xe27af): xTaskGetTickCount
    <aee>   DW_AT_decl_file   : 7
    <aef>   DW_AT_decl_line   : 1356
    <af1>   DW_AT_decl_column : 12
    <af2>   DW_AT_prototyped  : 1
    <af2>   DW_AT_type        : <0x90c>
    <af6>   DW_AT_declaration : 1
 <1><af6>: Abbrev Number: 30 (DW_TAG_subprogram)
    <af7>   DW_AT_external    : 1
    <af7>   DW_AT_name        : (indirect string, offset: 0xbf480): vTaskLed
    <afb>   DW_AT_decl_file   : 1
    <afc>   DW_AT_decl_line   : 92
    <afd>   DW_AT_decl_column : 6
    <afe>   DW_AT_prototyped  : 1
    <afe>   DW_AT_low_pc      : 0x80006fc
    <b02>   DW_AT_high_pc     : 0x90
    <b06>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b08>   DW_AT_GNU_all_tail_call_sites: 1
    <b08>   DW_AT_sibling     : <0xb49>
 <2><b0c>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <b0d>   DW_AT_name        : (indirect string, offset: 0xe26c7): pvParameters
    <b11>   DW_AT_decl_file   : 1
    <b12>   DW_AT_decl_line   : 92
    <b13>   DW_AT_decl_column : 21
    <b14>   DW_AT_type        : <0x8fe>
    <b18>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b1b>: Abbrev Number: 32 (DW_TAG_variable)
    <b1c>   DW_AT_name        : ptr
    <b20>   DW_AT_decl_file   : 1
    <b21>   DW_AT_decl_line   : 94
    <b22>   DW_AT_decl_column : 16
    <b23>   DW_AT_type        : <0xb49>
    <b27>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b2a>: Abbrev Number: 33 (DW_TAG_variable)
    <b2b>   DW_AT_name        : (indirect string, offset: 0xe2823): xLastWakeTime
    <b2f>   DW_AT_decl_file   : 1
    <b30>   DW_AT_decl_line   : 96
    <b31>   DW_AT_decl_column : 13
    <b32>   DW_AT_type        : <0x90c>
    <b36>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b39>: Abbrev Number: 33 (DW_TAG_variable)
    <b3a>   DW_AT_name        : (indirect string, offset: 0xe2711): pcTaskName
    <b3e>   DW_AT_decl_file   : 1
    <b3f>   DW_AT_decl_line   : 102
    <b40>   DW_AT_decl_column : 8
    <b41>   DW_AT_type        : <0x91d>
    <b45>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b48>: Abbrev Number: 0
 <1><b49>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <b4a>   DW_AT_byte_size   : 4
    <b4b>   DW_AT_type        : <0x9f7>
 <1><b4f>: Abbrev Number: 0
  Compilation Unit @ offset 0xb50:
   Length:        0x2151 (32-bit)
   Version:       4
   Abbrev Offset: 0x581
   Pointer Size:  4
 <0><b5b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <b5c>   DW_AT_producer    : (indirect string, offset: 0xb9ee4): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b60>   DW_AT_language    : 12	(ANSI C99)
    <b61>   DW_AT_name        : (indirect string, offset: 0xe3af7): ../Core/Src/main.c
    <b65>   DW_AT_comp_dir    : (indirect string, offset: 0x31da1): C:/Users/ipave/Documentos/GitHub/RTOSI/freertos_app_Example5_6/Debug
    <b69>   DW_AT_ranges      : 0x30
    <b6d>   DW_AT_low_pc      : 0x0
    <b71>   DW_AT_stmt_list   : 0x23f3
    <b75>   DW_AT_GNU_macros  : 0x249e5
 <1><b79>: Abbrev Number: 2 (DW_TAG_base_type)
    <b7a>   DW_AT_byte_size   : 1
    <b7b>   DW_AT_encoding    : 6	(signed char)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x70f2b): signed char
 <1><b80>: Abbrev Number: 3 (DW_TAG_typedef)
    <b81>   DW_AT_name        : (indirect string, offset: 0x41ad4): __uint8_t
    <b85>   DW_AT_decl_file   : 3
    <b86>   DW_AT_decl_line   : 43
    <b87>   DW_AT_decl_column : 24
    <b88>   DW_AT_type        : <0xb8c>
 <1><b8c>: Abbrev Number: 2 (DW_TAG_base_type)
    <b8d>   DW_AT_byte_size   : 1
    <b8e>   DW_AT_encoding    : 8	(unsigned char)
    <b8f>   DW_AT_name        : (indirect string, offset: 0xd9c35): unsigned char
 <1><b93>: Abbrev Number: 2 (DW_TAG_base_type)
    <b94>   DW_AT_byte_size   : 2
    <b95>   DW_AT_encoding    : 5	(signed)
    <b96>   DW_AT_name        : (indirect string, offset: 0xa80e9): short int
 <1><b9a>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9b>   DW_AT_name        : (indirect string, offset: 0xb7e2b): __uint16_t
    <b9f>   DW_AT_decl_file   : 3
    <ba0>   DW_AT_decl_line   : 57
    <ba1>   DW_AT_decl_column : 25
    <ba2>   DW_AT_type        : <0xba6>
 <1><ba6>: Abbrev Number: 2 (DW_TAG_base_type)
    <ba7>   DW_AT_byte_size   : 2
    <ba8>   DW_AT_encoding    : 7	(unsigned)
    <ba9>   DW_AT_name        : (indirect string, offset: 0xd83db): short unsigned int
 <1><bad>: Abbrev Number: 2 (DW_TAG_base_type)
    <bae>   DW_AT_byte_size   : 4
    <baf>   DW_AT_encoding    : 5	(signed)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x13308): long int
 <1><bb4>: Abbrev Number: 3 (DW_TAG_typedef)
    <bb5>   DW_AT_name        : (indirect string, offset: 0x8fd65): __uint32_t
    <bb9>   DW_AT_decl_file   : 3
    <bba>   DW_AT_decl_line   : 79
    <bbb>   DW_AT_decl_column : 25
    <bbc>   DW_AT_type        : <0xbc0>
 <1><bc0>: Abbrev Number: 2 (DW_TAG_base_type)
    <bc1>   DW_AT_byte_size   : 4
    <bc2>   DW_AT_encoding    : 7	(unsigned)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x56588): long unsigned int
 <1><bc7>: Abbrev Number: 2 (DW_TAG_base_type)
    <bc8>   DW_AT_byte_size   : 8
    <bc9>   DW_AT_encoding    : 5	(signed)
    <bca>   DW_AT_name        : (indirect string, offset: 0x66ce1): long long int
 <1><bce>: Abbrev Number: 2 (DW_TAG_base_type)
    <bcf>   DW_AT_byte_size   : 8
    <bd0>   DW_AT_encoding    : 7	(unsigned)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x2f4d0): long long unsigned int
 <1><bd5>: Abbrev Number: 4 (DW_TAG_base_type)
    <bd6>   DW_AT_byte_size   : 4
    <bd7>   DW_AT_encoding    : 5	(signed)
    <bd8>   DW_AT_name        : int
 <1><bdc>: Abbrev Number: 2 (DW_TAG_base_type)
    <bdd>   DW_AT_byte_size   : 4
    <bde>   DW_AT_encoding    : 7	(unsigned)
    <bdf>   DW_AT_name        : (indirect string, offset: 0x127bb): unsigned int
 <1><be3>: Abbrev Number: 3 (DW_TAG_typedef)
    <be4>   DW_AT_name        : (indirect string, offset: 0x41ad6): uint8_t
    <be8>   DW_AT_decl_file   : 4
    <be9>   DW_AT_decl_line   : 24
    <bea>   DW_AT_decl_column : 19
    <beb>   DW_AT_type        : <0xb80>
 <1><bef>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <bf0>   DW_AT_type        : <0xbe3>
 <1><bf4>: Abbrev Number: 6 (DW_TAG_const_type)
    <bf5>   DW_AT_type        : <0xbe3>
 <1><bf9>: Abbrev Number: 3 (DW_TAG_typedef)
    <bfa>   DW_AT_name        : (indirect string, offset: 0xa481b): uint16_t
    <bfe>   DW_AT_decl_file   : 4
    <bff>   DW_AT_decl_line   : 36
    <c00>   DW_AT_decl_column : 20
    <c01>   DW_AT_type        : <0xb9a>
 <1><c05>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c06>   DW_AT_type        : <0xbf9>
 <1><c0a>: Abbrev Number: 3 (DW_TAG_typedef)
    <c0b>   DW_AT_name        : (indirect string, offset: 0xd7f27): uint32_t
    <c0f>   DW_AT_decl_file   : 4
    <c10>   DW_AT_decl_line   : 48
    <c11>   DW_AT_decl_column : 20
    <c12>   DW_AT_type        : <0xbb4>
 <1><c16>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <c17>   DW_AT_type        : <0xc0a>
 <1><c1b>: Abbrev Number: 7 (DW_TAG_array_type)
    <c1c>   DW_AT_type        : <0xc0a>
    <c20>   DW_AT_sibling     : <0xc2b>
 <2><c24>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c25>   DW_AT_type        : <0xbdc>
    <c29>   DW_AT_upper_bound : 4
 <2><c2a>: Abbrev Number: 0
 <1><c2b>: Abbrev Number: 7 (DW_TAG_array_type)
    <c2c>   DW_AT_type        : <0xc0a>
    <c30>   DW_AT_sibling     : <0xc3b>
 <2><c34>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c35>   DW_AT_type        : <0xbdc>
    <c39>   DW_AT_upper_bound : 1
 <2><c3a>: Abbrev Number: 0
 <1><c3b>: Abbrev Number: 7 (DW_TAG_array_type)
    <c3c>   DW_AT_type        : <0xc0a>
    <c40>   DW_AT_sibling     : <0xc4b>
 <2><c44>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c45>   DW_AT_type        : <0xbdc>
    <c49>   DW_AT_upper_bound : 7
 <2><c4a>: Abbrev Number: 0
 <1><c4b>: Abbrev Number: 7 (DW_TAG_array_type)
    <c4c>   DW_AT_type        : <0xc0a>
    <c50>   DW_AT_sibling     : <0xc5b>
 <2><c54>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <c55>   DW_AT_type        : <0xbdc>
    <c59>   DW_AT_upper_bound : 11
 <2><c5a>: Abbrev Number: 0
 <1><c5b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <c5c>   DW_AT_byte_size   : 24
    <c5d>   DW_AT_decl_file   : 5
    <c5e>   DW_AT_decl_line   : 352
    <c60>   DW_AT_decl_column : 9
    <c61>   DW_AT_sibling     : <0xcb9>
 <2><c65>: Abbrev Number: 10 (DW_TAG_member)
    <c66>   DW_AT_name        : CR
    <c69>   DW_AT_decl_file   : 5
    <c6a>   DW_AT_decl_line   : 354
    <c6c>   DW_AT_decl_column : 17
    <c6d>   DW_AT_type        : <0xc16>
    <c71>   DW_AT_data_member_location: 0
 <2><c72>: Abbrev Number: 11 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0xe303c): NDTR
    <c77>   DW_AT_decl_file   : 5
    <c78>   DW_AT_decl_line   : 355
    <c7a>   DW_AT_decl_column : 17
    <c7b>   DW_AT_type        : <0xc16>
    <c7f>   DW_AT_data_member_location: 4
 <2><c80>: Abbrev Number: 10 (DW_TAG_member)
    <c81>   DW_AT_name        : PAR
    <c85>   DW_AT_decl_file   : 5
    <c86>   DW_AT_decl_line   : 356
    <c88>   DW_AT_decl_column : 17
    <c89>   DW_AT_type        : <0xc16>
    <c8d>   DW_AT_data_member_location: 8
 <2><c8e>: Abbrev Number: 11 (DW_TAG_member)
    <c8f>   DW_AT_name        : (indirect string, offset: 0xe30df): M0AR
    <c93>   DW_AT_decl_file   : 5
    <c94>   DW_AT_decl_line   : 357
    <c96>   DW_AT_decl_column : 17
    <c97>   DW_AT_type        : <0xc16>
    <c9b>   DW_AT_data_member_location: 12
 <2><c9c>: Abbrev Number: 11 (DW_TAG_member)
    <c9d>   DW_AT_name        : (indirect string, offset: 0xe339e): M1AR
    <ca1>   DW_AT_decl_file   : 5
    <ca2>   DW_AT_decl_line   : 358
    <ca4>   DW_AT_decl_column : 17
    <ca5>   DW_AT_type        : <0xc16>
    <ca9>   DW_AT_data_member_location: 16
 <2><caa>: Abbrev Number: 10 (DW_TAG_member)
    <cab>   DW_AT_name        : FCR
    <caf>   DW_AT_decl_file   : 5
    <cb0>   DW_AT_decl_line   : 359
    <cb2>   DW_AT_decl_column : 17
    <cb3>   DW_AT_type        : <0xc16>
    <cb7>   DW_AT_data_member_location: 20
 <2><cb8>: Abbrev Number: 0
 <1><cb9>: Abbrev Number: 12 (DW_TAG_typedef)
    <cba>   DW_AT_name        : (indirect string, offset: 0xe2a93): DMA_Stream_TypeDef
    <cbe>   DW_AT_decl_file   : 5
    <cbf>   DW_AT_decl_line   : 360
    <cc1>   DW_AT_decl_column : 3
    <cc2>   DW_AT_type        : <0xc5b>
 <1><cc6>: Abbrev Number: 13 (DW_TAG_structure_type)
    <cc7>   DW_AT_byte_size   : 4184
    <cc9>   DW_AT_decl_file   : 5
    <cca>   DW_AT_decl_line   : 405
    <ccc>   DW_AT_decl_column : 9
    <ccd>   DW_AT_sibling     : <0x10a7>
 <2><cd1>: Abbrev Number: 11 (DW_TAG_member)
    <cd2>   DW_AT_name        : (indirect string, offset: 0xe2e1a): MACCR
    <cd6>   DW_AT_decl_file   : 5
    <cd7>   DW_AT_decl_line   : 407
    <cd9>   DW_AT_decl_column : 17
    <cda>   DW_AT_type        : <0xc16>
    <cde>   DW_AT_data_member_location: 0
 <2><cdf>: Abbrev Number: 11 (DW_TAG_member)
    <ce0>   DW_AT_name        : (indirect string, offset: 0xe3204): MACFFR
    <ce4>   DW_AT_decl_file   : 5
    <ce5>   DW_AT_decl_line   : 408
    <ce7>   DW_AT_decl_column : 17
    <ce8>   DW_AT_type        : <0xc16>
    <cec>   DW_AT_data_member_location: 4
 <2><ced>: Abbrev Number: 11 (DW_TAG_member)
    <cee>   DW_AT_name        : (indirect string, offset: 0xe34cd): MACHTHR
    <cf2>   DW_AT_decl_file   : 5
    <cf3>   DW_AT_decl_line   : 409
    <cf5>   DW_AT_decl_column : 17
    <cf6>   DW_AT_type        : <0xc16>
    <cfa>   DW_AT_data_member_location: 8
 <2><cfb>: Abbrev Number: 11 (DW_TAG_member)
    <cfc>   DW_AT_name        : (indirect string, offset: 0xe3526): MACHTLR
    <d00>   DW_AT_decl_file   : 5
    <d01>   DW_AT_decl_line   : 410
    <d03>   DW_AT_decl_column : 17
    <d04>   DW_AT_type        : <0xc16>
    <d08>   DW_AT_data_member_location: 12
 <2><d09>: Abbrev Number: 11 (DW_TAG_member)
    <d0a>   DW_AT_name        : (indirect string, offset: 0xe3d02): MACMIIAR
    <d0e>   DW_AT_decl_file   : 5
    <d0f>   DW_AT_decl_line   : 411
    <d11>   DW_AT_decl_column : 17
    <d12>   DW_AT_type        : <0xc16>
    <d16>   DW_AT_data_member_location: 16
 <2><d17>: Abbrev Number: 11 (DW_TAG_member)
    <d18>   DW_AT_name        : (indirect string, offset: 0xe3d1b): MACMIIDR
    <d1c>   DW_AT_decl_file   : 5
    <d1d>   DW_AT_decl_line   : 412
    <d1f>   DW_AT_decl_column : 17
    <d20>   DW_AT_type        : <0xc16>
    <d24>   DW_AT_data_member_location: 20
 <2><d25>: Abbrev Number: 11 (DW_TAG_member)
    <d26>   DW_AT_name        : (indirect string, offset: 0xe3083): MACFCR
    <d2a>   DW_AT_decl_file   : 5
    <d2b>   DW_AT_decl_line   : 413
    <d2d>   DW_AT_decl_column : 17
    <d2e>   DW_AT_type        : <0xc16>
    <d32>   DW_AT_data_member_location: 24
 <2><d33>: Abbrev Number: 11 (DW_TAG_member)
    <d34>   DW_AT_name        : (indirect string, offset: 0xe3052): MACVLANTR
    <d38>   DW_AT_decl_file   : 5
    <d39>   DW_AT_decl_line   : 414
    <d3b>   DW_AT_decl_column : 17
    <d3c>   DW_AT_type        : <0xc16>
    <d40>   DW_AT_data_member_location: 28
 <2><d41>: Abbrev Number: 11 (DW_TAG_member)
    <d42>   DW_AT_name        : (indirect string, offset: 0xe3c74): RESERVED0
    <d46>   DW_AT_decl_file   : 5
    <d47>   DW_AT_decl_line   : 415
    <d49>   DW_AT_decl_column : 17
    <d4a>   DW_AT_type        : <0xc2b>
    <d4e>   DW_AT_data_member_location: 32
 <2><d4f>: Abbrev Number: 11 (DW_TAG_member)
    <d50>   DW_AT_name        : (indirect string, offset: 0xe3728): MACRWUFFR
    <d54>   DW_AT_decl_file   : 5
    <d55>   DW_AT_decl_line   : 416
    <d57>   DW_AT_decl_column : 17
    <d58>   DW_AT_type        : <0xc16>
    <d5c>   DW_AT_data_member_location: 40
 <2><d5d>: Abbrev Number: 11 (DW_TAG_member)
    <d5e>   DW_AT_name        : (indirect string, offset: 0xe29a0): MACPMTCSR
    <d62>   DW_AT_decl_file   : 5
    <d63>   DW_AT_decl_line   : 417
    <d65>   DW_AT_decl_column : 17
    <d66>   DW_AT_type        : <0xc16>
    <d6a>   DW_AT_data_member_location: 44
 <2><d6b>: Abbrev Number: 11 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0xe3c7e): RESERVED1
    <d70>   DW_AT_decl_file   : 5
    <d71>   DW_AT_decl_line   : 418
    <d73>   DW_AT_decl_column : 17
    <d74>   DW_AT_type        : <0xc0a>
    <d78>   DW_AT_data_member_location: 48
 <2><d79>: Abbrev Number: 11 (DW_TAG_member)
    <d7a>   DW_AT_name        : (indirect string, offset: 0xe3041): MACDBGR
    <d7e>   DW_AT_decl_file   : 5
    <d7f>   DW_AT_decl_line   : 419
    <d81>   DW_AT_decl_column : 17
    <d82>   DW_AT_type        : <0xc16>
    <d86>   DW_AT_data_member_location: 52
 <2><d87>: Abbrev Number: 11 (DW_TAG_member)
    <d88>   DW_AT_name        : (indirect string, offset: 0xe2eca): MACSR
    <d8c>   DW_AT_decl_file   : 5
    <d8d>   DW_AT_decl_line   : 420
    <d8f>   DW_AT_decl_column : 17
    <d90>   DW_AT_type        : <0xc16>
    <d94>   DW_AT_data_member_location: 56
 <2><d95>: Abbrev Number: 11 (DW_TAG_member)
    <d96>   DW_AT_name        : (indirect string, offset: 0xe3a13): MACIMR
    <d9a>   DW_AT_decl_file   : 5
    <d9b>   DW_AT_decl_line   : 421
    <d9d>   DW_AT_decl_column : 17
    <d9e>   DW_AT_type        : <0xc16>
    <da2>   DW_AT_data_member_location: 60
 <2><da3>: Abbrev Number: 11 (DW_TAG_member)
    <da4>   DW_AT_name        : (indirect string, offset: 0xe2fe3): MACA0HR
    <da8>   DW_AT_decl_file   : 5
    <da9>   DW_AT_decl_line   : 422
    <dab>   DW_AT_decl_column : 17
    <dac>   DW_AT_type        : <0xc16>
    <db0>   DW_AT_data_member_location: 64
 <2><db1>: Abbrev Number: 11 (DW_TAG_member)
    <db2>   DW_AT_name        : (indirect string, offset: 0xe3034): MACA0LR
    <db6>   DW_AT_decl_file   : 5
    <db7>   DW_AT_decl_line   : 423
    <db9>   DW_AT_decl_column : 17
    <dba>   DW_AT_type        : <0xc16>
    <dbe>   DW_AT_data_member_location: 68
 <2><dbf>: Abbrev Number: 11 (DW_TAG_member)
    <dc0>   DW_AT_name        : (indirect string, offset: 0xe32b5): MACA1HR
    <dc4>   DW_AT_decl_file   : 5
    <dc5>   DW_AT_decl_line   : 424
    <dc7>   DW_AT_decl_column : 17
    <dc8>   DW_AT_type        : <0xc16>
    <dcc>   DW_AT_data_member_location: 72
 <2><dcd>: Abbrev Number: 11 (DW_TAG_member)
    <dce>   DW_AT_name        : (indirect string, offset: 0xe32c2): MACA1LR
    <dd2>   DW_AT_decl_file   : 5
    <dd3>   DW_AT_decl_line   : 425
    <dd5>   DW_AT_decl_column : 17
    <dd6>   DW_AT_type        : <0xc16>
    <dda>   DW_AT_data_member_location: 76
 <2><ddb>: Abbrev Number: 11 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xe35ef): MACA2HR
    <de0>   DW_AT_decl_file   : 5
    <de1>   DW_AT_decl_line   : 426
    <de3>   DW_AT_decl_column : 17
    <de4>   DW_AT_type        : <0xc16>
    <de8>   DW_AT_data_member_location: 80
 <2><de9>: Abbrev Number: 11 (DW_TAG_member)
    <dea>   DW_AT_name        : (indirect string, offset: 0xe3618): MACA2LR
    <dee>   DW_AT_decl_file   : 5
    <def>   DW_AT_decl_line   : 427
    <df1>   DW_AT_decl_column : 17
    <df2>   DW_AT_type        : <0xc16>
    <df6>   DW_AT_data_member_location: 84
 <2><df7>: Abbrev Number: 11 (DW_TAG_member)
    <df8>   DW_AT_name        : (indirect string, offset: 0xe38ec): MACA3HR
    <dfc>   DW_AT_decl_file   : 5
    <dfd>   DW_AT_decl_line   : 428
    <dff>   DW_AT_decl_column : 17
    <e00>   DW_AT_type        : <0xc16>
    <e04>   DW_AT_data_member_location: 88
 <2><e05>: Abbrev Number: 11 (DW_TAG_member)
    <e06>   DW_AT_name        : (indirect string, offset: 0xe3906): MACA3LR
    <e0a>   DW_AT_decl_file   : 5
    <e0b>   DW_AT_decl_line   : 429
    <e0d>   DW_AT_decl_column : 17
    <e0e>   DW_AT_type        : <0xc16>
    <e12>   DW_AT_data_member_location: 92
 <2><e13>: Abbrev Number: 11 (DW_TAG_member)
    <e14>   DW_AT_name        : (indirect string, offset: 0xe3c88): RESERVED2
    <e18>   DW_AT_decl_file   : 5
    <e19>   DW_AT_decl_line   : 430
    <e1b>   DW_AT_decl_column : 17
    <e1c>   DW_AT_type        : <0x10a7>
    <e20>   DW_AT_data_member_location: 96
 <2><e21>: Abbrev Number: 14 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0xe32af): MMCCR
    <e26>   DW_AT_decl_file   : 5
    <e27>   DW_AT_decl_line   : 431
    <e29>   DW_AT_decl_column : 17
    <e2a>   DW_AT_type        : <0xc16>
    <e2e>   DW_AT_data_member_location: 256
 <2><e30>: Abbrev Number: 14 (DW_TAG_member)
    <e31>   DW_AT_name        : (indirect string, offset: 0xe3ba1): MMCRIR
    <e35>   DW_AT_decl_file   : 5
    <e36>   DW_AT_decl_line   : 432
    <e38>   DW_AT_decl_column : 17
    <e39>   DW_AT_type        : <0xc16>
    <e3d>   DW_AT_data_member_location: 260
 <2><e3f>: Abbrev Number: 14 (DW_TAG_member)
    <e40>   DW_AT_name        : (indirect string, offset: 0xe2b90): MMCTIR
    <e44>   DW_AT_decl_file   : 5
    <e45>   DW_AT_decl_line   : 433
    <e47>   DW_AT_decl_column : 17
    <e48>   DW_AT_type        : <0xc16>
    <e4c>   DW_AT_data_member_location: 264
 <2><e4e>: Abbrev Number: 14 (DW_TAG_member)
    <e4f>   DW_AT_name        : (indirect string, offset: 0xe2bbc): MMCRIMR
    <e53>   DW_AT_decl_file   : 5
    <e54>   DW_AT_decl_line   : 434
    <e56>   DW_AT_decl_column : 17
    <e57>   DW_AT_type        : <0xc16>
    <e5b>   DW_AT_data_member_location: 268
 <2><e5d>: Abbrev Number: 14 (DW_TAG_member)
    <e5e>   DW_AT_name        : (indirect string, offset: 0xe33a3): MMCTIMR
    <e62>   DW_AT_decl_file   : 5
    <e63>   DW_AT_decl_line   : 435
    <e65>   DW_AT_decl_column : 17
    <e66>   DW_AT_type        : <0xc16>
    <e6a>   DW_AT_data_member_location: 272
 <2><e6c>: Abbrev Number: 14 (DW_TAG_member)
    <e6d>   DW_AT_name        : (indirect string, offset: 0xe3c92): RESERVED3
    <e71>   DW_AT_decl_file   : 5
    <e72>   DW_AT_decl_line   : 436
    <e74>   DW_AT_decl_column : 17
    <e75>   DW_AT_type        : <0x10b7>
    <e79>   DW_AT_data_member_location: 276
 <2><e7b>: Abbrev Number: 14 (DW_TAG_member)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xe3347): MMCTGFSCCR
    <e80>   DW_AT_decl_file   : 5
    <e81>   DW_AT_decl_line   : 437
    <e83>   DW_AT_decl_column : 17
    <e84>   DW_AT_type        : <0xc16>
    <e88>   DW_AT_data_member_location: 332
 <2><e8a>: Abbrev Number: 14 (DW_TAG_member)
    <e8b>   DW_AT_name        : (indirect string, offset: 0xe356f): MMCTGFMSCCR
    <e8f>   DW_AT_decl_file   : 5
    <e90>   DW_AT_decl_line   : 438
    <e92>   DW_AT_decl_column : 17
    <e93>   DW_AT_type        : <0xc16>
    <e97>   DW_AT_data_member_location: 336
 <2><e99>: Abbrev Number: 14 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0xe3c9c): RESERVED4
    <e9e>   DW_AT_decl_file   : 5
    <e9f>   DW_AT_decl_line   : 439
    <ea1>   DW_AT_decl_column : 17
    <ea2>   DW_AT_type        : <0xc1b>
    <ea6>   DW_AT_data_member_location: 340
 <2><ea8>: Abbrev Number: 14 (DW_TAG_member)
    <ea9>   DW_AT_name        : (indirect string, offset: 0xe3219): MMCTGFCR
    <ead>   DW_AT_decl_file   : 5
    <eae>   DW_AT_decl_line   : 440
    <eb0>   DW_AT_decl_column : 17
    <eb1>   DW_AT_type        : <0xc16>
    <eb5>   DW_AT_data_member_location: 360
 <2><eb7>: Abbrev Number: 14 (DW_TAG_member)
    <eb8>   DW_AT_name        : (indirect string, offset: 0xe3ca6): RESERVED5
    <ebc>   DW_AT_decl_file   : 5
    <ebd>   DW_AT_decl_line   : 441
    <ebf>   DW_AT_decl_column : 17
    <ec0>   DW_AT_type        : <0x10c7>
    <ec4>   DW_AT_data_member_location: 364
 <2><ec6>: Abbrev Number: 14 (DW_TAG_member)
    <ec7>   DW_AT_name        : (indirect string, offset: 0xe3565): MMCRFCECR
    <ecb>   DW_AT_decl_file   : 5
    <ecc>   DW_AT_decl_line   : 442
    <ece>   DW_AT_decl_column : 17
    <ecf>   DW_AT_type        : <0xc16>
    <ed3>   DW_AT_data_member_location: 404
 <2><ed5>: Abbrev Number: 14 (DW_TAG_member)
    <ed6>   DW_AT_name        : (indirect string, offset: 0xe2ce6): MMCRFAECR
    <eda>   DW_AT_decl_file   : 5
    <edb>   DW_AT_decl_line   : 443
    <edd>   DW_AT_decl_column : 17
    <ede>   DW_AT_type        : <0xc16>
    <ee2>   DW_AT_data_member_location: 408
 <2><ee4>: Abbrev Number: 14 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0xe34d5): RESERVED6
    <ee9>   DW_AT_decl_file   : 5
    <eea>   DW_AT_decl_line   : 444
    <eec>   DW_AT_decl_column : 17
    <eed>   DW_AT_type        : <0x10c7>
    <ef1>   DW_AT_data_member_location: 412
 <2><ef3>: Abbrev Number: 14 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0xe2feb): MMCRGUFCR
    <ef8>   DW_AT_decl_file   : 5
    <ef9>   DW_AT_decl_line   : 445
    <efb>   DW_AT_decl_column : 17
    <efc>   DW_AT_type        : <0xc16>
    <f00>   DW_AT_data_member_location: 452
 <2><f02>: Abbrev Number: 14 (DW_TAG_member)
    <f03>   DW_AT_name        : (indirect string, offset: 0xe3cb0): RESERVED7
    <f07>   DW_AT_decl_file   : 5
    <f08>   DW_AT_decl_line   : 446
    <f0a>   DW_AT_decl_column : 17
    <f0b>   DW_AT_type        : <0x10d7>
    <f0f>   DW_AT_data_member_location: 456
 <2><f11>: Abbrev Number: 14 (DW_TAG_member)
    <f12>   DW_AT_name        : (indirect string, offset: 0xe30e4): PTPTSCR
    <f16>   DW_AT_decl_file   : 5
    <f17>   DW_AT_decl_line   : 447
    <f19>   DW_AT_decl_column : 17
    <f1a>   DW_AT_type        : <0xc16>
    <f1e>   DW_AT_data_member_location: 1792
 <2><f20>: Abbrev Number: 14 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0xe2d0a): PTPSSIR
    <f25>   DW_AT_decl_file   : 5
    <f26>   DW_AT_decl_line   : 448
    <f28>   DW_AT_decl_column : 17
    <f29>   DW_AT_type        : <0xc16>
    <f2d>   DW_AT_data_member_location: 1796
 <2><f2f>: Abbrev Number: 14 (DW_TAG_member)
    <f30>   DW_AT_name        : (indirect string, offset: 0xe3108): PTPTSHR
    <f34>   DW_AT_decl_file   : 5
    <f35>   DW_AT_decl_line   : 449
    <f37>   DW_AT_decl_column : 17
    <f38>   DW_AT_type        : <0xc16>
    <f3c>   DW_AT_data_member_location: 1800
 <2><f3e>: Abbrev Number: 14 (DW_TAG_member)
    <f3f>   DW_AT_name        : (indirect string, offset: 0xe3135): PTPTSLR
    <f43>   DW_AT_decl_file   : 5
    <f44>   DW_AT_decl_line   : 450
    <f46>   DW_AT_decl_column : 17
    <f47>   DW_AT_type        : <0xc16>
    <f4b>   DW_AT_data_member_location: 1804
 <2><f4d>: Abbrev Number: 14 (DW_TAG_member)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xe33c3): PTPTSHUR
    <f52>   DW_AT_decl_file   : 5
    <f53>   DW_AT_decl_line   : 451
    <f55>   DW_AT_decl_column : 17
    <f56>   DW_AT_type        : <0xc16>
    <f5a>   DW_AT_data_member_location: 1808
 <2><f5c>: Abbrev Number: 14 (DW_TAG_member)
    <f5d>   DW_AT_name        : (indirect string, offset: 0xe2a37): PTPTSLUR
    <f61>   DW_AT_decl_file   : 5
    <f62>   DW_AT_decl_line   : 452
    <f64>   DW_AT_decl_column : 17
    <f65>   DW_AT_type        : <0xc16>
    <f69>   DW_AT_data_member_location: 1812
 <2><f6b>: Abbrev Number: 14 (DW_TAG_member)
    <f6c>   DW_AT_name        : (indirect string, offset: 0xe30cd): PTPTSAR
    <f70>   DW_AT_decl_file   : 5
    <f71>   DW_AT_decl_line   : 453
    <f73>   DW_AT_decl_column : 17
    <f74>   DW_AT_type        : <0xc16>
    <f78>   DW_AT_data_member_location: 1816
 <2><f7a>: Abbrev Number: 14 (DW_TAG_member)
    <f7b>   DW_AT_name        : (indirect string, offset: 0xe3430): PTPTTHR
    <f7f>   DW_AT_decl_file   : 5
    <f80>   DW_AT_decl_line   : 454
    <f82>   DW_AT_decl_column : 17
    <f83>   DW_AT_type        : <0xc16>
    <f87>   DW_AT_data_member_location: 1820
 <2><f89>: Abbrev Number: 14 (DW_TAG_member)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xe3445): PTPTTLR
    <f8e>   DW_AT_decl_file   : 5
    <f8f>   DW_AT_decl_line   : 455
    <f91>   DW_AT_decl_column : 17
    <f92>   DW_AT_type        : <0xc16>
    <f96>   DW_AT_data_member_location: 1824
 <2><f98>: Abbrev Number: 14 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0xe34df): RESERVED8
    <f9d>   DW_AT_decl_file   : 5
    <f9e>   DW_AT_decl_line   : 456
    <fa0>   DW_AT_decl_column : 17
    <fa1>   DW_AT_type        : <0xc16>
    <fa5>   DW_AT_data_member_location: 1828
 <2><fa7>: Abbrev Number: 14 (DW_TAG_member)
    <fa8>   DW_AT_name        : (indirect string, offset: 0xe31af): PTPTSSR
    <fac>   DW_AT_decl_file   : 5
    <fad>   DW_AT_decl_line   : 457
    <faf>   DW_AT_decl_column : 17
    <fb0>   DW_AT_type        : <0xc16>
    <fb4>   DW_AT_data_member_location: 1832
 <2><fb6>: Abbrev Number: 14 (DW_TAG_member)
    <fb7>   DW_AT_name        : (indirect string, offset: 0xe3cba): RESERVED9
    <fbb>   DW_AT_decl_file   : 5
    <fbc>   DW_AT_decl_line   : 458
    <fbe>   DW_AT_decl_column : 17
    <fbf>   DW_AT_type        : <0x10e8>
    <fc3>   DW_AT_data_member_location: 1836
 <2><fc5>: Abbrev Number: 14 (DW_TAG_member)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xe2dd0): DMABMR
    <fca>   DW_AT_decl_file   : 5
    <fcb>   DW_AT_decl_line   : 459
    <fcd>   DW_AT_decl_column : 17
    <fce>   DW_AT_type        : <0xc16>
    <fd2>   DW_AT_data_member_location: 4096
 <2><fd4>: Abbrev Number: 14 (DW_TAG_member)
    <fd5>   DW_AT_name        : (indirect string, offset: 0xe388b): DMATPDR
    <fd9>   DW_AT_decl_file   : 5
    <fda>   DW_AT_decl_line   : 460
    <fdc>   DW_AT_decl_column : 17
    <fdd>   DW_AT_type        : <0xc16>
    <fe1>   DW_AT_data_member_location: 4100
 <2><fe3>: Abbrev Number: 14 (DW_TAG_member)
    <fe4>   DW_AT_name        : (indirect string, offset: 0xe384d): DMARPDR
    <fe8>   DW_AT_decl_file   : 5
    <fe9>   DW_AT_decl_line   : 461
    <feb>   DW_AT_decl_column : 17
    <fec>   DW_AT_type        : <0xc16>
    <ff0>   DW_AT_data_member_location: 4104
 <2><ff2>: Abbrev Number: 14 (DW_TAG_member)
    <ff3>   DW_AT_name        : (indirect string, offset: 0xe2fae): DMARDLAR
    <ff7>   DW_AT_decl_file   : 5
    <ff8>   DW_AT_decl_line   : 462
    <ffa>   DW_AT_decl_column : 17
    <ffb>   DW_AT_type        : <0xc16>
    <fff>   DW_AT_data_member_location: 4108
 <2><1001>: Abbrev Number: 14 (DW_TAG_member)
    <1002>   DW_AT_name        : (indirect string, offset: 0xe3d7e): DMATDLAR
    <1006>   DW_AT_decl_file   : 5
    <1007>   DW_AT_decl_line   : 463
    <1009>   DW_AT_decl_column : 17
    <100a>   DW_AT_type        : <0xc16>
    <100e>   DW_AT_data_member_location: 4112
 <2><1010>: Abbrev Number: 14 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0xe2ff5): DMASR
    <1015>   DW_AT_decl_file   : 5
    <1016>   DW_AT_decl_line   : 464
    <1018>   DW_AT_decl_column : 17
    <1019>   DW_AT_type        : <0xc16>
    <101d>   DW_AT_data_member_location: 4116
 <2><101f>: Abbrev Number: 14 (DW_TAG_member)
    <1020>   DW_AT_name        : (indirect string, offset: 0xe2ba6): DMAOMR
    <1024>   DW_AT_decl_file   : 5
    <1025>   DW_AT_decl_line   : 465
    <1027>   DW_AT_decl_column : 17
    <1028>   DW_AT_type        : <0xc16>
    <102c>   DW_AT_data_member_location: 4120
 <2><102e>: Abbrev Number: 14 (DW_TAG_member)
    <102f>   DW_AT_name        : (indirect string, offset: 0xe2f93): DMAIER
    <1033>   DW_AT_decl_file   : 5
    <1034>   DW_AT_decl_line   : 466
    <1036>   DW_AT_decl_column : 17
    <1037>   DW_AT_type        : <0xc16>
    <103b>   DW_AT_data_member_location: 4124
 <2><103d>: Abbrev Number: 14 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0xe3829): DMAMFBOCR
    <1042>   DW_AT_decl_file   : 5
    <1043>   DW_AT_decl_line   : 467
    <1045>   DW_AT_decl_column : 17
    <1046>   DW_AT_type        : <0xc16>
    <104a>   DW_AT_data_member_location: 4128
 <2><104c>: Abbrev Number: 14 (DW_TAG_member)
    <104d>   DW_AT_name        : (indirect string, offset: 0xe37fe): DMARSWTR
    <1051>   DW_AT_decl_file   : 5
    <1052>   DW_AT_decl_line   : 468
    <1054>   DW_AT_decl_column : 17
    <1055>   DW_AT_type        : <0xc16>
    <1059>   DW_AT_data_member_location: 4132
 <2><105b>: Abbrev Number: 14 (DW_TAG_member)
    <105c>   DW_AT_name        : (indirect string, offset: 0xe2ad7): RESERVED10
    <1060>   DW_AT_decl_file   : 5
    <1061>   DW_AT_decl_line   : 469
    <1063>   DW_AT_decl_column : 17
    <1064>   DW_AT_type        : <0xc3b>
    <1068>   DW_AT_data_member_location: 4136
 <2><106a>: Abbrev Number: 14 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0xe3049): DMACHTDR
    <106f>   DW_AT_decl_file   : 5
    <1070>   DW_AT_decl_line   : 470
    <1072>   DW_AT_decl_column : 17
    <1073>   DW_AT_type        : <0xc16>
    <1077>   DW_AT_data_member_location: 4168
 <2><1079>: Abbrev Number: 14 (DW_TAG_member)
    <107a>   DW_AT_name        : (indirect string, offset: 0xe2a67): DMACHRDR
    <107e>   DW_AT_decl_file   : 5
    <107f>   DW_AT_decl_line   : 471
    <1081>   DW_AT_decl_column : 17
    <1082>   DW_AT_type        : <0xc16>
    <1086>   DW_AT_data_member_location: 4172
 <2><1088>: Abbrev Number: 14 (DW_TAG_member)
    <1089>   DW_AT_name        : (indirect string, offset: 0xe32ca): DMACHTBAR
    <108d>   DW_AT_decl_file   : 5
    <108e>   DW_AT_decl_line   : 472
    <1090>   DW_AT_decl_column : 17
    <1091>   DW_AT_type        : <0xc16>
    <1095>   DW_AT_data_member_location: 4176
 <2><1097>: Abbrev Number: 14 (DW_TAG_member)
    <1098>   DW_AT_name        : (indirect string, offset: 0xe2b03): DMACHRBAR
    <109c>   DW_AT_decl_file   : 5
    <109d>   DW_AT_decl_line   : 473
    <109f>   DW_AT_decl_column : 17
    <10a0>   DW_AT_type        : <0xc16>
    <10a4>   DW_AT_data_member_location: 4180
 <2><10a6>: Abbrev Number: 0
 <1><10a7>: Abbrev Number: 7 (DW_TAG_array_type)
    <10a8>   DW_AT_type        : <0xc0a>
    <10ac>   DW_AT_sibling     : <0x10b7>
 <2><10b0>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <10b1>   DW_AT_type        : <0xbdc>
    <10b5>   DW_AT_upper_bound : 39
 <2><10b6>: Abbrev Number: 0
 <1><10b7>: Abbrev Number: 7 (DW_TAG_array_type)
    <10b8>   DW_AT_type        : <0xc0a>
    <10bc>   DW_AT_sibling     : <0x10c7>
 <2><10c0>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <10c1>   DW_AT_type        : <0xbdc>
    <10c5>   DW_AT_upper_bound : 13
 <2><10c6>: Abbrev Number: 0
 <1><10c7>: Abbrev Number: 7 (DW_TAG_array_type)
    <10c8>   DW_AT_type        : <0xc0a>
    <10cc>   DW_AT_sibling     : <0x10d7>
 <2><10d0>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <10d1>   DW_AT_type        : <0xbdc>
    <10d5>   DW_AT_upper_bound : 9
 <2><10d6>: Abbrev Number: 0
 <1><10d7>: Abbrev Number: 7 (DW_TAG_array_type)
    <10d8>   DW_AT_type        : <0xc0a>
    <10dc>   DW_AT_sibling     : <0x10e8>
 <2><10e0>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <10e1>   DW_AT_type        : <0xbdc>
    <10e5>   DW_AT_upper_bound : 333
 <2><10e7>: Abbrev Number: 0
 <1><10e8>: Abbrev Number: 7 (DW_TAG_array_type)
    <10e9>   DW_AT_type        : <0xc0a>
    <10ed>   DW_AT_sibling     : <0x10f9>
 <2><10f1>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <10f2>   DW_AT_type        : <0xbdc>
    <10f6>   DW_AT_upper_bound : 564
 <2><10f8>: Abbrev Number: 0
 <1><10f9>: Abbrev Number: 12 (DW_TAG_typedef)
    <10fa>   DW_AT_name        : (indirect string, offset: 0xe29aa): ETH_TypeDef
    <10fe>   DW_AT_decl_file   : 5
    <10ff>   DW_AT_decl_line   : 474
    <1101>   DW_AT_decl_column : 3
    <1102>   DW_AT_type        : <0xcc6>
 <1><1106>: Abbrev Number: 7 (DW_TAG_array_type)
    <1107>   DW_AT_type        : <0xc16>
    <110b>   DW_AT_sibling     : <0x1116>
 <2><110f>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1110>   DW_AT_type        : <0xbdc>
    <1114>   DW_AT_upper_bound : 1
 <2><1115>: Abbrev Number: 0
 <1><1116>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <1117>   DW_AT_type        : <0x1106>
 <1><111b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <111c>   DW_AT_byte_size   : 40
    <111d>   DW_AT_decl_file   : 5
    <111e>   DW_AT_decl_line   : 574
    <1120>   DW_AT_decl_column : 9
    <1121>   DW_AT_sibling     : <0x11a4>
 <2><1125>: Abbrev Number: 11 (DW_TAG_member)
    <1126>   DW_AT_name        : (indirect string, offset: 0x1595): MODER
    <112a>   DW_AT_decl_file   : 5
    <112b>   DW_AT_decl_line   : 576
    <112d>   DW_AT_decl_column : 17
    <112e>   DW_AT_type        : <0xc16>
    <1132>   DW_AT_data_member_location: 0
 <2><1133>: Abbrev Number: 11 (DW_TAG_member)
    <1134>   DW_AT_name        : (indirect string, offset: 0xae65d): OTYPER
    <1138>   DW_AT_decl_file   : 5
    <1139>   DW_AT_decl_line   : 577
    <113b>   DW_AT_decl_column : 17
    <113c>   DW_AT_type        : <0xc16>
    <1140>   DW_AT_data_member_location: 4
 <2><1141>: Abbrev Number: 11 (DW_TAG_member)
    <1142>   DW_AT_name        : (indirect string, offset: 0xc3f32): OSPEEDR
    <1146>   DW_AT_decl_file   : 5
    <1147>   DW_AT_decl_line   : 578
    <1149>   DW_AT_decl_column : 17
    <114a>   DW_AT_type        : <0xc16>
    <114e>   DW_AT_data_member_location: 8
 <2><114f>: Abbrev Number: 11 (DW_TAG_member)
    <1150>   DW_AT_name        : (indirect string, offset: 0x91ec2): PUPDR
    <1154>   DW_AT_decl_file   : 5
    <1155>   DW_AT_decl_line   : 579
    <1157>   DW_AT_decl_column : 17
    <1158>   DW_AT_type        : <0xc16>
    <115c>   DW_AT_data_member_location: 12
 <2><115d>: Abbrev Number: 10 (DW_TAG_member)
    <115e>   DW_AT_name        : IDR
    <1162>   DW_AT_decl_file   : 5
    <1163>   DW_AT_decl_line   : 580
    <1165>   DW_AT_decl_column : 17
    <1166>   DW_AT_type        : <0xc16>
    <116a>   DW_AT_data_member_location: 16
 <2><116b>: Abbrev Number: 10 (DW_TAG_member)
